{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=12030", "context": "", "first_story_block": "April 24, 2035 - 5:57pm - Your apartment in Pittsburgh\n\n*** You are Joe, a 27 year-old blonde dude. You have an older brother, William, who is serving in the military right now. His wife Amber is a middle-aged blonde doctor in Pittsburgh. ***\n\nEverything went to shit a long time ago, but people are just now realizing it, you think to yourself as you debate whether or not to go out with friends. It's a Friday night, and your usual gang is over at Robbie's, probably already getting drunk and stoned.\n\nThe evening news will be starting soon, however. You've been doing a decent job at keeping up with current events.\n\nHere's what you know so far:\n\nThere is no government, the economy has pretty much collapsed, and unemployment is the new epidemic to go along with crime and poverty. You actually lost your job at the steel mill recently due to circumstances out of your control. The state of affairs is a lot like those old dystopian films like Soylent Green or The Running Man.\n\nThe only thing keeping some people from blowing their brains out are these radio and TV programs ran by an organization calling itself Orion. You guess they could be related to FDR's fireside chats you've read about in old history books as a kid (that was before educational funding was abolished). Every evening, some dipshit comes on the air and tells the world that everything will be okay, and that all we need to do is trust in Orion and they will fix everything.\n\n6:26pm. The news is over. Same old shit. Some prostitute went fucking insane and shot up an entire stairwell full of sleeping homeless people in downtown Pittsburgh. DOW is down a record 1100 points. For the third time in a row, the Olympics are canceled.\n\nOn now, is Orion's fireside chat. They might be able to lift your spirits. But the guys at Robbie's are waiting, and you really need to get fucked up in light of your job loss.", "action_results": [{"action": "Watch Orion's telecast", "result": "You decide to stay home and (hopefully) gain some enlightenment from this bullshit telecast.\n\n\"We now have a solid plan worked out,\" the Orion representative says, \"We have already begun construction of eco-domes over every major city in the world to keep out the effects of pollution and global warming. We have deployed elite military squadrons all over the world in a state of temporary martial law. Crime has dropped significantly in these areas. Poverty has also been nearly abolished by our careful efforts. Please do not panic if you have not yet witnessed these exciting reformations in your area. I assure you we are tirelessly working around the clock with maximum effort and motivation. If you live in one of the following metropolitan areas, you are part of the next Chalk, Chalk 7. Orion will be saving you very soon.\"\n\nThe dude starts listing cities and major towns all over the world, one after another, for several minutes, then concludes with a typical fortune cookie expression of hope.\n\nAmong the cities named was Pittsburgh...\n\nYou are glad you watched that shit, though you are unsure of whether or not you can trust Orion. Do they really have everyone's best intentions in mind? What gives them the power to do all of this philanthropy?\n\nOh well, you think. Guess we'll have to wait and find out. It's not like things could get worse...\n\nRight?\n\nAfter a quiet, uneventful evening to yourself, you hit the sack and surprisingly dream of a better tomorrow.", "action_results": [{"action": "The Next Day", "result": "You decide to sleep in, since you don't have shit to do today. It's Saturday after all.\n\nYou wonder whether or not you should try to find a new job. You don't own a computer and the newspaper stopped coming years ago, so you'd have to go downtown. You could definitely use the money, even if it's a shitty job, but rent is rent and it's almost the end of the month.\n\nThen again, what's available? If you couldn't even stay at a steel mill, how are you supposed to find any other work?\n\nYour thoughts are interrupted by a rumbling outside. You go to the window and look down.\n\nA military convoy and countless troops is rolling through the street. It's Orion - martial law is in effect.\n\nHope has come to Pittsburgh!", "action_results": [{"action": "Two Years Later...", "result": "April 5, 2037 - 9:35pm - Your new fung shway Orion living quarters\n\nFor the past 2 years, you have been living in a beautiful apartment complex built by Orion. You got your old job back at the steel mill, which has been rebuilt - it is now much cleaner, safer, and you actually enjoy working there.\n\nThe air in the city is also much cleaner and the temperature stays at a constant 75 degrees, no matter what season. That's because Orion has built an eco-dome over Pittsburgh, which filters out pollutants and regulates the temperature. It's like living in a giant fucking Astrodome of plexiglass, so you still get the sunshine. And like Orion promised, poverty, crime, unemployment, and all the other shit from before has been pretty much abolished.\n\nThe present times are wonderful. Some would say Pittsburgh is like a utopia now. You guess the same could be said all over the world. Orion has gone completely global and they are now the world's government and military. We still have our own military, however, but Orion is obviously considered an ally.\n\nRobbie is now your roommate. He's a pale and scrawny little bastard with a buzz cut, but you get along. Once in a while, his hot brunette hipster girlfriend he doesn't deserve comes over.\n\nTonight is Friday night and she is there along with the usual gang: Adrian, the big friendly (and black) giant, and Turk and his fairly cute redhead girlfriend, Tiffany. Turk's a little heavy set and wears coke bottle glasses, but has the coolest fro for a white dude you've ever seen.\n\nJust as you're about to light a bowl of chronic, the door is kicked in. In storms a squad of Orion soldiers. Without hesitation, they grab Adrian, Leslie, and Tiffany and storm back out with them. You, Robbie, and Turk are stunned and wonder why they didn't take you.\n\nYou feel you should act to save them, but with no weapons, it would be difficult. You knew you should have bought a gun when you had the chance! Then again, there are 3 of you. You might have enough manpower to take down 1 or 2 of the bastards with your bare hands.\n\n\"They took my fucking girl!\" yells Robbie.\n\n\"Mine, too, you dick!\" replies Turk. The heartbreak is too much for you to bear, for Turk at least. You hope to have Leslie for yourself, so you agree to attempt the rescue.", "action_results": [{"action": "Try to rescue your 3 friends", "result": "The 3 of you decide to act fast. With no weapons, you run out into the hall and spot the squad moving for the elevator. They board it, all but one of them who stays behind to secure the area.\n\n\"Hey, motherfucker!\" yells Robbie just before ducking behind a plant. The soldier snaps his head towards your direction and aims his rifle. You and Turk immediately hide just as Robbie did. The soldier slowly creeps towards you guys. Finally, he is so close, you can touch him. Robbie nods to you and Turk.\n\nYou and Turk are able to tackle the bastard and knock him unconscious. On his person is an assault rifle. That will definitely come in handy! Turk also grabs the dude's sidearm, a 9mm pistol.\n\nThen he proceeds to shoot the dude in the fucking head, killing him in his unconscious state.\n\n\"Damn, Turk! That's fucked up!\" you say.\n\nDon't want him sneaking up on us when he wakes up, right?\" Turk replies. Well, he has a point.\n\nJust then, there's a huge explosion behind your group. Your apartment has just been obliterated by a stray tank shell. The 3 of you are stunned, but okay. Good thing you weren't in there!\n\nYou and your friends quickly head down the stairs to try to intercept the elevator. You manage to get to the lobby before Orion does. The lobby is filled with rubble and shattered glass. Outside, a tank rolls by.\n\nWorld War III has just begun! Our military is rebelling against Orion, but why? Aren't we allies, you wonder.\n\nThe elevator opens...\n\nTurk claims he can take care of the troops that come out with just the pistol. He has roughly 14 shots. You have a full assault rifle clip, on the other hand.", "action_results": [{"action": "Save your ammo, led Turk handle it", "result": "Inside the elevator, you see the bodies of Leslie, Adrian, and Tiffany. Those fucking Orion bastards executed them!\n\n\"NO! TIFF, SWEETHEART! FUCK YOU, MOTHERFUCKERS!\" Turk goes batshit crazy with his pistol and manages to take down 2 of the soldiers, but eventually they get the better of him - he's gunned down. Robbie, unarmed, is immediately shot in the head.\n\nWithout the element of surprise, your assault rifle is pretty much useless against the rest of the elite squad. Without any urban warfare training (or training, period), you don't stand a chance.\n\nAfter a short-lived firefight, you are gunned down as well...", "action_results": []}, {"action": "Turk doesn't pack enough heat, light 'em up with the rifle!", "result": "Inside the elevator, you see the bodies of Leslie, Adrian, and Tiffany. Those fucking Orion bastards executed them!\n\nYou go batshit crazy with the assault rifle and manage to get the jump on the Orion squad. They are all killed in a matter of seconds.\n\nThe 3 of you walk over and stock up on weapons and ammo from the dead soldiers. Robbie then walks over and kneels next to Leslie's body and just looks at her a moment before standing up again.\n\n\"Let's get out of here,\" he says. What a heartless dick, you think, he deserves this grief.\n\nThe 3 of you sneak out into the street and it's utter chaos. The Alliance is fighting Orion everywhere you look. Tank shells are exploding, buildings are collapsing, men are dying.\n\n\"Where are we gonna go, dudes?\" asks Turk.\n\nYou realize your brother William might be able to help if you go to his place, but he's more than likely fighting Orion right now. Plus, his place is far, especially on foot.\n\nPerhaps the Alliance soldiers in front of your building would know where he is, but that means being right in the line of fire. Alternatively, you could go up to Turk's apartment - he lives in the same building as you and Robbie. Perhaps it is still intact and you can turn on the TV and find out everything that's going on, but the building's been receiving one hell of a shelling.", "action_results": [{"action": "Consult with nearby Alliance soldiers", "result": "The 3 of you approach a nearby squadron of Alliance soldiers pinned down by Orion machine guns. The Captain in charge sees you as you crouch behind the sandbag next to him.\n\n\"What the fuck are you doing here? You guys are civvies!\"\n\n\"We have guns,\" you say, \"That should count for something. I was hoping you could tell me where Sergeant William Bradley is.\"\n\n\"Yeah, he went looking for his dumb-ass stoner brother.\"\n\n\"Fuck you, man! So he's in there?\" you ask as you point to your apartment building.\n\n\"Yeah, he took a squad through the side door in the alley. Said his brother is on the third floor. I ain't going in there, though. That shit's coming down any minute!\"\n\nSuddenly, a massive group of fucked up looking people come running towards you.\n\n\"GET THE FUCK BACK! GET OUT OF THE STREET!\" yells the Captain, but they don't seem to listen. Strangely, they're also growling and snarling.\n\nThen they attack Robbie and Turk and start to bite into them! They rip them apart and even start tearing their guts out!\n\n\"Shit! They got out!\" says the Captain before he's devoured by these maniacal people. To make matters worse, your apartment building finally collapses and starts to fall right into the street. Not wanting to stick around to get cannibalized or crushed, you're only choice is to head to William's.", "action_results": [{"action": "Go to your brother William's", "result": "You barely escape from the atrocities in the street. The only reason you are able to get away is because the crazies are too busy eating your friends and the Captain.\n\nJust then, your apartment building finally collapses into the street and onto part of the adjacent parking garage, where your car is. It has crushed most of the fucked up cannibals, but there are still dozens of them coming at you from the alleys. They also swarm the parking garage. You doubt you will be able to get to your car now, but William's place is far on foot and you don't think you can outrun these fuckers for long. You are also very low on ammo for your assault rifle.", "action_results": [{"action": "You need your car - shoot your way into the parking garage", "result": "You decide to attempt to make your way into the garage. Your car is on the second level, so you have to get to the stairs.\n\nYou manage to kill your way past the crazies and make it up the stairs, but you run out of ammo.\n\nThe second level appears to be deserted. You run to your car and find it perfectly fine. The collapse had just missed it. You can hear the growls of the crazies and gunfire of the war echoing throughout the garage.\n\nYou hop into your car and drive to the exit ramp. It is blocked by a crowd of those fucked up cannibals.", "action_results": [{"action": "You won't be able to drive through them - head for the top floor", "result": "Your piece of shit car can't run over this many people, you think, as you reverse back up the ramp.\n\nYou drive up to the top level of the garage, stop the car, and get out. You notice a helicopter flying low over the nearby rooftops.\n\nYou can hear the crazies coming up the ramp - they'll be on the top level any second now. You've got the get off the garage!\n\nThere's a building next to the garage, about the same height. You think you can make the jump.\n\nThen again, if you could signal that helicopter, you'd be rescued, but it might take a while to get over to you, if it even spots you at all.", "action_results": [{"action": "Flash your car's lights to attract the helicopter", "result": "You frantically flash your car's brights, and even try turning the lights on and off over and over, but the helicopter never seems to see you. It just keeps on flying...\n\nThe crazies have made it to the top level. In your state of panic, you don't notice what's going on behind you...\n\nOne of the zombies takes a chomp out of your neck. The rest soon join in the feast...", "action_results": []}, {"action": "The helicopter won't get to you in time - jump to the other roof", "result": "You decide to take the fast way off the garage. The helicopter is just too damn far, you think.\n\nYou walk away from your car and line yourself up to get a good running jump. You start your run and leap from the edge with all of your strength.\n\nYou make it! You clear the edge of the other roof and perform a somersault, just like they do in the movies.\n\n\"Fuck yeah!\" You turn around and see the crazies swarming your car. \"Yeah, suck it, zombies!\"\n\nYour celebration is short-lived, however, when you spot an Orion squad storm onto the roof from the roof access door. You quickly hide behind the air duct apparatus.", "action_results": [{"action": "Stand up and surrender - otherwise, they'll kill you if they find you!", "result": "You stand up and put your hands in the air. \"Don't shoot!\" There's no point in trying to evade an elite team of soldiers.\n\nBut Orion's no longer taking prisoners. You saw what they did to your friends in the elevator.\n\nUpon spotting you, they don't hesitate to shoot you in the head...", "action_results": []}, {"action": "Stay hidden and wait for them to leave", "result": "\"All clear!\" one of the squad members calls out. They storm back down into the building. It looks like Orion's searching the entire city for any and all survivors! They're exterminating humanity!\n\nA little while later, with no way else down, you have no choice but to follow behind them through the roof access door.\n\nThe building is another apartment building. The hallways are filled with dead bodies, bullet holes, and streaks of blood on the walls. There are also half-eaten corpses with their guts exposed.\n\nHoly fuck! you think to yourself, as you progress through the building, trying every possible door.\n\nRoom after room are filled with innocent people murdered in cold blood in their own homes. In one of the apartments you enter, there is blood and guts all over the floor and walls. There are a dozen or so of those crazies kneeling down or sitting against the wall...\n\nThey're feeding on human body parts...\n\nYou immediately close the door and a wave of horrific trauma hits you. You'll never be able to get that out of your head. Guess Orion wasn't as thorough as they thought.\n\nEventually, you make it down to the first story, a Chinese restaurant. In the preceding chaos, you couldn't hold onto your rifle. You could use a weapon now.\n\nBut right outside is a Humvee - you can hear it's engine still running...", "action_results": [{"action": "Search the kitchen for a weapon first", "result": "You walk into the kitchen of the restaurant. Inside, you see a young Chinese woman closely holding a little Chinese girl. The little girl is crying, and the woman looks scared to death. When she sees you, she pulls her daughter closer to her.", "action_results": [{"action": "Say nothing, grab a butcher's knife, and walk out", "result": "You walk over and grab a big-ass butcher's knife from the counter. This is what you came for, you think, you don't have time to help others.\n\nAs you turn around to walk out, a crazy Chinese man, presumably the restaurant owner, is coming at you with a meat cleaver.\n\n\"You mudda fooka! You try eat my famry! You die, zombie man!\"\n\nBefore you can say anything, the crazy bastard drives the cleaver right into your forehead...", "action_results": []}, {"action": "\"It's okay, I'm not going to hurt you!\"", "result": "The little girl continues to whimper quietly.\n\nJust then, you notice a Chinese dude behind you, holding a meat cleaver. He is mad-dogging you with an evil stare.\n\n\"It's alright,\" you say again, \"What are your names?\"\n\nThe man finally lowers the cleaver and responds, \"I am Chang. Dat is my wife Kiki and my daughta Mooki.\"\n\n\"Well,\" you respond, \"It is nice to meet all of you. Would you happen to know a way out of this shit?\"\n\nJust then, the dude looks at his wife, who nods back at him. Then the dude fucking cuts your left hand off and punches you out!\n\nWhen you wake up, it is Saturday afternoon. Your nub has been cauterized. You are in what looks like a cage in a junkyard. There are countless other cages with people in them.\n\nIt's a goddamn slave camp...those Chinese fuckers thought ahead!\n\nWith Chang and Kiki as your masters, you and the other slaves are brutally worked nearly to death day in and day out for years - building the shanty town in the junkyard, salvaging material from the scrap metal, sometimes even being forced into prostitution for the people in the shanty town.\n\nAt one point, you are forced into a cage match with a couple of zombies for their entertainment!\n\nThis is your new life...there is no hope...did you expect the apocalypse to be pleasant?", "action_results": []}]}, {"action": "No time - get to that Humvee!", "result": "You decide to make a run for the Humvee. There should be weapons inside, you think.\n\nAs you step out of the restaurant, you are still in a war zone. The night lights up with explosions and gunfire all round. You can hear agonizing screaming of soldiers and the snarls of zombies. This is a pretty fucked situation.\n\nYou get to the Humvee and, to your luck, there's nothing in it but an assault rifle.\n\nYou begin driving to William's place, which is in Fox Chapel on the north end of town. You begin crossing the Highland Park Bridge, which takes you into Fox Chapel. Luckily, there's not much traffic yet, what with people trying to leave the city and all.\n\nSuddenly, the Humvee dies on the bridge. You ran out of gas! In the chaos, you didn't think to check the fuel level.\n\nConfused, you get out and notice a dripping underneath the Humvee. A bullet must have hit the gas tank, and it all leaked out! Shit!", "action_results": [{"action": "Cross the bridge on foot", "result": "It's not much further, you decide. You manage to cross the bridge and traverse the streets of Fox Chapel with the rifle you found in the Humvee.\n\nOnce in a while, you are attacked by a zombie, but nothing you can't handle.\n\nYou run out of ammo, but you finally make it to William's.", "action_results": [{"action": "Go inside the house", "result": "Upon walking in, you see William and Amber in the kitchen.\n\n\"Thank God - Joe!\" says Will, \"I tried to find you at your apartment before it came down. We need to get you out of the city. I've already packed you 2 plenty of food, guns, ammo, clothing - that sort of thing.\"\n\n\"What's going on? Why is Orion killing everybody?\"\n\n\"It's all part of their 'Final Solution,' just like the Nazis had over 90 years ago. They were throwing nearly everyone in concentration camps, forcing them to work, performing horrendous experiments on them. But now, I guess they're exterminating everyone in response to the outbreak.\"\n\n\"The outbreak? You mean the zombies?\"\n\n\"Yeah, the, er, zombies. They developed this toxin that can reanimate dead tissue. When the bodies started piling up, the Orion personnel decided to use the toxin on them. Thing is, the dead people that came back weren't themselves at all...my unit saw...they overran the entire camp...Orion couldn't contain it...the dead, they...\"\n\nWill puts his hand to his mouth, clears his throat, and swallows, \"they fed on people - my men, Orion's men, civilians - pretty much anyone they could catch.\"\n\n\"Shit, I saw it, too. It's awful, what's happening.\"\n\nWilliam goes into the kitchen and comes back with the provisions he packed.\n\n\"Look, you and Amber need to get to the dropship at the airport. Obviously, it's outside of the dome, so I'll have to get you guys past the entry/exit checkpoint. Once you're at the airport, just get on the dropship. Don't worry about me - I'm being evacuated, also, with the rest of the Alliance military. We're going to the same place as you and all of the civilians, so I'll see you there.\"\n\nYou look at Will like he's fucking crazy. \"Dropship? Evacuation? Where are we going?\"\n\n\"Damn it, I thought you liked keeping up on the news! The entire planet is shuttling itself into space and living aboard the ships until The Frontier can be colonized. The Frontier is an inhabitable planet on the edge of the galaxy...humanity's starting a new life there...\"\n\nYou can't believe it! All those late night conversations you used to have with your friends while stoned out of your mind about space colonization - you never thought it would actually come to fruition!\n\n\"We need to leave now,\" Will continues, \"or else we'll be stuck here.\"\n\nSo the 3 of you pack up all of the provisions into Will's jeep, then head for the airport. When you get to the security checkpoint to leave the eco-dome, it has been overrun by zombies. They are feeding on the bodies of the Orion guards.\n\n\"Serves them right,\" mutters Amber.\n\nWill continues driving, and you eventually get to the airport. Just as you expected, the traffic is horrendous going into the airport. The 3 of you get out of the jeep, grab the provisions, and head for the terminal on foot.\n\nThe crowds of people have jammed themselves in the terminal, desperate to get on the dropship.\n\n\"Shit! There's no way they're going to get you on the ship with all these people,\" says Will, \"I might be able to sneak you guys on the military ship with me. We're boarding on the runway right now.\"", "action_results": [{"action": "Go for the military ship", "result": "\"Let's go for your ship, Will.\"\n\nThe 3 of you run to the runway and Will shows his military ID to the guard by the entrance ramp onto the ship.\n\n\"No guests, sir,\" he says.\n\n\"Listen, private,\" replies Will, \"I outrank you. If you wanna keep what little of a life you have, you're gonna left these 2 on with me.\"\n\n\"Sorry, sir, that's against regulations. Only military personnel on this ship. Have your friends process through the terminal to the civilian ship. They will let them on.\"\n\n\"Friends?!?!? THIS IS MY FUCKING FAMILY!!!\" Will starts to lose his cool and looks like he's about to cap this dipshit private.\n\nHe looks at you, as if hoping you can speak for him.", "action_results": [{"action": "\"It's cool, Will. We'll head for the civilian ship. You take this one.\"", "result": "\"I'm gonna make sure you guys make it on before I even think of leaving this planet!\" says Will. What a guy.\n\nThe 3 of you head for the terminal, where the civilians must be processed onto the dropship.\n\nYou can barely even get inside it's so crowded. The whole damn city's there! The 3 of you push through the crowd to get to the processing kiosks.\n\nSuddenly, on a loudspeaker, a voice announces that the ship is launching in 5 minutes and they can only take children and women from this point on.\n\n\"Shit!\" you yell, \"Amber, you need to get on there, now! Get in the processing line.\"\n\n\"Forget it,\" she replies, \"I'm not leaving you 2.\"\n\n\"Amber,\" replies Will calmly, \"baby, he's right. You need to go now.\"\n\nA tear rolls down her cheek, \"I-I can't do that.\"\n\nSuddenly, the crowd is screaming and panicking and pushing their way deeper into the terminal away from the main doors.\n\nYou look and see a huge horde of zombies pouring into the building.\n\n\"Oh my God,\" Will says quietly and grabs your arm and Amber's and pushes through the crowd.\n\nBehind you, the zombies are having a feeding frenzy on the poor bastards that were too close to the doors. The rest of the crowd isn't so lucky, either, as countless more zombies chase them down and pull them to the ground.\n\nSoon enough, all around you, countless zombies are attacking people, tackling, pulling guts out, tearing necks open.\n\nThe 3 of you book it through the enormous areas of the airport terminal, trying not to get trampled or eaten.\n\n\"There!\" Amber points to a maintenance door that opens towards you. You head for it and enter it. The zombies behind you slam against the door and claw at the window.\n\nYou are now in a long, white hallway. It's very sterile and quiet compared to the screaming and bloodshed occurring on the other side of the door.\n\n\"This hallway should take us to the runway where the dropship is,\" says Will.\n\nYou head down the hall towards the runway. You manage to get outside and there she is! The dropship is enormous, probably capable of holding tens of thousands.\n\nSuddenly, the engines ignite and the ship takes off. Thousands of people on the runway are left behind, shrieking in panic.\n\nThen more zombies come across the runway and attack that crowd.\n\n\"Let's go!\" says Will. The 3 of you head for a garage where they keep the aircraft maintenance vehicles and luggage towing trucks.\n\nInside is an old, scruffy-looking mechanic in his blue coveralls, smoking a cigar. He's sitting at his workbench with a shotgun in his lap.\n\n\"You in a barn?\" he asks, \"Close the damn door!\"\n\nYou close the damn door then approach the window to see outside.\n\n\"Don't do that,\" continues the mechanic, \"Orion's usin' night vision this evenin'.\"\n\n\"Orion's out there?\"\n\n\"That's right. Been killin' everybody out there. People and geezers alike. They were tryin' to keep people off the dropship at first. Then they musta got word of the geezers comin'. They left before they could be turned into supper, know what I mean? But they're watchin' us still. I can feel it, and they'll be back to finish what they started.\"\n\n\"Why didn't you try to get on the dropship?\" asks Will, \"All of the airport personnel get guaranteed passage.\"\n\n\"Thought about it. Not worth it.\"\n\n\"Why not?\" you ask.\n\n\"Motion sickness. Had it since I was a little boy.\"\n\nWill looks at the mechanic like he has 3 heads. \"What the hell kind of an excuse is that?\"\n\n\"Look, are we gonna sit here and chat all night, or do you wanna get the hell on outta here?\"\n\n\"But you just said Orion's out there,\" you say.\n\n\"Well they ain't gonna let us stay here for long, I can guarantee you that.\"", "action_results": [{"action": "Stay in the garage", "result": "\"Let's wait it out a minute,\" you suggest.\n\n\"Alright,\" replies the mechanic, \"you're the boss.\"\n\n\"What's your name, anyway?\"\n\n\"Name's Augustus. Just call me Gus.\"\n\n\"Alright, Gus,\" says Amber, \"What do we do now?\"\n\n\"Well, seein' as we're kinda stuck in here, why don't we make ourselves more comfortable?\"\n\nSuddenly, Gus shoots you and Will in the leg with his shotgun. The 2 of you fall to the ground in agony, bleeding all over the floor.\n\nThen he rushes over to Amber and grabs her gun before she can use it. The bastard throws it away, tears off Amber's shirt and jeans and rapes her! You and Will lie helpless, watching.\n\n\"YOU FUCKING PIECE OF SHIT!\" yells Will as he breaks down into tears.", "action_results": [{"action": "You have to stop Gus! - Crawl your way toward Amber's gun", "result": "When Gus threw Amber's gun, it landed just several feet from you. So you begin to crawl toward it with all of your strength.\n\nMeanwhile, Gus is having his way with Amber who is pinned against the workbench. His shotgun is still slung over his shoulder.\n\nJust as you get to the gun on the floor, Gus sees you out of the corner of his eye.\n\n\"Oh no you don't!\" he says as he turns around and blasts you with the shotgun...", "action_results": []}, {"action": "There's nothing you can do - wait it out and maybe help will come", "result": "Unfortunately, no one comes to save you. You and Will pass out from the gunshot wound.\n\nWhen you wake up, the 3 of you are lying on a cement floor. You have no idea what time it is or where you are.\n\nYour hands are chained to the cement wall. The entire room is a concrete block save for what looks like a mirror across from the 3 of you.\n\nOver an intercom system, you hear a voice, \"Your wounds have been treated and you are safe.\"\n\n\"What is this?\" asks Will.\n\n\"We found you at the airport. You were under some stress due to an individual by the name of Augustus. He will no longer be a problem.\"\n\nJust then, a section of the wall opens. It is a door you didn't notice. In walks a man in a suit holding a file. He walks over to you and shows you a photo from the file. It is of a nearly completely devoured body wearing a jumpsuit - the nametag says Augustus.\n\n\"Jesus,\" Amber says, \"What happened exactly? Where are we?\"\n\n\"I understand you have questions,\" the man in the suit replies, \"Let me begin by introducing myself. I am Leon.\"\n\n\"What the hell is this?\" Will asks again, yanking at his chains.\n\n\"You are in a place of research. We are merely interested in finding a cure for Experiment 28, or just E-28. You probably know it better as the 'zombie' toxin. You see, we developed E-28, and now we must find a way to destroy it.\"\n\n\"Orion...\" you say, \"Son of a bitch!\"\n\n\"You let us go right fucking now!\" yells Will.\n\n\"I'm afraid I cannot do that,\" replies Leon, \"We are on the verge of discovering something promising here.\"\n\n\"So why do you need us?\" asks Amber.\n\n\"Excellent question...\" Leon walks back out and goes back behind the mirror. You realize now that it's a double-sided mirror, like the kind you see in an interrogation room.\n\nJust then, another section of the wall opens up underneath the glass and in storms a horde of zombies!\n\n\"WHAT THE FUCK IS THIS!?!?\" yells Will yet again.\n\nThe majority of the zombies go for Will first. Some of the others go for you, and the fewest number go for Amber.\n\nThose Orion fuckers probably want to see what type of human meat the zombies enjoy most! Apparently, whoever has the most meat on their bones is the most desirable.\n\nAs you are eaten alive, you can't help but think this is Orion's idea of \"research.\"", "action_results": []}]}, {"action": "Leave the garage and try to escape the airport", "result": "\"We're not waiting here to die,\" you say, \"Let's get going.\"\n\nSo the 3 of you leave the garage and walk out onto the runway. It is completely deserted and pitch black. The majority of the zombies have moved on to find more victims elsewhere.\n\nAs you make your way back to your vehicles, you spot half-eaten corpses and lone zombies wandering around.\n\n\"Don't shoot them,\" says Will, \"We can sneak past.\"\n\nSuddenly, when you approach the gate that leads back to the cars from the runway, the gate opens. Behind you, an Orion convoy of trucks is rumbling toward the gate!\n\n\"Go-go-go!\" whispers Will as the 3 of you rush behind a building.\n\n\"Shit, Will,\" you say, \"That might be our only way out.\"", "action_results": [{"action": "Stay hidden and let the convoy pass", "result": "You decide that it is too risky to try to get on one of the trucks. You stay where you are and let the convoy leave the airport.\n\n\"Where do you think it was going?\" you ask.\n\n\"Probably to their dropship downtown,\" replies Amber, \"Doesn't matter now. We need to get to the cars...Will?\"\n\nYou look and Will is sitting against the wall, staring down at the ground in deep thought. He stands up and puts his arm around Amber and holds her close, \"I know this situation's far from ideal, but we're all together now. We have plenty of provisions. We just need to find a place to-\"\n\nJust then, the 3 of you hear the crackle of a radio. You turn around and in the distance are 3 or 4 zombies feeding on a corpse. The radio is a walkie-talkie on the belt of the corpse. As you approach it, you and William dispatch the zombies with your weapons.\n\nThe corpse is an Orion soldier! The radio crackles again. On the other end is the voice of a distressed Orion soldier and lots of gunfire:\n\n\"Mayday, mayday. Calling all districts. This is Delta 4-6, Seattle district. We are overrun by the contaminants, I repeat - we are overrun by the contaminants. Dropship liftoff has been terminated. The pilot and co-pilot are both deceased. I am the only one left. Please respond, over.\"\n\n\"Orion's evacuating, too!\" you say.\n\nThe transmission continues:\n\n\"I repeat - mayday, mayday. Calling all districts. This is Delta 4-6, are there any units still remaining on the surface? I repeat - are there any-AAAAAHHHHHHHHHHH!!!-\"\n\nYou hear the snarls of zombies just before the transmission cuts off, then silence...\n\nAfter a short while, William finally has an idea, \"That dropship...in Seattle...what if we could get to it? Earth is completely abandoned - besides that convoy, we're probably the only people that heard that distress signal. That ship is waiting for us!\"\n\nWilliam kneels down and picks up the soldier's assault rifle, stands back up, and tosses his shotgun to Amber.\n\n\"Grab your toothbrushes...we're going to Seattle!\"", "action_results": [{"action": "The Road to Seattle...", "result": "The 3 of you decide it is best to investigate this dropship. Maybe it's there, maybe it isn't, but you're accomplishing nothing by staying in Pittsburgh.\n\nThe 3 of you hop into your vehicle with all of the provisions and start the journey westward.\n\nWhat lies ahead? Where is safe? Can you really make it? Find out soon!", "action_results": []}]}, {"action": "Sneak onto the last truck", "result": "\"Okay,\" replies Will, \"Let's go for it!\"\n\nThe 3 of you manage to sneak aboard the last truck, which is filled with crates. You open them and discover they are filled with food!\n\n\"Fuck yeah!\" you say.\n\n\"Okay,\" says Will, \"This is good. We just need to stay hidden back here and hope wherever we're going will get us off this rock.\"\n\n\"Right on,\" replies Amber, \"Orion's gonna want to evacuate, too.\"\n\nThe convoy drives on and on for hours before finally stopping. The truck you are in turns off.\n\n\"Let's go!\" whispers Will, \"They're gonna come back here!\"\n\nThe 3 of you jump out and sneak underneath the truck. Looking around from under the truck, you can see that it is dawn and you are at some sort of military base.\n\n\"Holy shit,\" says Will, pointing towards a dropship!\n\n\"Okay, okay, uhhh,\" you start, \"Okay, we need to get over there, right?\"\n\n\"Yes, of course. We just need to wait until we don't hear any more footsteps.\"\n\nAfter several minutes of Orion soldiers unpacking the trucks, you don't hear any more footsteps.\n\nSuddenly, the trucks start up again and begin to drive away. The 3 of you are left lying on the pavement.\n\n\"Shit! Now!\" says Will.\n\nThe 3 of you quickly get up and run for the dropship. You manage to get there unscathed and unseen.\n\nAboard is only the pilot and co-pilot.\n\nYou and Will draw your guns on them, and they quickly put their hands up.\n\n\"You fly us the fuck out of here or so help me I will feed you this fucking clip,\" says Will. Amber smiles at this. What a badass!\n\nTo your surprise, the pilots are willing to help you. They start the countdown procedures.\n\nSuddenly, hearing the engines starting, a large team of Orion soldiers run for the dropship. Realizing something is wrong, they open fire on the ship.\n\nAs bullets ricochet off of the bulletproof windshield, you and Will yell at the pilots to hurry up.\n\nSome of the soldiers blast open the door to get in. A firefight ensues, and you and Will are able to fend off the soldiers and re-close the door.\n\nFinally, the dropship takes off, en route to the Frontier, a new world...", "action_results": []}]}]}, {"action": "\"Yeah, fuck you! We're family!\"", "result": "The private gives you a tired, angry look. Then he gets on his radio.\n\n\"Colonel, I've got a situation here at the Pittsburgh unit. Civilian resistance, over.\"\n\nThe other side answers, \"Eliminate all resistance. There's no time for that shit.\"\n\n\"Roger that.\" The soldier doesn't hesitate to raise his rifle and mow the 3 of you down...", "action_results": []}]}, null]}]}, {"action": "Stop another vehicle and ask for a ride", "result": "A car approaches your Humvee. You flag the driver down, but he doesn't seem to want to stop. He probably thinks you're a damn zombie. Even when you raise your rifle, the driver speeds up. He has you lined up, and only the concrete barrier and fenced edge of the bridge is behind you.\n\nTo avoid the oncoming car, you have no choice but to jump onto the fence and climb up as much as you can. The car smashes a hole right through the barrier and fence before diving into the Allegheny River below.\n\nThe impact knocks you off of the fence and you fall into the river as well. Hitting the water knocks you unconscious.\n\nWhen you wake up, you're beached somewhere on the north bank of the Ohio River. It is daylight, probably Saturday morning.", "action_results": [{"action": "The Room...", "result": "You stagger onto land, completely unaware of where you ended up. You decide to try to find a road or any means of having a fair shot.\n\nAfter a long walk, you finally discover what appears to be an abandoned fire house for a nearby small town. Then you hear rapid footsteps approaching you from behind. You turn and see a German Shepherd, all alone! He looks up at you with enthusiasm. It's probably been hours since he's eaten or seen anybody.\n\nYou decide to take a look inside the fire house and the dog follows you. The upstairs is completely stocked with survival gear! Food, water, medicine, clothing, everything you need to live for years!\n\nBut no weapons...save for a revolver with 2 shots - the other 4 have already been shot. You unfortunately lost all of your gear in the river.\n\nYou wonder why, then it is clear - the bodies of 4 fire fighters who opted out...\n\n\"Oh God,\" you mutter. The dog whimpers at you. \"Okay, I know you're hungry. So am I.\"\n\nFor what seems like an eternity, you and the dog survive together on the rations stocked by the fire fighters.\n\nYou are totally isolated from civilization here - you haven't seen a zombie since the night you fell in the river.\n\nLoneliness and boredom are the real enemies here. Without that dog, you would be lost. You would probably just opt out as well. The dog becomes your best friend and true companion, comforting you when you can't help but think of all of the people you lost.\n\nSuddenly, one day, a band of thugs on motorcycles comes by. They are ruthless-looking, armed with heavy weapons and wearing spikes and hockey masks. It's a death squad...\n\nThey are whooping and hollering, taking pot shots at your domicile. Shit, they must know you're in there!\n\nJust then, a huge horde of zombies comes rushing out of the nearby forest and attacks the thugs. They exchange fire for as long as they can, mowing down the horde, but most of them are eventually devoured. Some of them get inside the fire house and make their way up to the second floor where you and the dog are.\n\nYou decide it is best to save the 2 shots. You use the fire ax to fight off the thugs, but it doesn't prevent the zombies from pouring into the building as well.\n\nYou know what you have to do. You barricade the upstairs door as best you can, grab the revolver, and hold the dog close to you, crying.\n\nThe zombies claw at the door relentlessly. Just as you expected, they break through and storm your domicile.\n\nYou shoot the dog in the head, then you put the barrel in your mouth and pull the trigger...", "action_results": []}]}]}]}]}]}, {"action": "You need to get out of the garage - run them down with your car!", "result": "You slam the gas pedal to the floor and ram into the crowd of crazies. Your piece of shit car is immediately totaled and you get slammed into the steering wheel, breaking many of your ribs (there's no airbag).\n\nThere is blood all over the windshield from the crazies you hit. It takes all of your strength to climb into the back seat to try to get out of one of the rear doors.\n\nUnfortunately, the zombies are able to smash through the windshield. They crawl in and pull you out. On the hood of your car, you are devoured by these fucking crazy zombies...", "action_results": []}]}, {"action": "Continue to William's on foot - you need to get safe before worrying about transportation", "result": "The parking garage is overrun by zombies, you think to yourself, what the fuck is going on?\n\nYou begin to run for William's place on the north side of town, picking off zombies here and there with your rifle. Eventually, you run out of ammo, but you make it to an auto shop. The windows are shattered and you see bloody handprints all over the walls, but there is a tow truck outside.\n\nThe keys would be inside the shop, you think, but God knows what else is in there.", "action_results": [{"action": "Go inside and find the keys - you need that truck", "result": "You decide to investigate the auto shop in hopes of getting those truck keys.\n\nAs you walk in, it's very quiet. There's definitely signs of a struggle - chairs in the waiting room flipped over, shattered windows and lights.\n\nYou find the main office and on the floor, face down, is a dead mechanic in is blue coveralls. Poor bastard had to work late on a Friday, only to die in this chaos, you think.\n\nOn his belt is a keychain full of keys - Jackpot!\n\nYou reach for it, but as you remove it from his belt, the mechanic rolls over, revealing half of his face bitten off.\n\n\"Shit!\" you shout as he growls and bites into your arm. You manage to smash his head in with your boot and run outside with the keys.\n\nYou get into the tow truck, start her up, and finally drive it to William's.\n\nHopefully, Amber can help you with your wound.\n\nWhen you get to the Highland Park Bridge, which takes you north into Fox Chapel where Will lives, the traffic is completely backed up with everyone trying to get out of the city.", "action_results": [{"action": "Wait it out - the cars will get moving again eventually", "result": "But they never do. You sit there in the tow truck for a long time, waiting to cross the bridge, but the cars never get moving. The fatigue and fever from the bite is overwhelming.\n\nThen you hear what sounds like jets. You look to the east to see two Orion gunships. They launch several rockets at the bridge.\n\nHoly shit, they're trying to sever all transit arteries in and out of the city!\n\nBefore passing out and dying from the fever, the last thing you see are the fiery explosions that engulf the bridge before the bridge and the backed up cars all fall into the Allegheny River...\n\nWhen you come back, you're not yourself anymore...", "action_results": []}, {"action": "Get out of the tow truck and cross the bridge on foot", "result": "You decide there's too much traffic and your bite wound is getting worse. Also, you had been walking for a while before you found the auto shop, so it's getting pretty late.\n\nYou stagger out of the tow truck and begin walking across the bridge. You feel fatigue overcoming your entire body. It becomes difficult to even lift your legs.\n\nThen you hear what sounds like jets. You look to the east to see two Orion gunships. They launch several rockets at the bridge.\n\nHoly shit, they're trying to sever all transit arteries in and out of the city!\n\nThe last thing you see are the fiery explosions that engulf the bridge before the bridge, the backed up cars, and you all fall into the Allegheny River...", "action_results": []}]}, {"action": "Continue on foot - it's not worth the risk", "result": "You leave the auto shop behind and continue on foot. It's getting very late. There's a full moon in the sky.\n\nWhen you get to the Highland Park Bridge, which takes you to Fox Chapel where Will lives, it has been destroyed! Orion has severed all transit arteries in and out of the city!\n\nYou have no choice but to swim across the Allegheny River...\n\nFortunately, you finally make it to William's house, but you are exhausted from the travel. The door is unlocked and you go in.\n\n\"William!\" you shout, \"WILLIAM!\" You frantically search every room in the house. \"Amber!\"\n\nYou notice the closets and pantry have been ransacked. There's a note on the kitchen counter:\n\n\"Joe, I tried to find you at your apartment before it came down. We left for the airport. We couldn't wait any longer. If you can read this, get to the airport as fast as you can! There's a dropship that will take you and Amber to safety. Don't worry, I'll be safe with the Alliance military. Take the bag of provisions with you, just in case. Best of luck, brother. Love, Will.\"\n\nShit, you're too late. They've left the city without you!\n\nYou look through the bag: a 9mm pistol with plenty of ammo, food, bottled water, and a first-aid kit.\n\nYou run over to the key ring by the door to the garage - thank God! They left you Amber's SUV! They must have taken Will's jeep. You couldn't ask for a better brother.", "action_results": [{"action": "No question - take the SUV to the airport!", "result": "You take Amber's SUV and the provisions to the airport. The security checkpoint to exit the eco-dome has been overrun by zombies. You see them feeding on the bodies of the Orion guards.\n\nWhen you get to the airport, it is unnaturally quiet. Thousands of cars, bumper to bumper, sit abandoned on the street. You head for the runways to where the dropship should be.\n\nIt's gone! It already left the city!\n\nThe runways are completely deserted when you were expecting there to be huge crowds of desperate people trying to get on the dropship. Where is it going? you wonder, where's safe?\n\nThe runway lights are all out - it's the pitch black middle of the night. Just then, you hear the pump of a shotgun directly behind you.\n\n\"Say something, or I'll blow your fucking brains out.\"\n\nYou turn around, and see William aiming the shotgun at you!\n\n\"Shit! Joe!\" He lowers the shotgun and gives you a great big bro hug. Amber is there too. \"Thank God, you made it!\" she says, \"But we're too late. The airport's been overrun with zombies. The dropship left without us. We made it out of the terminal, but the zombies had a feeding frenzy. Oh God, the crowds of people were trapped trying to get on the dropship...\"\n\nYou turn away, trying not to vomit. \"Where is it going?\" you ask.\n\nWill explains, \"The entire planet is shuttling itself into space and living aboard the ships until The Frontier can be colonized. The Frontier is an inhabitable planet on the edge of the galaxy...humanity's starting a new life there...\"\n\nYou can't believe it! All those late night conversations you used to have with your friends while stoned out of your mind about space colonization - you never thought it would actually come to fruition!\n\n\"What about the military?\" you ask, \"I thought you were going with them, Will?\"\n\n\"The Alliance military's going to the Frontier as well, but there was no way in hell I was going to leave you and Amber behind.\" He puts his arm around Amber and holds her close, \"I know this situation's far from ideal, but we're all together now. We have plenty of provisions. We just need to find a place to-\"\n\nJust then, the 3 of you hear the crackle of a radio. You turn around and in the distance are 3 or 4 zombies feeding on a corpse. The radio is a walkie-talkie on the belt of the corpse. As you approach it, you and William dispatch the zombies with your weapons.\n\nThe corpse is an Orion soldier! The radio crackles again. On the other end is the voice of a distressed Orion soldier and lots of gunfire:\n\n\"Mayday, mayday. Calling all districts. This is Delta 4-6, Seattle district. We are overrun by the contaminants, I repeat - we are overrun by the contaminants. Dropship liftoff has been terminated. The pilot and co-pilot are both deceased. I am the only one left. Please respond, over.\"\n\n\"Orion's evacuating, too!\" you say.\n\nThe transmission continues:\n\n\"I repeat - mayday, mayday. Calling all districts. This is Delta 4-6, are there any units still remaining on the surface? I repeat - are there any-AAAAAHHHHHHHHHHH!!!-\"\n\nYou hear the snarls of zombies just before the transmission cuts off, then silence...\n\nAfter a short while, William finally has an idea, \"That dropship...in Seattle...what if we could get to it? Earth is completely abandoned - we're probably the only people that heard that distress signal. That ship is waiting for us!\"\n\nWilliam kneels down and picks up the soldier's assault rifle, stands back up, and tosses his shotgun to Amber.\n\n\"Grab your toothbrushes...we're going to Seattle!\"", "action_results": [null]}]}]}]}]}, {"action": "Go to your brother William's", "result": "\"Let's go to my brother's place,\" you say, \"He should be able to help us.\"\n\nAs the 3 of you head there, you hope either he or his wife Amber is home. It's a Friday night, so Amber should be home from the hospital...unless she was called in to help all of the wounded soldiers.\n\nThe 3 of you head into the parking garage adjacent to your apartment building, where you and Robbie have your shitty cars and Turk has his big-ass truck.\n\nJust then, as you are approaching the stairs to the next level, the apartment building collapses into the street! Part of it also falls onto the parking garage.\n\n\"Shit! Get back!\" you yell, but you're too late. The rubble crushes Robbie and Turk. To make matters worse, you turn around to see a massive crowd (30-40) of fucked up looking people running toward you. They are growling and snarling and flailing their arms violently as they storm into the parking garage.", "action_results": [{"action": "Thank God, other people! Ask them what they know", "result": "\"Hey! Where did you all come from?\" They continue running at you, clearly not listening.\n\n\"Do you guys know of a safe place we can go to?\"\n\nJust then, 2 of these crazy bastards grab you and force you to the ground. The rest of the crowd swarm you as well and begin to eat you alive!\n\n\"What the fuck!?!? Zombies?!?! Are you fucking serious!?!?\" is all you can say before they rip open your belly and pull out your intestines...", "action_results": []}, {"action": "They're obviously not right in the head - mow 'em down!", "result": "You open fire on the crowd with your assault rifle. Only the ones you get in the head seem to go down.\n\nFucking zombies, you realize.\n\nYou continue backing up into the garage while shooting. With only one clip, they just keep coming! Eventually, you are forced into a corner next to a black van.\n\nThe zombies just keep coming and your are down to your last round. \"I'm sorry, William,\" you say to yourself as you put the rifle barrel to your head.\n\nJust before you're about to pull the trigger, the door of the black van slides open. Inside, there's a scruffy looking dude with a thick gray beard, a red bandanna tied on his head, and a denim vest.\n\n\"Get the fuck in here!\" he yells to you, motioning with his hand.", "action_results": [{"action": "Obvious choice - get in the van!", "result": "You run and dive into the van, and the scruffy dude helps pull you in.\n\n\"Get us out of here, Brett!\" he yells as he slides the door shut.\n\nThe driver reverses and runs over several of the zombies. Then he shifts into drive and punches the gas.\n\nThe exit is blocked by zombies, but he runs them down with the van and swerves into the street.\n\nIn the van with you are the scruffy guy, the driver, and 2 slutty looking bitches in short skirts and fishnets.\n\nThe scruffy guy looks at you, \"So what's your story, friend?\"\n\n\"I need to get to my brother's place,\" you say.\n\n\"Where's that?\"\n\n\"Fox Chapel.\"\n\n\"The north end of town? Fuck that! That's too far! Plus, that's close to the camp.\"\n\n\"What camp? What the hell's going on?\"\n\n\"You saw the zombies, right? They came from the concentration camp. Orion's little fucked up experiment. They've been capturing people and exterminating them like the fucking Nazis did. But this time, they brought them back to life as flesh-eating maniacs.\"\n\nYou shake your head in disbelief, \"Jesus...so this is why we're at war with Orion now...how do you know all of this?\"\n\nThe scruffy guy looks down at his feet, \"We were in the Philly camp. We just escaped yesterday. We're the only survivors.\"\n\nThe driver, a big guy with a badass handlebar mustache, turns around and says, \"The war started there long before it came here. We've been heading west, trying to get to our Pittsburgh charter.\"\n\n\"That's Brett,\" says the scruffy guy, \"You can call me Jimbo. We're brothers of the Renegades.\"\n\n\"Biker gang?\" you ask, surprised.\n\n\"We prefer the term, motorcycle club,\" replies Jimbo.\n\n\"Well who are they?\" you refer to the 2 sluts in the back.\n\n\"Our groupies. The Philly clubhouse got overrun by the fucking zombies. These 2 were the only ones who made it out.\"\n\n\"Fucking Roy,\" says Brett, shaking his head, \"they fucking pulled his arms off...\"\n\nOne of the groupies starts caressing your arms, \"You want some apocalyptic companionship?\"\n\n\"So what were you guys doing in the parking garage?\" you ask.\n\n\"What do you think?\" asks Jimbo as he slaps the other groupie on the ass.\n\n\"Jesus, man! Well, where the hell are we going?\"\n\n\"To the clubhouse. With any luck, our brothers will be okay. Don't worry, we're not bad people. We just engage in organized crime once in a while.\"\n\nThe van pulls into the driveway of what looks like an abandoned office building outside of the city. Brett puts the van keys up in the sun visor.\n\n\"Come inside,\" says Jimbo, \"you want a beer?\"\n\n\"Thanks, really, for everything. But what I really want is to find my brother,\" you reply, \"Can I take one of the bikes?\"\n\n\"What the fuck did you just say, boy?\" Brett angrily asks as he briskly walks toward you.", "action_results": [{"action": "\"Can I take one of the bikes? I just need to get across town. Please.\"", "result": "Brett grits his teeth at you, then pulls out his revolver.\n\n\"Woah, woah!\" you try to reason with him.\n\n\"NO ONE TAKES OUR BIKES, YOU MOTHERFUCKER!\" he yells before capping you in the stomach. You collapse onto the street.\n\nJimbo spits on you, then they all go into the clubhouse and lock the door, leaving you to die in the street...\n\nYou pass out. When you come to, you hear growling and snarling and gunshots coming from the clubhouse. A crowd of zombies is overrunning the clubhouse!\n\nThen you hear the roar of some bikes starting up. Some of the bikers are able to get away on their bikes. One of them takes too long to get his started. He does manage to get it started, but is then pulled off by the zombies. They tear into his belly and also chew his face off.\n\nYou can barely stand up. Luckily, the zombies haven't spotted you yet.\n\nYou could try to get to the van. Remember, Brett left the keys in the sun visor!\n\nOr you could try for the bike that's running. It's close to the zombies, but they're busy eating the biker right now.", "action_results": [{"action": "Go for the van", "result": "You stagger towards the van and to your luck, it's unlocked!\n\nAnd sure enough, the keys are still in the visor! You start her up and start driving. Hopefully Amber can get the bullet out of your gut and clean you up, but you are not sure where you are or where William's place is from the clubhouse.\n\nSuddenly, you hear a high-pitched snarl behind you. You look in the back of the van and see one of the groupies, naked, with blood all over her. On the floor is Jimbo, or what's left of him. He's naked, too. Guess he was too desperate for that apocalyptic companionship.\n\nThe zombie groupie bites you in the face...", "action_results": []}, {"action": "Go for the bike", "result": "You stagger your way over to the bike and hop on. The nearby zombies are still devouring the original rider.\n\nYou barely manage to escape the area as crowds of zombies swipe at you.\n\nSince you are not sure where you are, getting to Will's place is really no longer an option. You decide to take your chances out on the open road.\n\nFor the better part of a year, you are a highwayman, scavenging whatever you can from abandoned cars and trucks. You've managed to head west all the way to Nevada.\n\nThe roads are desolate. Bandits are the real threat. Cannibals, too.\n\nOne day, you spot a group of such bandits in their trucks and jeeps and motorcycles in pursuit of a lone car. The car suddenly swerves out of control and flips over and crashes.\n\nYou decide to lure the bandits away on your motorcycle and an intense chase ensues. Eventually, while exchanging fire and driving like some Twisted Metal in real-life, you dispatch all of the bastards.\n\nReturning to the flipped car, you meet a beautiful young blonde named Sarah. She thanks you for saving her and informs you of a sailboat her dad owns in San Francisco.\n\n\"It could still be there,\" she says. You decide to make the journey with her. You fall in love, discover the sailboat, and sail off to safety with a new leaf turned...", "action_results": []}]}, {"action": "\"Nothing, never mind. Let's go inside.\"", "result": "\"That's what I thought,\" Brett says with a cold stare. You all go into the club house and start drinking. It is one hell of a party, until the zombies show up!\n\n\"Shit!\" yells Jimbo, \"I'm too fucking drunk for this!\"\n\n\"Me too!\" says Brett, \"I shouldn't have taken that mescaline either!\"\n\nBut with your help, you and the bikers are able to fend off the nasty horde with awesome firepower. Once the house is safe, the party continues.\n\n\"We could use someone like you,\" says Jimbo, \"We're thinking of going out and looting what we can tomorrow. We need the extra hand.\"\n\n\"No problem,\" you respond.\n\n\"Well, consider yourself an honorary member of the Renegades!\"\n\nAnd so begins a brotherhood bonded by steel...you and the biker gang become the most ruthless group of bandits east of the Mississippi, raping and pillaging every town and farm you come across...", "action_results": []}]}, {"action": "You don't trust this skid row bum - opt out", "result": "\"Fuck this world!\" you angrily yell as you shoot yourself in the head to avoid a slow and gruesome death...", "action_results": []}]}, {"action": "Run like hell up the stairs and hope your car's alright", "result": "You manage to make it up the stairs alright.\n\nThe second level appears to be deserted. You run to your car and find it perfectly fine. The collapse had just missed it. You can hear the growls of the crazies and gunfire of the war echoing throughout the garage.\n\nYou hop into your car and drive to the exit ramp. It is blocked by a crowd of those fucked up cannibals.", "action_results": [null, null]}, {"action": "Grab Turk's truck keys, then run like hell up the stairs", "result": "You run to Turk's crushed body and manage to grab the keys to his truck, but not before one of the crazies bites you in the arm.\n\n\"Fucking zombies!\" you shriek as you punch the one that bit you in the face. You run for the stairs and make it up to Turk's truck. Luckily, it is alright - the rubble avoided it.\n\nShe's a beauty - 44 inch off-road tires, grill guard, roll cage, spotlights, 6.0 liter V8, all-wheel drive. Turk pretty much put his life savings into this thing.\n\nWell, it's yours now, you think as you start up the roaring engine. You drive down the exit ramp, but it's blocked by a crowd of zombies.", "action_results": [{"action": "Head for the top level - the truck won't make it through", "result": "The truck can't run over this many people, you think, as you reverse back up the ramp.\n\nYou drive up to the top level of the garage and stop the truck. You feel a sudden fatigue, probably from the bite, as you open the door and stagger out. You notice a helicopter flying low over the nearby rooftops.\n\nYou can hear the zombies coming up the ramp - they'll be on the top level any second now. You've got the get off the garage!\n\nThere's a building next to the garage, about the same height. You think you can make the jump.\n\nThen again, if you could signal that helicopter, you'd be rescued, but it might take a while to get over to you, if it even spots you at all.", "action_results": [{"action": "Flash the truck's spotlights to attract the helicopter", "result": "You start flashing the truck's spotlights. They are bright as hell, and sure enough, the helicopter sees them! It turns and starts to fly towards you!\n\nJust as it lands, the zombies are swarming the roof. You quickly jump in, and it takes off again.\n\n\"Thanks!\" you say to the people inside, \"who are you guys?\"\n\nInside is a middle-aged black dude in a plaid shirt with a huge beard, a middle-aged woman in a red coat and red skirt, and a bald dude flying the helicopter.\n\nThe black dude responds, \"We're from Channel 6 News. Everything went to shit so fast. I had to get errbody outta da studio lickety split! Nah mean, brotha?\"\n\n\"Yeah, I barely escaped, too. Where are we headed?\"\n\n\"To da airport. They gonna evacuate us, baby. We gettin' off dis here rock an' goin' somewhere out in space.\"\n\n\"What?!?!\" You can't believe it! All those late night conversations you used to have with your friends while stoned out of your mind about space colonization - you never thought it would actually come to fruition!\n\n\"I'm Pam van Winkle, host of the morning show,\" says the woman, extending her hand.\n\n\"Bitch, what I say bout talking?\" says the black dude.\n\n\"I'm sorry, I wasn't thinking,\" Pam lowers her head in shame.\n\n\"I'm Ricky, the traffic chopper pilot,\" says the pilot.\n\n\"Dat's right. Dat there's Ricky. He's da man dat saved the day!\" The black dude laughs heartily.\n\n\"Well, you are you?\" you ask the black dude.\n\n\"I'm da cameraman.\"\n\nYou keep your bite on your arm hidden. You don't know if you can trust these people or not.", "action_results": [{"action": "Show them the bite - they can help you!", "result": "\"Uh, I guess it would be a bad time to bring this up...\" You show them your bite.\n\n\"Aw hell nah!\" says the black dude. He then proceeds to Sparta kick you out of the helicopter. You fall to your death with regret...", "action_results": []}, {"action": "Keep it hidden - wait until you get to the airport", "result": "You decide to wait for proper medical care.\n\nThe helicopter makes it to the airport and lands on a helipad right next to a giant ship with its engines running. It's about to take off...\n\n\"Let's go, baby!\" says the black dude. You and him and the pilot and the anchorwoman quickly jump out and run to the dropship.\n\n\"Wait! Wait! We're with da news crew!\"\n\nThe Alliance soldier guarding the passage onto the dropship sees that the 4 of you came from a news chopper. Without checking IDs, he waves you all through.\n\nYou enter a green military tent that is set up adjacent to the elevator that takes people up to the dropship hatch. Inside this tent are medical personnel.\n\nYou show them your bite, and they immediately inject you with a needle of amber fluid - the cure!\n\nAfter several questions and pat-downs, the 4 of you are allowed onto the dropship.\n\nAbout 30 minutes later, the ship launches into space, en route to a new world, a new beginning...", "action_results": []}]}, {"action": "The helicopter won't get to you in time - jump to the other roof", "result": "You decide to take the fast way off the garage. The helicopter is just too damn far, you think.\n\nYou stagger away from the truck and line yourself up to get a good running jump. You try to start running, but the fatigue from the bite overwhelms you. You leap from the edge of the floor with all of your strength, but you did not have enough momentum.\n\nYou fall to your death in the alley below...", "action_results": []}]}, {"action": "Of course it will! Run them down!", "result": "You slam on the gas and the big-ass truck effortlessly smashes through the zombies. You drive out to the street and head for William's place in Fox Chapel on the north end of town, using the windshield wipers to get the blood off.\n\nHopefully Amber can help you with your wound.\n\nLuckily, you were quick enough to beat the traffic and got across the Highland Park Bridge, which wasn't backed up.\n\nYou make it to William's...", "action_results": [{"action": "Go inside the house", "result": "Upon walking in, you see William and Amber in the kitchen.\n\n\"Thank God - Joe!\" says Will, \"I tried to find you at your apartment before it came down. We need to get you out of the city. I've already packed you 2 plenty of food, guns, ammo, clothing - that sort of thing.\"\n\n\"What's going on? Why is Orion killing everybody?\"\n\n\"It's all part of their 'Final Solution,' just like the Nazis had over 90 years ago. They were throwing nearly everyone in concentration camps, forcing them to work, performing horrendous experiments on them. But now, I guess they're exterminating everyone in response to the outbreak.\"\n\n\"The outbreak? You mean the zombies?\"\n\n\"Yeah, the, er, zombies. They developed this toxin that can reanimate dead tissue. When the bodies started piling up, the Orion personnel decided to use the toxin on them. Thing is, the dead people that came back weren't themselves at all...my unit saw...they overran the entire camp...Orion couldn't contain it...the dead, they...\"\n\nWill puts his hand to his mouth, clears his throat, and swallows, \"they fed on people - my men, Orion's men, civilians - pretty much anyone they could catch.\"\n\n\"Shit, I saw it, too. It's awful, what's happening.\"\n\nYou keep your bite covered up and try not to attract attention to it.\n\nWilliam goes into the kitchen and comes back with the provisions he packed.\n\n\"Look, you and Amber need to get to the dropship at the airport. Obviously, it's outside of the dome, so I'll have to get you guys past the entry/exit checkpoint. Once you're at the airport, just get on the dropship. Don't worry about me - I'm being evacuated, also, with the rest of the Alliance military. We're going to the same place as you and all of the civilians, so I'll see you there.\"\n\nYou look at Will like he's fucking crazy. \"Dropship? Evacuation? Where are we going?\"\n\n\"Damn it, I thought you liked keeping up on the news! The entire planet is shuttling itself into space and living aboard the ships until The Frontier can be colonized. The Frontier is an inhabitable planet on the edge of the galaxy...humanity's starting a new life there...\"\n\nYou can't believe it! All those late night conversations you used to have with your friends while stoned out of your mind about space colonization - you never thought it would actually come to fruition!\n\n\"We need to leave now,\" Will continues, \"or else we'll be stuck here.\"", "action_results": [{"action": "Keep your bite a secret", "result": "So the 3 of you pack up all of the provisions into Will's jeep, then head for the airport.\n\nDuring the drive, you feel more and more fatigued. The fever from the bite becomes so overwhelming, you eventually pass out and die.\n\n\"Joe? Joe!?!?\" Amber tries to shake you awake. \"Joe, we're here. We need to go, now!\"\n\nYou come back to life, but you're not yourself anymore as you bite into Amber's delicious throat...", "action_results": []}, {"action": "Show them your bite", "result": "\"Uh, Will,\" you pull back your sleeve, revealing the nasty-ass bite on your forearm. It's slowly spreading like an infection. The skin around it is turning purple!\n\n\"I'm sorry...\"\n\nWilliam immediately turns around, putting his hands to his temples. \"Oh God, oh shit, no, no, no...\"\n\nAmber breaks down in tears as she holds your hands.\n\nWilliam walks into the garage and comes back with an ax. \"I'm so sorry, brother. There's nothing else we can do.\"\n\n\"No, please, no!\" you plead with your brother, \"You can't - no don't do this, damn it!\"\n\n\"Joe, the fever will kill you and you'll come back as one of them...I'm sorry.\"", "action_results": [{"action": "*Sigh* \"Fine, get it over with...\"", "result": "Amber wisely lets go of your hands as she lets out a loud sob. She moves back and buries her face into her hands.\n\nYou pull back the rest of your sleeve and head for the kitchen. Will follows behind you with the ax.\n\nAs you sit at the table with your arm resting on the table, Will looks at you and nods. You sigh and nod back.\n\nBoth of you grit your teeth and Will raises the ax. He slams it down into your arm, just below the elbow and above the bite.\n\nYou can't help but scream through your teeth and fall out of the chair, blood spraying all over the table and floor...\n\nYou wake up in Will's jeep. Amber has cauterized your stump and bandaged it up. You're on your way to the airport!\n\nJust as you expected, the traffic is horrendous going into the airport. The 3 of you get out of the jeep, grab the provisions, and head for the terminal on foot. The crowds of people have jammed themselves in the terminal, desperate to get on the dropship.\n\n\"Shit! There's no way they're going to get you on the ship with all these people,\" says Will, \"I might be able to sneak you guys on the military ship with me. We're boarding on the runway right now.\"", "action_results": [null, null]}, {"action": "\"I said no! You're fucking insane!\"", "result": "Will stares at you a moment, then lowers his head and sighs. He gets up and heads into the kitchen.\n\nAmber is still in tears holding your hands.\n\nWill comes back into the room, but instead of the ax, he has a fucking pistol!\n\n\"I'm sorry, brother. You leave me no choice...\"\n\nYou slowly turn your head and look up at him in disbelief. Your own brother is pointing a gun at your head.\n\nThen all you see is a sudden flash before blackness...", "action_results": []}]}]}]}]}]}, {"action": "Go up to Turk's apartment", "result": "You decide to go up and check out Turk's apartment. With any luck, it'll still be intact and you can turn on the news.\n\nWhen you get up there, it's in perfect condition!\n\n\"Thank God,\" Turk says as he quickly walks in and goes to the TV.\n\nThen you feel a rumble under your feet...the building finally collapses, unfortunately with you in it...", "action_results": []}]}]}]}]}]}, {"action": "Go to Robbie's", "result": "Orion's full of shit, anyway. You drive over to Robbie's apartment, which is just 10 minutes away. You walk in and there they all are: Robbie, pale and scrawny little bastard with a buzz cut; Adrian, the big friendly (and black) giant; Leslie, Robbie's hot brunette hipster girlfriend he doesn't deserve; and Turk and his fairly cute redhead girlfriend, Tiffany. Turk's a little heavy set and wears coke bottle glasses, but has the coolest fro for a white dude you've ever seen. He's the one who pulls out a bag of pure chronic. Robbie opens the fridge, revealing 3 cases of beer and ingredients for Jagerbombs. It's going to be a good night.\n\nAnd it is. You and your friends get so stoned, you start talking about the possibility of leaving Earth and finding a new home as a way to escape this living hell. Of course, it's far-fetched and pretty much impossible, but it's interesting especially in your current state of mind.\n\nThen the drinking games start. You and the three other dudes play beer pong. In between shots, Robbie and Turk are making out with their girls. You and Adrian are singing along very poorly to Robbie's stereo, which is pretty damn loud for just a party of 6.\n\nSure enough, at around 3am, while you're all still partying hard, an angry neighbor pounds on the door. You are the only one who hears it...", "action_results": [{"action": "Answer the door yourself", "result": "\"Hold on,\" you say as you walk over to the door. You look through the peephole and see an innocent looking woman, probably in her mid 40s, wearing a bathrobe.\n\nYou open the door and smile. She smiles back and says, \"Hello, I live right here across the hall and cannot get to sleep with that music blasting. Do you think you could turn it down? I have to teach swimming lessons early in the morning.\"\n\nShe seems like a very decent person and asked you kindly enough.\n\nThen again, you're having a great night. For all you know, the world may come to an end tomorrow.", "action_results": [{"action": "Tell her you are very sorry and comply with her request", "result": "She smiles again and goes back into her place. You walk over and turn the music down.\n\n\"What the fuck, bro?\" says Adrian.\n\n\"The neighbors are pissed, dude,\" you respond as you take another bong rip.\n\nThe night continues for a couple more hours before everyone passes out, except for you and Leslie. You and her continue to have deep discussions and share many laughs, while sipping beers and listening to music until 6am.\n\nAll of a sudden, she gets up and comes over and sits on the couch you're laying on and straddles you. Shocked, you look over and see Robbie totally trashed and out cold on the other couch.\n\n\"Fuck him,\" Leslie says, and takes off your shirt, \"I need someone who can actually take care of me.\"\n\nYou end up banging until dawn before you both pass out.\n\nYou wake up and it's 2:30pm the next day. You had a wild night, no doubt. Luckily, you woke up before Robbie did, since you and Leslie are still naked. You grab your clothes and your shame and head out.\n\nThere's no point in trying to find a job today, you think to yourself as you pull into a diner.\n\nYou order some eggs for the throbbing hangover. You feel somewhat guilty about you and Leslie but try not to think of it. But she was damn good.\n\nSuddenly, you spit out your coffee upon seeing a military convoy and countless troops roll through the street. It's Orion - martial law is in effect.\n\nHope has come to Pittsburgh!", "action_results": [{"action": "Two Years Later...", "result": "April 5, 2037 - 9:35pm - Your new fung shway Orion living quarters\n\nFor the past 2 years, you have been living in a beautiful apartment complex built by Orion. You got your old job back at the steel mill, which has been rebuilt - it is now much cleaner, safer, and you actually enjoy working there.\n\nThe air in the city is also much cleaner and the temperature stays at a constant 75 degrees, no matter what season. That's because Orion has built an eco-dome over Pittsburgh, which filters out pollutants and regulates the temperature. It's like living in a giant fucking Astrodome of plexiglass, so you still get the sunshine. And like Orion promised, poverty, crime, unemployment, and all the other shit from before has been pretty much abolished.\n\nThe present times are wonderful. Some would say Pittsburgh is like a utopia now. You guess the same could be said all over the world. Orion has gone completely global and they are now the world's government and military. We still have our own military, however, but Orion is obviously considered an ally.\n\nRobbie is now your roommate. His girlfriend Leslie comes over once in a while. Fortunately, Robbie still has not yet found out about what happened between you and Leslie 2 years ago. Only Turk knows.\n\nTonight is Friday and the usual gang is at your place: Robbie, Leslie, Adrian, Turk, and Tiffany.\n\nJust as you're about to light a bowl of chronic, the door is kicked in. In storms a squad of Orion soldiers. Without hesitation, they grab Adrian, Leslie, and Tiffany and storm back out with them. You, Robbie, and Turk are stunned and wonder why they didn't take you.\n\nYou feel you should act to save them, but with no weapons, it would be difficult. You knew you should have bought a gun when you had the chance!\n\nThen again, there are 3 of you. You might have enough manpower to take down 1 or 2 of the bastards with your bare hands.\n\n\"They took my fucking girl!\" yells Robbie.\n\n\"Mine, too, you dick!\" replies Turk. The heartbreak is too much for you to bear, for Turk at least. You hope to have Leslie for yourself, so you agree to attempt the rescue.", "action_results": [{"action": "Try to rescue your 3 friends", "result": "The 3 of you decide to act fast. With no weapons, you run out into the hall and spot the squad moving for the elevator. They board it, all but one of them who stays behind to secure the area.\n\n\"Hey, motherfucker!\" yells Robbie just before ducking behind a plant. The soldier snaps his head towards your direction and aims his rifle. You and Turk immediately hide just as Robbie did. The soldier slowly creeps towards you guys. Finally, he is so close, you can touch him. Robbie nods to you and Turk.\n\nYou and Turk are able to tackle the bastard and knock him unconscious. On his person is an assault rifle. That will definitely come in handy! Turk also grabs the dude's sidearm, a 9mm pistol. Then he proceeds to shoot the dude in the fucking head, killing him in his unconscious state.\n\n\"Damn, Turk! That's fucked up!\" you say.\n\n\"Don't want him sneaking up on us when he wakes up, right?\" Turk replies. Well, he has a point.\n\nJust then, there's a huge explosion behind your group. Your apartment has just been obliterated by a stray tank shell. The 3 of you are stunned, but okay. Good thing you weren't in there!\n\nYou and your friends quickly head down the stairs to try to intercept the elevator. You manage to get to the lobby before Orion does. The lobby is filled with rubble and shattered glass. Outside, a tank rolls by.\n\nWorld War III has just begun! Our military is rebelling against Orion, but why? Aren't we allies, you wonder.\n\nThe elevator opens... Turk claims he can take care of the troops that come out with just the pistol. He has roughly 14 shots. You have a full assault rifle clip, on the other hand.", "action_results": [null, {"action": "Turk doesn't pack enough heat, light 'em up with the rifle!", "result": "Inside the elevator, you see the bodies of Leslie, Adrian, and Tiffany. Those fucking Orion bastards executed them!\n\nUpon seeing Leslie's dead body, you go batshit crazy with the assault rifle and manage to get the jump on the Orion squad. They are all killed in a matter of seconds.\n\nThe 3 of you walk over to the elevator. Robbie and Turk both stock up on weapons and ammo from the dead soldiers.\n\nYou kneel down beside Leslie and mourn her death. Robbie sees this.\n\n\"What the fuck, man?!?! You son of a bitch! What nerve!\"\n\nYou turn around, confused. Robbie continues, \"You didn't think I'd find out? Turk's a terrible liar if you didn't know!\"\n\n\"Yeah, sorry, bro,\" says Turk.\n\nSuddenly, Robbie draws his pistol on you, \"I should kill you for fucking her!\"\n\nYou have no choice but to draw your rifle on him. Now it's a good old Mexican standoff. You both know you can't stay there forever. The building is crumbling rapidly.", "action_results": [{"action": "Take your shot - Robbie's a pussy", "result": "You don't hesitate to put down your best friend. These are desperate times, after all. He had fired also, but the bullet just grazed through your hair. Lucky!\n\n\"Holy fuck!\" shouts Turk.\n\n\"There was a fly on his nose,\" you retort, \"Whoops. Let's go.\"\n\nYou and Turk go outside and it's utter chaos. The Alliance is fighting Orion everywhere you look. Tank shells are exploding, buildings are collapsing, men are dying.\n\n\"Where are we gonna go, dude?\" asks Turk.\n\nYou realize your brother William might be able to help if you go to his place, but he's more than likely fighting Orion right now. Plus, his place is far, especially on foot.\n\nPerhaps the Alliance soldiers in front of your building would know where he is, but that means being right in the line of fire.\n\nAlternatively, you could go up to Turk's apartment - he lives in the same building as you and Robbie. Perhaps it is still intact and you can turn on the TV and find out everything that's going on, but the building's been receiving one hell of a shelling.", "action_results": [{"action": "Consult with nearby Alliance soldiers (2 ppl)", "result": "The 2 of you approach a nearby squadron of Alliance soldiers pinned down by Orion machine guns. The Captain in charge sees you as you crouch behind the sandbag next to him.\n\n\"What the fuck are you doing here? You guys are civvies!\"\n\n\"We have guns,\" you say, \"That should count for something. I was hoping you could tell me where Sergeant William Bradley is.\"\n\n\"Yeah, he went looking for his dumb-ass stoner brother.\"\n\n\"Fuck you, man! So he's in there?\" you ask as you point to your apartment building.\n\n\"Yeah, he took a squad through the side door in the alley. Said his brother is on the third floor. I ain't going in there, though. That shit's coming down any minute!\"\n\nSuddenly, a massive group of fucked up looking people come running towards you.\n\n\"GET THE FUCK BACK! GET OUT OF THE STREET!\" yells the Captain, but they don't seem to listen. Strangely, they're also growling and snarling.\n\nThen they attack Turk and start to bite into him! They rip him apart and even start tearing his guts out!\n\n\"Shit! They got out!\" says the Captain before he's devoured by these maniacal people. To make matters worse, your apartment building finally collapses and starts to fall right into the street. There's so many of these crazies, you can't get away. Most of them are busy eating Turk and the Captain, but enough of them get to you, and you share the same fate before getting crushed by rubble...", "action_results": []}, {"action": "Go to your brother William's (2 ppl)", "result": "\"Let's go to my brother's place,\" you say, \"He should be able to help us.\"\n\nAs the 2 of you head there, you hope either he or his wife Amber is home. It's a Friday night, so Amber should be home from the hospital...unless she was called in to help all of the wounded soldiers.\n\nThe 2 of you head into the parking garage adjacent to your apartment building, where you have your shitty car and Turk has his big-ass truck.\n\nJust then, as you are approaching the stairs to the next level, the apartment building collapses into the street! Part of it also falls onto the parking garage.\n\n\"Shit! Get back!\" you yell, but you're too late. The rubble crushes Turk. To make matters worse, you turn around to see a massive crowd (30-40) of fucked up looking people running toward you. They are growling and snarling and flailing their arms violently as they storm into the parking garage.", "action_results": [null, null, null, null]}, null]}, {"action": "Try to reason with Robbie", "result": "\"Look, man,\" you start to say, \"it was a long time ago. We were all pretty fucked up, mostly you.\"\n\n\"I don't give a shit,\" Robbie replies, \"that doesn't give you permission to heave sex with my girl.\"\n\n\"I understand that, but - \"\n\n\"Clearly you don't understand it! Otherwise, you wouldn't have done it!\"\n\nThe bullshit argument continues for a good 3-4 minutes. The building is still getting shelled by Orion's tanks.\n\n\"Look, we need to get the fuck out of here, guys!\" says Turk. He starts for the exit to the street when all of a sudden a huge crowd of fucked up looking people come swarming through the doors.\n\n\"No!\" starts Turk, \"It's not safe here, people! We need to get away from the fighting! Wait, hey - what are you - AAAAHHHHHHHHRRRGGGGHHHHH!!!\"\n\nThe swarm of people start biting into Turk! Then they fucking open up his belly and start pulling out his guts and eat them! There are others that start eating the soldiers outside, too!\n\n\"JESUS! FUCKING ZOMBIES!!!\" shrieks Robbie as he opens fire with his pistol.\n\nWhere the hell did they come from, you wonder, as they run at you and Robbie with awful-sounding growls and snarls.\n\nBefore you can put the rifle barrel to your head, the zombies give you the same fate as Turk.", "action_results": []}]}]}]}]}, {"action": "Tell her to fuck off - it's Friday night!", "result": "Her smile slowly fades as she says, \"Alright then...\" and goes back into her home. You now have an uneasy feeling as you go back over to the pong table.\n\nSure enough, the door is kicked down and a big shirtless dude with a shotgun barges in. He must be the woman's husband.\n\nThe woman comes back in and without saying a word, points to you.\n\nThe crazy dude aims at you and blows your brains out...", "action_results": []}]}, {"action": "Ignore it and take your shot in beer pong", "result": "You decide not to do anything about it. Hopefully they'll just go away.\n\nThe person continues knocking louder and louder. Then for a while, it stops. You sigh in relief, all the while still singing and playing beer pong. Everyone is either too drunk or stoned to hear or care about the door. Soon you forget there ever was knocking.\n\nThen suddenly, a few minutes later, a large shirtless dude kicks the door down and storms in with a shotgun. A woman in a bathrobe comes in behind him.\n\n\"MY WIFE KNOCKED SEVERAL TIMES, YOU MOTHERFUCKERS!\" the crazy dude says, \"TURN THE FUCKING MUSIC DOWN!\" He's aiming the shotgun at Robbie, whom he knows a little since they're neighbors.\n\nRobbie, the idiot that he is, tries to throw a liquor bottle at him and misses. The bottle strikes the woman right in the face. She screams and staggers out into the hallway.\n\nThe dude with the shotgun flips his shit and opens fire. He first blows Robbie's brains out, then Turk's, then Tiffany's.\n\nAdrian and Leslie throw their hands up and stand still. You wisely do the same.\n\n\"Now,\" the dude says, \"turn the fucking music down before this gets worse.\"\n\nLeslie immediately turns it down and the crazy dude leaves. The 3 of you are awestruck.\n\nAdrian starts wigging and gets the hell out of there and goes straight home.\n\nLeslie asks you to take her home, since Robbie had picked her up.", "action_results": [{"action": "Leave her and go straight home", "result": "You can't deal with what just happened. You just want to go straight home.\n\nLeaving Leslie to mourn the deaths, you head back to your place and try to sleep, but the fucked up events of that night keep you up. There's no point in calling the police, you think. There IS no police anymore. This is the kind of thing that happens almost everyday. Wrong place, wrong time.\n\nThese thoughts don't help ease your mind and you end up staying up the rest of the night, worrying about the future.\n\nYou were originally going to go job hunting the next day, but decide instead to stay home and just watch TV to clear your mind. On the TV is a broadcast of last night's Orion fireside chat, which you missed:\n\n\"We now have a solid plan worked out,\" the Orion representative says, \"We have already begun construction of eco-domes over every major city in the world to keep out the effects of pollution and global warming. We have deployed elite military squadrons all over the world in a state of temporary martial law. Crime has dropped significantly in these areas. Poverty has also been nearly abolished by our careful efforts. Please do not panic if you have not yet witnessed these exciting reformations in your area. I assure you we are tirelessly working around the clock with maximum effort and motivation. If you live in one of the following metropolitan areas, you are part of the next Chalk, Chalk 7. Orion will be saving you very soon.\"\n\nThe dude starts listing cities and major towns all over the world, one after another, for several minutes, then concludes with a typical fortune cookie expression of hope.\n\nAmong the cities named was Pittsburgh...\n\nYou are glad you watched that shit, though you are unsure of whether or not you can trust Orion. Do they really have everyone's best intentions in mind? What gives them the power to do all of this philanthropy?\n\nOh well, you think. Guess we'll have to wait and find out. It's not like things could get worse...\n\nRight?\n\nSuddenly, you hear a rumbling outside. You go over to the window and look down to see an enormous Orion convoy and countless troops rolling through the street. Martial law is already in effect. You didn't think it would occur this quickly, but there it is.\n\nHope has come to Pittsburgh!", "action_results": [{"action": "Two Years Later...", "result": "April 5, 2037 - 9:35pm - Your new fung shway Orion living quarters\n\nFor the past 2 years, you have been living alone in a beautiful apartment complex built by Orion. You got your old job back at the steel mill, which has been rebuilt - it is now much cleaner, safer, and you actually enjoy working there.\n\nThe air in the city is also much cleaner and the temperature stays at a constant 75 degrees, no matter what season. That's because Orion has built an eco-dome over Pittsburgh, which filters out pollutants and regulates the temperature. It's like living in a giant fucking Astrodome of plexiglass, so you still get the sunshine. And like Orion promised, poverty, crime, unemployment, and all the other shit from before has been pretty much abolished.\n\nThe present times are wonderful. Some would say Pittsburgh is like a utopia now. You guess the same could be said all over the world. Orion has gone completely global and they are now the world's government and military. We still have our own military, however, but Orion is obviously considered an ally.\n\nTonight is Friday, and your friends Adrian and Leslie, who are now together, are over.\n\n\"For Robbie, Turk, and Tiff,\" you say as the 3 of you take a shot of whiskey.\n\nThe festivities kick in. But then suddenly, the door is broken down and a squad of Orion soldiers storms in. Without hesitation, they grab Adrian and Leslie and storm out with them. You are stunned and wonder why they didn't take you.\n\nYou feel you should act to save them, but you are alone with no weapon. Then again, these are your best friends! Who knows what's going to happen to them!", "action_results": [{"action": "Try to rescue your 2 friends", "result": "You decide to act fast. With no weapons, you run out into the hall and spot the squad moving for the elevator. They board it, all but one of them who stays behind to secure the area.\n\n\"Hey, motherfucker!\" you yell just before ducking behind a plant. The soldier snaps his head towards your direction and aims his rifle.\n\nThe soldier slowly creeps towards you. Finally, he is so close, you can touch him.\n\nYou attempt to tackle him and take his assault rifle, but he overwhelms you. During the resulting wrestling match, the soldier manages to draw his sidearm, a 9mm pistol, and puts 2 rounds into your gut...", "action_results": []}, {"action": "Wait for them to leave the building", "result": "You decide there's no way you can take on a squad of Orion by yourself, so you stay behind and wonder why you were spared from capture.\n\nYou turn on the news to try to get some information. The anchorwoman announces that Orion has begun taking prisoners, all non-Aryan, and placing them in concentration camps. That explains why they took who they took! Adrian is black and Leslie has brown hair and sexy brown eyes! You have blonde hair and blue eyes, making you Aryan.\n\nThose fucking Orion bastards are starting another Holocaust, continuing where the Nazis failed! And that explains why we have gone to war with them...\n\nJust then, your apartment is suddenly engulfed in a massive explosion. You are knocked down by the blast and a piece of rubble lands on you.\n\nThen, blackness...\n\nA while later, you come to, and you see soldiers storming the hallways. Luckily, they are not Orion, but Alliance. One of them spots you and rushes to your aid.\n\nIt's your brother, William!\n\n\"Joe! We gotta get you out of here!\" he says, \"the war has already reached the concentration camp downtown. If those experiments get out, it's all over...\"\n\n\"William...\" is all you can croak out as he lifts you out of the rubble and carries you out into the hall.\n\nWhat did he mean, \"those experiments?\" You are too disoriented to worry about it right now and you pass out again...\n\nYou wake up at Will's place. His wife Amber comes in with a bottle of water. \"Hey Joe, feeling better?\"\n\n\"How long was I out?\" you ask, holding your throbbing head.\n\n\"A just a couple of hours. Here, drink this.\"\n\nYou chug from the bottle of water. Damn, that's refreshing. \"Thanks. Will mentioned something about experiments at a concentration camp here in Pittsburgh? I saw news of it on TV just before my place got blown to shit.\"\n\nA grim look appears on Amber's face. \"I'll let him explain it.\" She walks into the kitchen. Outside, you can still here distant gunfire and explosions in the city. The war's gonna be a fucking doozy.\n\nWilliam walks in and does his best to look optimistic. \"Hey champ. Sleep alright?\"\n\n\"Sure.\"\n\n\"Well, we need to get you out of the city. I've already packed you 2 plenty of food, guns, ammo, clothing - that sort of thing.\"\n\n\"What's going on? Why is Orion capturing people?\"\n\n\"It's all part of their 'Final Solution,' just like the Nazis had over 90 years ago. They're throwing nearly everyone in concentration camps, forcing them to work, performing horrendous experiments on them.\"\n\n\"Yeah, you mentioned that. What kind of experiments?\"\n\n\"The one I'm most concerned about is this toxin they've developed that can reanimate dead tissue. When the bodies started piling up, the Orion personnel decided to use the toxin on them. Thing is, the dead people that came back weren't themselves at all...my unit saw...they overran the entire camp...Orion couldn't contain it...the dead, they...\" Will puts his hand to his mouth, clears his throat, and swallows, \"they fed on people - my men, Orion's men, civilians - pretty much anyone they could catch.\"\n\n\"Zombies!?!?!\" you say shockingly.\n\n\"What!? No, Joe! Not like that...well, yeah, zombies. Shit!\"\n\n\"Shit is right, bro! We gotta go now! Wait, what about Adrian and Leslie?\"\n\nAt this, Will lowers his head and slowly shakes it. \"I'm sorry, brother. They're gone. My unit found them executed in the elevator. Guess Orion's changed their protocol - they're killing everyone in response to the, er, zombie outbreak. I've gotten reports that it's happening all over the world in other camps.\"\n\nYou can hardly believe it, but it's true. Those fuckers have killed nearly everyone you cared for! You wonder whether or not you could have saved Adrian and Leslie single-handed. And to make matters worse, Orion also caused the zombie apocalypse!\n\nWilliam goes into the kitchen and comes back with the provisions he packed. \"Look, you and Amber need to get to the dropship at the airport. Obviously, it's outside of the dome, so I'll have to get you guys past the entry/exit checkpoint. Once you're at the airport, just get on the dropship. Don't worry about me - I'm being evacuated, also, with the rest of the Alliance military. We're going to the same place as you and all of the civilians, so I'll see you there.\"\n\nYou look at Will like he's fucking crazy. \"Dropship? Evacuation? Where are we going?\"\n\n\"Damn it, I thought you liked keeping up on the news! The entire planet is shuttling itself into space and living aboard the ships until The Frontier can be colonized. The Frontier is an inhabitable planet on the edge of the galaxy...humanity's starting a new life there...\"\n\nYou can't believe it! All those late night conversations you used to have with your friends while stoned out of your mind about space colonization - you never thought it would actually come to fruition!\n\n\"We need to leave now,\" Will continues, \"or else we'll be stuck here.\"\n\nSo the 3 of you pack up all of the provisions into Will's jeep, then head for the airport. When you get to the security checkpoint to leave the eco-dome, it has been overrun by zombies. They are feeding on the bodies of the Orion guards.\n\n\"Serves them right,\" mutters Amber. Will continues driving, and you eventually get to the airport.\n\nJust as you expected, the traffic is horrendous going into the airport.\n\n\"Shit! There's no way they're going to get you on with all these people,\" says Will, \"I might be able to sneak you guys on the military ship with me. Either way, we're going to have to hoof it from here.\"\n\nThe 3 of you get out of the jeep, grab the provisions, and start walking towards the runways.", "action_results": [null, null]}]}]}, {"action": "Take her to her home", "result": "You gently place your arm around Leslie and the 2 of you walk out, being careful not to get close to the fuckers across the hall that did this.\n\nYou drive her to her house and she invites you in. \"I need you,\" she says.", "action_results": [{"action": "Accept her invitation", "result": "You decide to go inside with her. She breaks down and cries in your arms on the couch.\n\nThere's no point in calling the police, you think. There IS no police anymore. This is the kind of thing that happens almost everyday. Wrong place, wrong time.\n\nYou comfort Leslie as much as you can and try to tell her positive things. Eventually she stops crying and just stares blankly at the TV. You watch a late night romance movie together, snuggled up with each other.\n\nDuring the movie, Leslie suddenly puts her hand up your shirt and feels your chest. Slowly, she turns around and begins kissing your neck.\n\nKnowing Robbie is dead, you have no problem with it and you go for it.\n\nYou end up banging all night. You wake up naked in Leslie's bed at 1pm the next day with her beautiful naked body on top of you. A little while later, she wakes up too and you make coffee.\n\nYou spend a couple more hours with her. Then she is in a better mood, so you head home.\n\nWalking out of her door to go to your car, you see an enormous military convoy and countless troops roll by on the street. It's Orion - martial law is in effect.\n\nHope has come to Pittsburgh!", "action_results": [{"action": "Two Years Later...", "result": "April 5, 2037 - 9:35pm - Your new fung shway Orion living quarters\n\nFor the past 2 years, you have been living with Leslie, now your girlfriend, in a beautiful apartment complex built by Orion. You got your old job back at the steel mill, which has been rebuilt - it is now much cleaner, safer, and you actually enjoy working there.\n\nThe air in the city is also much cleaner and the temperature stays at a constant 75 degrees, no matter what season. That's because Orion has built an eco-dome over Pittsburgh, which filters out pollutants and regulates the temperature. It's like living in a giant fucking Astrodome of plexiglass, so you still get the sunshine. And like Orion promised, poverty, crime, unemployment, and all the other shit from before has been pretty much abolished.\n\nThe present times are wonderful. Some would say Pittsburgh is like a utopia now. You guess the same could be said all over the world. Orion has gone completely global and they are now the world's government and military. We still have our own military, however, but Orion is obviously considered an ally.\n\nTonight is Friday, and your friend Adrian is over.\n\n\"For Robbie, Turk, and Tiff,\" you say as the 3 of you take a shot of whiskey.\n\nThe festivities kick in. But then suddenly, the door is broken down and a squad of Orion soldiers storms in. Without hesitation, they grab Adrian and Leslie and storm out with them. You are stunned and wonder why they didn't take you.\n\nYou feel you should act to save them, but you are alone with no weapon. Then again, these are your best friends! Who knows what's going to happen to them!", "action_results": [null, null]}]}, null]}]}]}]}