{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=56507", "context": "", "first_story_block": "The young woman stands still. Her brown hair flows freely in the wind. Most would shiver in the freezing cold, but she does not. She got used to the cold long ago.\n\nSnowflakes fall and sit on top her head for a moment before melting. Thousands of tiny pins drop all around her. Each snowflake plays a note in this melody.\n\nShe sighs. Her wispy breath comes out like a fog before dissipating into the morning air. The graves say nothing to her. They’re all dead, markers for dozens who should remain in the past. The woman trudges foreword crunching the snow beneath her boots with each step. She stops at a grave.\n\n“Hey,” she mutters. She crosses her arms, folding into herself. “I’m back.”\n\nThe grave says nothing. Even though the occupant lives on, she knows that life exists only metaphorically. She’s talking to a grave. It does not hear her. It will not reply. Maybe this’s just an excuse to talk to herself. She doesn’t know for sure.\n\n“What happened in the last year? It’s been three hundred and sixty-six days this time around. Zoe got to celebrate her birthday on the right day this time around. The poor kid’ll have to wait another four years for that to happen. Oh, I almost forgot. She and Ezekiel insisted my cake have twenty-seven candles on it. Ain’t that the sweetest thing?”\n\nThe grey stone lies there as it always has and always will. The consistency warms the woman’s heart. She raises her hand and looks at the lilacs she carried all this way.\n\n“I don’t think you were into flowers. Well, this’s a white lilac. I like the meaning of this little guy, so I grew it in my greenhouse just for this occasion. I’d like the imagery more if you would take it from me, but you’re dead. Not much you can do, so I’ll just put it here.”\n\nShe sets the flowers down. For a moment, her eyes flash red. She clutches her temple and blinks. They revert back to their normal brown.\n\nShe smiles. “I’m still in control. Ain’t that nice?”", "action_results": [{"action": "January 14th, 1994", "result": "You walk home from a long day at work. People complain about long work days, but they got nothing. You put in ten thankless hours making next to nothing. The wind blows through the holes in your jacket. One day, you’ll patch it up. Shivering, you quicken your pace.\n\nThe path back is harder than the morning. You shrug. It’s the price to pay for living up top of the hill. The mound has some sorta official name, but all in this sleepy little town just call it that. You like living there. No neighbors. No loud noises. No lights. Darkness. Just darkness and silence.\n\nYour feet hurt. Maybe the charity store has a better shoe size now. Looking down, you see two worn out tennis shoes that are a half a size too small. Each step shoots a minor jab starting from your feet and ending at your hips. You’ll get to rests soon.\n\nSpying your house, a smile comes across your lips. The heater will warm your bones again this February night. You’ll make something to satisfy your hunger. “No,” you mutter under your huffing breath. “Paycheck comes tomorrow.” What do you have in the fridge and pantry? Four, maybe five slices of bread. There’s some peanut butter too. That’ll do. A feast for two.\n\nYou clench your fists. Why can’t you do better? Is this all life will give to you? Damn life. Damn him. Your body shudders just thinking about that monster. You can make it on your own. You’re good enough to do it.\n\nYour house sits in front of you. Each step causes it to look less and less small. You’ve kept it looking nice. It could use some paint, and that railing needs fixing. The window still got that board over it. It could be worse… though it could be better as well.\n\nYou unlock the door and step inside. “I’m home,” you say. No one replies, as always. She never gets here after school ends. At the earliest, your kid arrives at evening. “Lazy and unappreciative.” You lock the door behind you. “She could at least dust the place.”\n\nYou turn on the heater and set about to cleaning. You’ve been asking her for almost a week, but she won’t get off her ass to do it. You feed her, clothe her, and give her shelter. It’s all the minimum essentials, but that’s all you got. Would expressing thanks be too much to ask?\n\nThe sun sets in the grey winter sky. Yellow lights pop up in the town below, signs of life. Humans are a funny bunch. By turning on lights, they fight back against the darkness, yet nothing really changes. It’s like how you used to hide your face as a child. The big scary monster wouldn’t hurt you if you hid your eyes. To them, the big scary monsters won’t hurt them if they see all with their eyes. You chuckle. “A different side to the same coin.”\n\nOf course, the monster hurt you anyway, regardless of whether you saw it or not.\n\nYou look down. Your fists clench the dinner table, knuckles turning white from the grip. You let go. Grabbing an ax, you head outside to cut wood. Fires are cheaper to run than the heater. You found it’s a good way to blow off steam anyway.\n\nYou aren’t one of those muscled women. It’s hard work, more hard work. Too bad your daughter’s too young to help with this… You imagine the situation for a moment. It wouldn’t be a good idea. Knowing her, someone would get hurt if she had to chop wood.\n\nAt least nature provides. If it wasn’t for the several fallen trees on your land, then you’d have to buy it. There’s always a silver lining. The house sits around being a piece of shit, but at least the trees got some use. Well, they get squirrels too. Those chattering rats provide some cheap food too, just some time and a bullet.\n\nAs you pile up the wood in your wood shed, you hear a creak from the front porch, then another. Setting down the ax, you head back inside. She’s home.\n\nThe girl carries her backpack and chatters her teeth together. She gives that blank stare you’ve grown accustomed to over the past few years. Glancing at the clock, it shows a few minutes before nine.\n\n“You’re later than normal,” you deadpan. “Any explanation?”\nShe shakes her head.\nYou clench your fists. “I dusted the house. Any reason why you couldn’t at least do that?”\nShe shakes her head again.\n\nWell shit. Now, you’re irked.\n\nYou unclench your hands. Your daughter flinches. You slap her. She stumbles back a step or two before a tear cascades down her face. A red handprint forms on her left check.\n\nShe never stops giving that blank expression. “Don’t hurt me again, Mother.”", "action_results": [{"action": "Calm Down", "result": "Your right hand morphs back to human form, losing the claws and the darkness. It’ll rear its true form soon enough.\n\n“Come on.” You gesture to the table. “Let’s eat before the flies do.”\n\nWithout a word, she nods and trudges to the meal. She sits on the opposite side of you. She nibbles on the bread and peanut butter. You eat yours in a few bites.\n\n“How’s school?”\n“Fine.” She doesn’t look up at you. She stares at her food as if it’s the most important thing in the world.\n“How about grades?”\n“Fine.”\n“Anyone giving you shit?”\n“Not really.”\n\nShaking your head, you put your plate in the sink and handwash it. After a minute, adds hers, so you wash that one as well. She never helps with dishes. She slinks up to her room. If you allowed her, you’d bet she close her door too.\n\nYou walk to an old dresser. Scratch marks, a few stains, and a large dent make it seem more like an antique than a newer commodity. You can’t complain. It serves its purpose. Opening the middle drawer, you take out her report card. For the first time, you take out her paper from the envelope.\n\nD, D, D, F… Shit, that’s fucking horrible. Why the hell hasn’t she at least told you about this? For that matter, shouldn’t one of the teachers tell you this instead of letting her education suffer. Glancing at the card again, you see one sliver of hope. An A sits at the bottom, too bad it’s in art.\n\nYou stride up to her room. Your footsteps sound like marching drums. Your hands twist into claws again. Your eyes see in the dark as if it was light. You tongue grows long.\n\n“Explain your grades.” The sheer power of your words all but shake the walls.\n“Sorry.” She moves from lying down on her bed to curling up into a ball.\n“What was the rule?”\n“Everything has to be a C or higher.”\n“Are you a fucking dumbass?”\n“No.” Her words lack conviction.\n\nYou dash onto her bed. She gasps. Your face is inches from hers, so she closes her eyes.\n\n“Stop being lazy and actually try. I dare you to keep on doing whatever you’re doing.”\nShe shakes her head.\n“There’ll be real shit to pay if I see even a single D on the next report card. Got it?”\n“Yes, Ma’am.”\n\nYou glance around the room. Her bed’s unmade, her clothes are in piles on the floor, her desk doesn’t have anything to do with schools. It’s instead covered in drawings.\n\n“All you do is draw and wander the town. What the hell are you doing out there anyway? It’s not like you have any friends.”\n“Nothing.”\n“Then do something here. Do school. Go to bed.”\n“Yes, Ma’am.”\n\nYou leave as your body parts revert to normal and nod at yourself. That problem shouldn’t cause you any more troubles now. She better stop being lazy. There wouldn’t be a single problem if she had an inkling of initiative.", "action_results": [{"action": "January 21, 1994", "result": "You remain perfectly still. Snow piles on your flowing hair. Each breathe feels like a sharp jab in the chest. Today must be the coldest day of the year, but that won’t stop you from getting meat. Your ears perk up. In the distance, you hear the slightest discrepancy among the snow falling. Two maybe three animals approach.\n\nYou doublecheck your position. Trees make visibility lower, but your position on top of a small hill helps that. The ridge is unfortunate because everything to your east, including those animals, can’t be seen from your spot. If it wasn’t for the two animal trails converging on this location, you wouldn’t hunt here often.\n\nYou give a toothy grin. All sorts of sensations flow through your body. It has a name in some book, probably. You just call it the Hunter’s High. Everything comes into greater focus. The moonlight becomes brighter. The smells become more potent. Even the snow seems to fall slower.\n\nIn most instances, you would strike, but their steps come closer and closer. You decide there are three different creatures. One sounds lighter than the other two, probably a small or sickly doe. No other creatures would sound like this.\n\nYour knees crouch just a few inches. You clench your hands into fists. They should be here soon.\n\nThree does step over a ridge. You strike and set your mind to a glorious hunt.\n\nEverything comes back into focus a little while later. You’re not quite sure exactly how long it took, but the moon hasn’t moved far. You clean the three carcasses before lugging them home.\n\nYou hum. Nothing makes you happier than a successful hunt. You provide for your little family and get to run wild. No one else can do anything to you while being aggressor instead of the victim.\n\nYour house transitions from a tiny dot in the distance to your meager adobe. Instead of taking the front door, you walk around to the back. You take some rope out from your shed and hang the deer for them to air out. As you hoist up your final kill, you notice a light coming from your daughter’s bedroom. It must be in the early hours of the morning. What is she doing?\n\nYou creep to the back door and insert the key into the deadbolt. It clicks. You take careful steps inside, doing everything possible to not make a sound. Is she trying to waste electricity? She knows that stuff doesn’t grow on trees. You slither up the stairs and peer into her room.\n\nUsing her lamp, her room is casts into a dancing assortment of shadows. She holds a pencil and scratches away at a paper. This can’t be writing. It’s… Your blood boils and your teeth become fangs.\n\n“What the fuck are you doing!” You stomp into her room.\nShe falls out of her seat and bumps her head against the wall. “M-m-m… I, uh…” Her eyes drown in fear.\nYou pick up her paper. You see half a person, a girl by the looks of it. “Are you drawing?” You shove the picture an inch from her face and dangle it there.\n“Y-y-y…” She gives up trying to speak and nods. Tears form in her eyes.\n“Didn’t I tell you to stop doing that!”\nShe nods.\n“Holy shit, you’re fucking retarded. You need to get your grades up, but you fuck around at night drawing pictures? I told you. God damn it! I damn right told you, but did you listen? No, you just did what you always wanted to do because you seem dead set to be a bum. At this rate, you’ll be a bitch whoring out on the street. You think you can fuck with me and get away with it? Tell me!”\n\nShe sits in the corner and cries.\n\n“Tell me!”\nShe covers her head protectively. “I like drawing.”", "action_results": [{"action": "Don't Give a Shit", "result": "“You wanna waste your life? Fine. I honestly can’t give a shit about you anyway. It’s like talking to a dead corpse.”\nYour daughter looks at you then back at the paper. “So I can still draw?”\n“For all I care, whore out at school.”\n\nYou stomp out of her bedroom and spend the rest of the night fuming in your chair.\n\nYou don’t hold a meaningful conversation with her for the next week. She eats. She sleeps. She fucks around doing some shit in the bedroom. Around you, she tries to act like a ghost, a presence only felt instead of sensed.\n\nJanuary 29th, 1994.\n\nEverything changes when you get a nock on the door one Saturday. As usual, your pathetic excuse for a daughter sits up in her bedroom. That means you get the door.\n\n“Hello!”\n\nUg, that’s chipper beyond reason. Your eyes narrow. Why would one of her teachers come to visit on the weekend. Maybe the brat spread lies as revenge despite how nice you’ve been. Which teacher is this anyway? Math? English? Meh, it doesn’t matter.\n\n“Hi,” you grunt.\n“I tried calling, but your line sounded like it was down.” The woman still has some youth, but she also has too much jiggle. She should lay off the doughnuts.\n“Missed this bill.”\n“Oh.” She cringes somewhat. Maybe since she got embarrassed, she’ll leave. “Can I come in?” Shit.\n“Sure.”\n\nShe enters the house and you close the door behind her. She shifts uncomfortably until you motion to the table. You both sit down.\n\n“Why the visit?”\n“I’m concerned about your daughter.” No shit. Also, damn it. She must be a new teacher. One of those assholes who do everything to help the kids. She’ll burn out in a couple years. Maybe she could loose some weight along the way.\n“Why?”\n“Over the past week or so, she pretty much stopped talking altogether.” Her eyes glance at your open and barren cupboard. Does she eat more in a day that you and your daughter combined?\n“She does that.”\n“Just wanted to see if everything is alright. You know…” She lists phycology crap. It might have something to do with her being hungry. You’re not sure. “…So I wanted to see if she was eating enough.”\n\nYou feel your teeth sharpen. How dare she insult how you raise your child!", "action_results": [{"action": "Just Fucking Kill Her", "result": "You lunge across the table as your entire body reverts to its primal state. Hair, claws, and teeth reveal themselves. You smell the woman pissing and shitting herself and sink your teeth into one of her two chins. She lets out a gurgle as blood sprays out of her neck like Cheez Whiz out of a can.\n\nYou lick up the blood and savor the metallic, salty flavor. You poke at her fatty skin. Perhaps that would taste good as well. Curious to what you may find, you rip into her bloated belly. Opening her stomach, you see an assortment of interesting items. It smells like chicken and watermelon. To your surprise, you find an almost intact chicken bone. It is used to pick her fat from in between your teeth.\n\nSomeone hurls behind you. Turning around, you see your daughter standing at the top of the steps with her vomit piled at her feet. She seems sorta pale.\n\n“Go to your room!”\nShe nods and walks back. Each footstep has a slight smushing sound to it, probably because of her vomit.\n\nYou glance back at the corpse. Then, the utter horror of the situation becomes clear. Her blood stained the carpet. You let out a wail before picking up the body and tossing it out the back door. The door’s shut quickly to keep the cold air outside. Taking a rag and a filling up a bucket of water, you do all you can to stop the staining. “My precious carpets,” you mumble to no one in particular.\n\nYour ears perk up. Four or maybe five cars are coming. Their sirens are unmistakable. Didn’t the police station have only five cars? What’d they be out here for… Your eyes open in shock. “Girl, get your lazy ass down here this instant!”\n…\n“Fucking move!”\nNothing.\n\nYou see the flashing lights pull up outside. The men exit their cars with weapons already drawn. One of them speaks in some microphone telling you to get out with your hands up. You bare your fangs and growl.\n\nLeaping through your window, maybe you should’ve taken the front door to save money on window repair, you prepare for carnage.\n\nThere’s carnage and there's shit. The shit came from three of the police officers. All but one ended up pissing themselves. That one took a leak just before your daughter called them up from a neighbor’s landline. Unfortunately, the shit also came from you. As you've seen many ties before, when bodies die, they shit all over the place. That’s what happened to you. As for the carnage, it was all you. Ten bullet holes. Despite the gore, your daughter insisted on seeing your corpse. She spat on it.", "action_results": []}, {"action": "Yell at Her", "result": "“You dare insult me!” You slam your hands on the table.\n“No, no I didn’t.” She shakes her head. Her neck fat jiggles.\n“Get out,” you growl.\n\nShe nods and runs out the door. She trips once outside before lumbering into her car. It tootles away.\n\nGrowling, you clutch your table until the wood shatters. “Shit, now I gotta fix this too. Should’ve just killed the fatty.”\n\nYou glance outside to the three deer carcasses. There’s plenty of food for the both of you. What does she know anyway? That teacher probably thinks that anything less then five hamburgers a day in child abuse.\n\nHer footsteps come down the stairs. You glance at your daughter.\n\n“Was that my teacher?”\n“Don’t bother me.”\n\nShe leaves for her room again which’s good. The less you see of that girl, the better. Maybe she’ll learn to be less of a lecherous person one day, but you shouldn’t get your hopes to high. If you force her to become independent, she could improve. At the very least, expecting nothing of her but doing nothing for her would make your life much less annoying.", "action_results": [{"action": "February 12th, 2010", "result": "The young woman rearranges the flowers a little. She nods at herself. “There. Doesn’t that look pretty? I can be orderly. Just ask my husband.” She chuckles to no one in particular.\n\nShe looks up. Snowflakes no longer dance above. The skies have cleared to show a pale blue.\n\n“My kids are good workers too. I would’ve been if you ever gave me the chance, but we can’t change that now.”\n\nShe turns around and walks back, retracing her footsteps through the empty graveyard. The woman puts her hands in her pockets. She stops midstride. Without looking back, she says, “I still haven’t forgiven you. Don’t you dare think I ever will.”\n\nThe daughter exits the graveyard leaving the graves to silence again.\n\nThe white lilacs lie in front of the gravestone for a week before they rot from the rising temperate. Soon, the pristine beauty became a decayed black.", "action_results": []}]}]}, {"action": "Get Angry", "result": "“You fucking what!”\n“I like drawing.”\n\nYou slap her across the cheek. She lets out a yelp. Faint claw marks already drip red on her face. “You think that’s a good excuse? Fine! Try drawing without any of your shit!” You snatch up all her paper and every pen and pencil. “And you better not let your grades suffer. If I see one C, then you’ll wish you had never been born.”\n“B…”\n“What is it!”\n“How can I do school if you took all my supplies?”\n“Maybe you should’ve thought about that before you started drawing! Fucking hell, how can you be so stupid?”\n\nShe doesn’t say anything. All the bat does is sit in her corner and cry, not even giving you the proper respect to reply. How dare she!\n\nYou pick her up by her shirt and scream in her face, “Answer me when I ask a question!”\n“Yes, ma’am.”\n“That’s not an answer!”\n\nYou throw her down hard. Her body give an audible thud when it strikes. She screams in pain.\n\nYour spit flies from your teeth onto her face as you bellow in fury. “You fucking nitwit! Everyone knows art doesn’t pay for shit. We live in shit, and I’m not even a fucking artist. Why are you so stupid?”\n“I’m a stupid person!” She clutches her forearm.\n“Yes. Finally you understand. You know what stupid girls do?”\n“N-no!” She clenches her teeth.\n“The do chores but they don’t do art. Go to bed before you do anything else stupid. Oh, and suck it up, you pussy. A little pain never killed anyone.”\n\nShe stands and nods. Blood drips down freely from her sliced cheek. For some reason, the girl hasn’t let go of her forearm.\n\n“Let go of your forearm already. You got no brains at all if you think I’ll fall for a pity party trick.”\n“I think it’s broken,” she whimpers.\n“Tough luck.”\n“Really.” She nods and sniffles.\n\nYou pry her hand off an examine her arm. No bone protrudes from her arm, but that’s one hell of a bruise already.\n\n“Deal with it. We don’t have money to spare on frivolous things like hospitals.”\n“My teachers will notice.” She hiccups or whatever that pathetic noise is called. “They’ll send me to a nurse who’ll ask my why I hadn’t gone to a hospital. That won’t make you look good.”\n“Manipulative bitch, you broke your arm on purpose!”\n\nShe looks up at you. Her eyes narrow. “I’m going to a hospital, mother.” For a fleeting moment, her eyes flash red.\n\n“Please stop!” You whimper and clutch your chest. “I’ll make you your favorite-” Another slap stops you midsentence. As the world spins around, you see your daughter clutching her teddy bear. Her eyes are wide open in a frozen horror. “Mommy’s alright. Go to bed, sweetie.”\n\n“If you fuck up one more time.” His lips curl into a grin baring his painted teeth. “You won’t be the object of my attention.” He motions towards your daughter. His eyes glow red, a horrible color. The color of blood.\n\n“No.” It’s not a whimper or a declaration. It’s a cold statement, a fact of life. Your eyes glow red. The curse spread to you. His eyes open in terror moments before his throat is opened in a gory liberation.\n\nThe curse has spread to her as well.\n\n“I’m sorry.”", "action_results": [{"action": "February 12th, 2010", "result": "“Well, I better get going.” She pats the flowers and walks away from the grave. Snowflakes already dust the flowers. The woman stops and looks back. “I never did get it though. How come you abruptly changed your mind like that? Dumping me off over a broken arm? I grew up in foster care from then on, though I’m not complaining. Much better people, you know?”\n\nShe sighs. “Maybe it was the eyes. I don’t think anyone can scare a monster. By comparison, everything else seems tame.” She shoves her hands into the coat pockets. “The monster can’t see anyone scary. When you’re an evil, insane person, the only thing that can scare you is your own reflection.”\n\nThe woman turns around and gazes into the distance. An old truck awaits for her in the parking lot. A man is turned around in the driver’s seat. She can tell he’s talking to two beautiful children.\n\n“I like my reflection.”", "action_results": []}]}]}]}, {"action": "Get Pissed", "result": "“You dare backtalk!” You push her against a wall. “Listen now, because I’ll only tell you once, don’t ever backtalk again or I’ll grind you into ground beef.”\nShe nods without showing any emotion.\nYou slap her again. “You got that?”\n“Yes, ma’am.”\nYou slap her other cheek. “Louder!”\n“Yes, ma’am.”\nYou re-slap her cheek. “Louder!”\n“Yes, ma’am.”\n\nYou push her to the ground and walk away from her. She picks herself up and scampers to her bedroom. What will you do about that girl? She spends all her time being away from the house and not doing her chores. Why? It’s not like you ask much of her. At her age, you were cleaning the entire house, cooking, and taking care of a baby brother. What’s with this generation?\n\nShe sobs. You can hear it even though it sounds muffled. Maybe she buried her face in a pillow. At least you got a response after this disciplinary measure.\n\nShe’s been such a bitch lately. Time to fix that. You see two things you could do right now. Maybe, you could follow her and find out what she’s been doing out so late. You shudder. It’s probably gloryholes. It seems like something she and this generation would do. Either that or you could kill her.\n\nYou shake your head. Where did that thought come from? It must be some lingering effects.", "action_results": [{"action": "Kill Her", "result": "Fuck it. You’ve dealt with her shit for long enough now. If she wants to do nothing but lie around, then she can do that in a coffin. You march upstairs to her room. Exhilaration pumps through your body as it does for every hunt. This time, your prey is much closer to home.\n\nShe doesn’t see your form in the doorway. She’s too busy crying into her pillow. Rip off her head? Smother her? Choke her to death, kill some deer, and disguise her meat by intermingling with the deer meat? That’s a good idea. You nod to yourself, happy at your brainstorming.\n\nYou creep up to her, but the floor creaks. She turns her head and looks at you. “What are you doing here, mother?” She wipes off her tears. Your claws reveal themselves and you take a step forward to… No, you can’t do this. Every animal and human instinct inside you screams to protect that extension of your flesh and blood.\n\n“Mother?” She sounds scared.\n\nYou raise your claws up. Life has been too hard. You can’t stand to live with that girl anymore. You swipe down. Blood shoots out from the torn throat of the victim. Gurgling noises fill the room along with a scream. Your daughter becomes nearly hysterical from watching her mother slitting her throat.", "action_results": []}, {"action": "Stalk Her", "result": "What were you thinking? You should find out what your daughter has been doing.\n\nJanuary 18th, 1994.\n\nYou stood there for hours as you did yesterday. Like yesterday, your daughter did the exact same thing. She sat on a bench at the playground. Nothing more. Nothing less. She didn’t move and read. She sat there. You’d think that dumb bitch was a statue if it wasn’t for the puffs of her slow, rhythmic breath.\n\nUnlike last time, you step into her line of site. She gasps. “Mother?”\n“What are you doing here?”\n“Nothing?”\n“Answer my question!” Your eyes flash red. You feel your sharped teeth.\n“That was my answer. I am not doing anything.”\n\nYou lay your hand on her shoulder and squeeze. She grunts. Your hand gains in hair and claws, but there aren’t many people around. They won’t notice.\n\n“Why aren’t you doing chores?”\n“It’s safe out here.”\n“You’ll get raped, murdered, and raped again out here.”\n“I don’t get hurt.”\n“Are you insinuating something?”\n\nShe grunts. Your grip has become tighter. She stands up and slips out of your grip in your surprise.\n\n“Yes, I am. What are you going to do about it, bitch.”\n“You fucking slut!” you shout. You slap her, harder than you ever had before.\n\nPeople scream. Oh shit. There are a few people around.\n\n“Monster!” one of them shouts.\n\nMonster? You revert to your human form, but you can’t. It won’t change. You hand won’t become small. Your eyes remain red. You look at your body. It’s all monster.\n\nYou snarl at the people.\n\n“Come on, let’s…” Where is she? You can’t see her, though her scent is close by. A rock hits your head. Several teens parked their car just to get out and throw rocks at you. What pricks. You charge at the stupid members of society. They will-\n\nYou fall on the ground, a hole the size of your human fist has opened in your stomach. Glancing up, you see a local hick holding a shotgun. That’s not fair. He fires again. This time, for your head. It pops like a tick that drank too much blood.", "action_results": [{"action": "February 12th, 2010", "result": "“Is it bad that I don’t feel like spitting on your grave?” She dusts off the snow that accumulated as she stared at the marker for the dead. “You were a horrible person, but I think you knew that.” She clenches her fists. “Even though I have your curse, I’ll never understand. I’m normal. You were not.”\n\nShe turns around and walks away without saying goodbye. Halfway to the car, she stops and turns around.\n\n“Was it because of father? I remember him. He gave it to you. You gave it to me. It’s not an excuse for your actions, but is that who you did what you did? Well, I broke the trend. My kids have beautiful eyes.”\n\nShe smiles at her many memories of them. She turns away from the graveyard and leaves. Each step a little more spring than they normally do. Her mother won’t be hurting her anymore.", "action_results": []}]}]}]}]}