{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=1046", "context": "", "first_story_block": "It is 8:00pm - you are sitting in your favorite reclining chair and watching t.v. when suddenly a special news report breaks into your show...\n\n\"Attention...Emergency alert! Those that\nlive in the vicinity of Headstone Lane and Graveyard Drive.\" \"A suspicious character has been seen in the area weilding an axe and screaming obsenities.\" \"HE IS VERY DANGEROUS!!!\" \"Lock all your doors and windows and DO NOT call the police.\" \"They have already been dispatched to the area.\" \"It has been reported by eye witnesses that this character is male, approximately 4 feet 3 inches in height and could be experiencing hallucinations from the new street drug \"Methradone\". \"Those living in the area...be careful and cautious!!\" \"Now we return you to your program \"Planet of the Dead\"\n\nYou stare in amazement at the screen. YOU live on Headstone lane! Is this a joke? This part of town is populated by retired folks and good church going people, you think.\n\nSuddenly there is a knock at the door. What do you do.", "action_results": [{"action": "look through the peep hole?", "result": "You get out of the chair and look out the peep hole of your front door. You don't see a thing.\n\n\"Wait a minute...this guy is only 4 feet tall!!\" you think. \"He could be right on the other side of the door and I still would'nt be able to see him.\"\n\nJust then, you hear glass breaking at the far end of the house.\n\n\"Sounds like the bedroom!\" you think.\n\nYou own a 9 millimeter hand gun but keep it under the bed in your bedroom.\n\nCould it be the murdering midget coming through the bedroom window at this very minute? What if he finds the gun?\n\nWhat do you do?", "action_results": [{"action": "run out the front door?", "result": "You open the door to run but instead, you are met with a gun to your head. a policeman standing to the side of the door has his gun drawn. \"HOLD IT!\" he yells.\n\nYou put your hands in the air and exhale in relief.\n\nThe cop holsters his gun and asks \"Are you all right?\"\n\nYou nod \"YES\" although you are not really sure.\n\n\"My name is Officer Reeves.\" \"Sorry about the scare but a crazed maniac has been loose in the area and was last seen running down your alley.\"\n\nYou tell Officer Reeves about the sound of broken glass and the gun you keep under your bed.\n\nOfficer Reeves concurrs with the sound and tells you to go sit in his police car while he checks things out.\n\nFive minutes pass as you sit in the car waiting in fear and excitement.\n\n\"Something should have happened by now\" you think.\n\nTwo gun shots sounds suddenly go off in the house and you see flickers of light (gun blasts) come from the bedroom area.\n\nWhat do you do?", "action_results": [{"action": "go back into the house?", "result": "You run back into the house screaming for officer Reeves.\n\n\"It's OK!!! It's OK!!!\" you hear coming from the back of the house. It's officer Reeves'voice.\n\nYou let out a sigh of relief and start down the hallway.\n\n\"Don't come back here!\" officer Reeves states. \"It's a mess.\"\n\nYou stop dead in your tracks, vivid images of gore fill your head.\n\n\"Get back out there and radio for backup...tell em' we got him.\"\n\nYou go back out and call for help. Within minutes your house is covered with cops, neighbors, and the press.\n\nFor the next few days you are the neighborhood hero. Your face is on the local news and newspapers. You get more attention than you feel you deserve but...who cares.\n\nYou helped kill the murdering midget.\n\n~~THE END~~\n\nNOTE: A job well done!! You and Officer Reeves make a good team.", "action_results": []}, {"action": "use the radio in the patrol car to dispatch for help?", "result": "Another three minutes pass before seeing three more police vehicles pull up in front of your house. You watch as six policemen run inside.\n\nAn eternity seems to go by before an ambulance pulls up in front of the house and soon a body is wheeled out on a gurney.\n\nYou jump out of Officer Reeves' patrol car and find that it's Officer Reeves being wheeled out to the ambulance.\n\n\"He's been shot in the leg .\" one of the officers replies. \"If it wasn't for your dispatch, he would have bled to death.\"\n\nNo one else was found in the house but an axe was found next to officer Reeves.\n\nGreat! Now the crazed li'l man has a gun and still on the loose!\n\nWhat now?", "action_results": [{"action": "go back in the house?", "result": "You run back into the house and find the cops already taping off the area around your bedroom.\n\n\"The forensic team will be here shortly\" a policeman reports. \"Try to stay out of the way.\"\n\nSince the lunatic is still at large, you decide to get into your car and drive to your parents house 30 miles out of town.\n\n\"I hope they catch the freak.\" you think as you start up your car and pull out of your driveway.\n\nUnfortunately for you, the little freak somehow got out of the house and is laying quietly in your back seat...\n\nTwo days later your body is found on the side of the road by a truck driver. Your vehicle is never recovered and the murdering midget rides off into the sunset...\n\nJust kidding!!\n\nYou make it to your parents house, the midget is finally found dead in an alley close to your street, apparently killing himself with the gun, and you live happily ever after...\n\nYou go ahead and decide which ending you like better and make believe that THAT is the one that happened.\n\nAnyway...\n\n~~THE END~~\n\nNOTE: I just love short and/or sweet endings. You decide and thanks for playing.", "action_results": []}, {"action": "get in your car and drive to your parents house (30 miles away)?", "result": "You hop into your Ford Explorer and head toward Mom and Dad's house. As you leave the city behind, you feel yourself becoming a little more relaxed. You turn on the radio...\n\n\"NEWS FLASH\" \"The crazed man going by the name \"The Murdering Midget\" was captured in a bloody battle with police tonight...three policemen were killed and one injured. \"The man is said to have been a worker at the local carnival.\" \"More to come as the story unfolds.\"\n\nWhew!!!\n\n~~THE END~~\n\nNOTE: You have travelled the path of least resistance and come out victorious. Although battling the midget and killing him is far more satisfying...I believe you got where you wanted. Good Work.", "action_results": []}]}]}, {"action": "make your way into the bedroom and try to get the gun?", "result": "You slowly walk down the hallway and into your bedroom. You flick on the light.\n\nNothing seems disturbed...wait...you see a small hatchet laying on the bed. At closer look you find a red substance on the blade.\n\n\"Is it blood?\" you ask yourself.\n\nYou reach over the bed and pick up the small axe. You start to further investigate the axe when you hear a scream come from outside your house. You drop the axe back onto the bed and run over to the bedroom window. The window has been broken and you step on pieces of glass. Luckily you have your trusty shoes on and you don't get cut.\n\nThe street lights are on and you see the shadow of a large man limping up the street. The figure's left leg seems hurt.\n\nAs the figure makes his way into the bright glare of the next street light, you notice that the man is a police officer.\n\n\"HELP!!\" he screams.\n\nHis gun is in his right hand and his left hand is held down at his hurt leg. The leg is leaving a small trail of blood behind him.\n\nSeeing the cop's gun reminds you of your gun under the bed...\n\n\"Wait a minute!!\" you think.\n\nYou finally realize that the midget might be in the house with you right now!!! If so...where could he be.", "action_results": [{"action": "make a dash for the gun under the bed?", "result": "Finding the gun under the bed, you check it to make sure it's loaded and the safety is off. It's been a long time since you even used the thing. It's loaded.\n\nYou feel much better now. You walk back over to the window to try to locate the cop but he's nowhere to be found.\n\n\"Could the midget still be in the house?\" you almost say out loud.\n\nYou check every room of the house with gun cocked and ready for anything. You find nothing.\n\nYou decide to hop into your car and try locating the injured police officer. Driving down Headstone Lane, your locate him, two other cops, and half of the neighborhood at the corner of the street. Paramedics are pulling up to the scene.\n\nUpon asking if the officer is alright, one cop replies, \"He got into it with that murdering bastard and wounded him...but not before getting the axe in the crotch.\"\n\nYou cringe just thinking about it. You relay the happenings of the night to the officers and express the possibility of the little dude still being at your house. You lead them to your home along with half the neighborhood gathering at the front of your driveway.\n\nYou watch the officers enter your house and you cross your fingers for good luck.\n\nFive minutes pass and a female officer comes back out motioning you to come inside. You are escorted into the house and into the master bathroom. There, in the cabinet under the sink, lay the murdering midget...dead from a gunshot wound to the chest and laying in his own blood.\n\n\"I'm amazed he made it as far as he did sustaining a wound like that.\" exclaims the female officer.\n\nYou turn and walk out your front door finding channel 3 news on your door step.\n\n\"Were you frightened?\" asks the reporter.\n\n\"I'm just glad it's over.\" you reply.\n\n~~THE END~~\n\nNOTE: Good Work!! The murdering midget is dead and things did'nt even have to get messy. Cool!!", "action_results": []}, {"action": "climb out the window to help the cop?", "result": "You carefully break off the jagged edges that are still protruding out from the window sill.\n\nPING, CHING, PLANG...\n\nThe sounds of the breaking glass catches the attention of the police officer. He turns and aims his weapon in your direction.\n\nYou are too busy trying to climb the wall and out of the window when you feel a piercing pain in your left thigh. You reach back in pain and feel the axe deeply inbedded into your leg.\n\nThe midget reaches up and grabs the belt loops of your Levi 501s. He tugs you off the wall and drags you back into your room...face down.\n\nScreaming in agony, you realize the crazy man was hiding somewhere in your room all along.\n\nThe little man stands over you and grabs the axe firmly with both hands. He pulls the axe from the back of your thigh with a disgusting \"SLORP\".\n\nDark blood drips from the blade...your blood this time. He holds the axe high over his head and with one fierce motion, brings it crashing down into your spine and severing it right below the shoulder blades.\n\nYou scream again, but this time your screams are met with a loud...\n\nBLAM!!! BLAM!!!\n\nTwo bullets enter the midgets skull quickly putting him on his back...dead to the world.\n\nAre you all right?..Sir?...Oh no!!\n\nIt's the police officer leaning over the window and into the bedroom. He somehow made his way over to your yard and to the rescue...unfortunately...he was too late.\n\n~~THE END~~\n\nNOTE: You so much want to yell out to the cop but...oh well. Just to think- that gun is still sitting pretty under the bed. Try Again.", "action_results": []}, {"action": "call out to the cop?", "result": "HELP!!!! He's over here!!!! you scream out to the world.\n\nThe policeman does not seem to hear you. You call out again...and again. The cop just keeps limping up the street.\n\nYou could still try to climb out the window or, even better, make a run for the gun under the bed. The midget is very close though...you can just feel it.\n\nWhich is it?", "action_results": [null, null]}]}]}, {"action": "ask \"Who is it?\"", "result": "WHO IS IT? you ask...no one answers. You stare at the front door as if it would open on its own.\n\nBANG! BANG! BANG!\n\nLouder this time. What do you do...", "action_results": [{"action": "just open the door?", "result": "You are shaking in fear as you get up from the recliner and slowly walk over to the door and grab the knob. \"Please be there\"...\"Please be there\" you hear whispered from the other side.\n\nYou open the door to see Alice, your next door neighbor, crying and shaking at your doorstep.\n\n\"What happened?\" you ask.\n\n\"There is a crazy kid trying to kill me...I need help.\" Alice blurts out as she faints and falls forward.\n\nYou catch her and drag her into your living room.\n\nAs you go to close the door...something catches the corner of your eye. It is the shadow of a short figure slowly walking up your driveway!\n\nYou slam the door shut and bolt lock it.\n\n\"Great...you say to yourself...this midget psycho is after me and I don't even own a gun!!!\"\n\nWhat do you do?", "action_results": [{"action": "hide in the kitchen?", "result": "You run to the kitchen trying to find anything you could use as a weapon. Your brand new \"Ginzu\" butcher knife set gleams as bright as the idea bulb going off above your head. You grab the biggest one and hide behind the counter. Your heart pounds and its hard to control your breathing - trying not to give away your hiding spot.\n\nA terrible feeling of despair overwhelms you as you hear mumbling noises from the living room above the noise of the T.V. It's Alice calling your name. Suddenly you hear another noise of metal hitting wood and Alice screaming in terror!\n\nYou can't believe you left Alice lay there as the murdering midget starts to chop down the front door like Jack Nicholson in \"The Shining.\"\n\nWhat to do?", "action_results": [{"action": "come out of hiding and try to save Alice?", "result": "Your heart is still pounding with fear as you find the courage to run back into the living room to get Alice. Alice is laying on the floor and screaming in terror as the door is being demolished by the axe.\n\nWHACK! WHACK!...the door is barely holding on.\n\nA big hole at the middle of the door exposes the crazy mans sweat soaked face. He stops to look inside at both of you. Black strands of matted hair stick to his forehead as the glare of his yellow eyes stop you in your tracks. His lips pull back into an evil sneer and small, corn kernal sized teeth gleam in the light of the living room. Saliva is dripping from the sides of his wicked smile.\n\n\"HAA HAA HAAAAAA!!!!\" He begins to chop more furiously at the very weak barrier.\n\nYou grab Alice under the arm and help her to her feet. She screams to your touch but quickly realizes you've come to help her.\n\n\"Quick...run for the back door.\" you say.\n\nAlice stares at you and you realize she could be going into shock. She suddenly nods \"Yes\" and begins to run through the kitchen toward the back door.\n\nAt that very moment the door gives way to the furious blows and now nothing is standing between you and him. The madman's chest heaves deeply as he takes a step into the room, his eyes darting everywhere. Sweat is dripping from his chin and earlobes. His eyes begin to look tired as they rest on you. He takes a swing at you with his axe but is still too far to hit anything. He is obviously very tired from his battle with your front door.\n\n\"I wonder if he's ever heard of windows.\" you think.\n\nYou have an opportunity to end this night of terror right now. Or, you can take off the same way as Alice did.\n\nWhich is it??", "action_results": [{"action": "battle the midget?", "result": "You automatically look around the room for something to use as a weapon and suddenly remember the butcher knife you already clutch in your right hand.\n\nYou quickly raise the knife above your head triggering a response in the midget. He charges at you with all his fury, screaming at such a high pitch it almost sounds inhuman.\n\nThe quickness of the frothing figure catches you off guard, his body hitting you right below the belt and knocking you back into the dining area. You both come crashing down onto the dinner table with a horrible...\n\nTHUD!!!\n\nAs you and the madman crash through the table and onto the hard tile floor, the back of your head hits the tile and a twinge of pain travels all the way down your spine and into your legs. You momentarily black out.\n\nWhen you come to your senses everything seems blurry at first but quickly comes into view. You've already got a headache but that is the least of your fears. At your feet is the midget. He stands there with a wild eyed look on his face. No more smiling or laughing or screaming...just staring with axe held high. It's as if he is waiting for you to make your move.\n\nYou feel around the floor with your right arm for the knife but your fingers only come in contact with pieces of dinner table. That's when it happens...the axe comes down quickly, severing your right bicep and fracturing your right humerus...blood spurting from the wound and hitting the tile.\n\nScreaming in pain your left arm automatically comes over to cradle what's left of your right. Your screams are met with shrills and squeals of excitement from the midget. he starts to pace around your body, swinging the bloody axe at his side. Occasionally you feel drops of your own fresh blood hit your face and mouth. You feel faint and want to just give up the ghost...\n\nRREEEEERRRRRR REEEERRRR!!!! Flashes of red and blue surround the walls of the living room and flood the dining room and kitchen.\n\n\"This is the POLICE!!!\" \"We have you surrounded!\" \"Come out with your hands up!!\"\n\nThe midget stops at your feet, his head darting around the room, looking for a place to escape or hide.\n\nYou take the opportunity to bring your legs up to your chest rolling backwards, at the same time kicking as hard and as fast as you can.\n\nYou can't be sure where you hit the creature but you hear the axe clatter onto the tile floor.\n\nYou scramble to your feet and wheel about in time to spot the butcher knife laying by the back door.\n\nThe thoughts of escaping don't even enter your terror filled mind.\n\nWith knife in hand, you whirl around and run over to where the midget is getting to his knees. You come up behind him and put your blood soaked right arm around the neck of the little man and bring the large knife, in the left hand, up over your head and deep into the chest cavity of the midget.\n\nYou back away from the bloody mess and scream to the police for HELP!!!! The midget screams in pain...his childlike hands pawing at the blade running deep into him. He still tries to get to his feet but his legs wobble in fatigue. He falls onto his back and finally dies.\n\nYour arm begins to throb and you notice all the blood on the floor. You realize that your heart is pounding and you have lost a lot of blood. You start crying and...\n\nyou black out...", "action_results": [{"action": "do you live?", "result": "You awaken to red and blue flashing lights and the shrill sounds of a paramedic van. Three people surround your head...two you don't recognize but the other you know as your neighbor Alice. She is smiling down at you and you give a weak smile back. She bends down to kiss you on the forehead. The other two are paramedics inserting a needle into your arm. You are already on your way to the hospital's emergency room. The pain from your right arm is dull but still demands your semi-conscious attention. You figure you've been pumped full of morphine to ease the pain.\n\nTwo weeks later, Alice comes to meet you at your physical therapy session and is amazed at your recovery. Your arm is healing fast and the nightmares are starting to become few. You create a bond with Alice that only an experience of shared intensity can produce. You recieve high praises from the mayor and your community offers to repair your home at no cost to you. Your 15 minutes of fame has arrived as your picture is plastered onto the T.V screen, national magazines, and newspapers.\n\nAs for the midget...his body lies in a bag in the county morge. Two weeks ago, a large woman sporting a long, ZZ top like beard enters the room to identify the body as once known midget clown juggler \"Li'l Bob\" from the Bingham Brothers Circus, which was performing at the local fairgrounds. On that night Bob took a hit of methradone right before his axe juggling act and apparently went ballistic. He had everyone in the big top running for their lives.\n\nThe autopsy uncovers the drug he bought in the streets to have been 99% pure. The mind altering drug turned Bob from a cute juggling clown into a deranged killer...but you got him...you killed the murdering midget!\n\n~~THE END~~\n\nNOTE: YOU DID IT!! Way to go you midget butt kickin' hero you. You have mastered the game. Go back and check out the other crazy endings.", "action_results": []}, null]}, {"action": "run out the back door?", "result": "You bolt out the back door of the house screaming in fear. You imagine the crazed killer running right behind you and you let out a scream of terror.\n\nYou get to the alley and run to the end of your street. You stop to catch your breath when you spot a policeman talking to an elderly woman at the front gate of her home.\n\nYou startle both the old woman and the policeman as you blindlessly run up to them for help - the ginzu knife in your right hand.\n\nThe policeman, thinking you to be the maniac himself, quickly pulls his gun and fires six rounds into your chest.\n\nThe light of the street lamps are the last thing your eyes focus on before total blackness takes hold.\n\n~~THE END~~\n\nNOTE: Cowardly decisions make for bad endings in the world of killer midgets. Try again...", "action_results": []}]}, {"action": "stay in hiding?", "result": "In situations like this, cowardess can be a virtue.\n\nYou stay in hiding and hear the door give way to the madman's furious blows with the axe. Alice's screams of terror come to an abrupt stop... mid-scream as you can only imagine where the axe made its bloody entrance, severing her windpipe and exiting out the back...decapitating her.\n\nFeelings of fear mixed with anger overwhelm you and you get a rush of adrenaline.\n\nHow will you use this new found energy?", "action_results": [{"action": "surprise the midget and attack him with the butcher knife?", "result": "You quickly jump up from behind the counter ready to run into the livingroom and pounce on the little maniac...only the midget is not in the living room anymore. He stands at the entrance to the kitchen with Alice's head, twisted in a bloody mask of horror in one hand and the infamous axe in the other. He stares at you with his yellow eyes and begins to laugh uncontrollably, his eyes darting left and right and then right back at you.\n\nYou scream at the top of your lungs and run full throttle at the laughing madman knocking him off his feet and back into the living room.\n\nYou roll around the room in what could only be Alice's blood. The midget tries to bite you on the ear (Tyson's trick) but your elbow meets his chin with a hard thud!! You feel your energy start to fade as you begin to fatigue. You realize you still have the Ginzu in your right hand and roll on top of the midget coming down with both hands meeting the midget's chest with crazed determination.\n\nThe midget yells and you jump off his body and scoot back to a relatively safe distant corner of the living room.\n\nYou watch as the madman's chest begins to rise and fall in deep movements as blood pours out of the knife wound with every breath. His face contorting into expressions of anguish and pain.\n\nSoon it all ends and the midget is dead. Alice is dead. YOU survived the night the murdering midget visited your home on Headstone Lane.\n\nYou slowly stumble out of your house and sit on the front sidewalk to await the police. Ted and his wife from across the street come out to meet you and take you in for a hot shower and something to eat. It's over...Ted says to you...It's over.\n\n~~THE END~~\n\nNOTE: You have killed the murdering midget but you let your neighbor die. Way to come back from a cowardly decision. Good Job!!", "action_results": []}, null]}]}, {"action": "hide in the bedroom?", "result": "You run down the hallway and into your bedroom. You can hear loud thudding noises coming from the front door.\n\n\"The midget maniac must be chopping down the front door with his axe\" you think.\n\nYou frantically scan your bedroom...do you hide under the bed or in the closet?", "action_results": [{"action": "under the bed?", "result": "Under the bed you go.\n\nAs you lie there shaking in fear, you start to hear screams coming from the living room. It's Alice! You've left her there to fall victim to the murdering midget!!!\n\nAlice!!!...Back here!!\n\nYou scream for her to come back to where you are. The pitter patter of quickly running feet are heard as Alice runs down the hall and enters the bedroom.\n\n\"Under the bed.\" you whisper.\n\n\"Are you crazy?\" Alice yells back. \"If he catches us under there...we both die!!\"\n\n\"She's got a point.\" you think. You scurry out from under the bed.\n\nThe house suddenly grows quiet. The hacking on the front door has stopped and all that is heard is the faint sound of the television.\n\nSuddenly, Alice picks up the digital alarm clock from off your night stand and hurls it at the bedroom window.\n\nSMASH!!!\n\n\"We have got to get out of here!\" she says.\n\nAlice runs over to the broken window and starts clearing out any shards of glass still protuding from the window sill.\n\nYou stand watch in the middle of the room with your eyes fixated on the doorway to the bedroom.\n\nAlice is already halfway out the window to the outside when the maniac turns from down the hall and slowly enters the bedroom. He stares at you with sweat pouring from his black matted hair, down his face, and dripping off of his chin. His chest heaving deeply from his recent battle with your front door. His eyes dart past you and focus on Alice climbing out the window.\n\nAlice screams as her pant leg gets caught on an unseen shard of glass.\n\n\"She's stuck!!\" you think. \"Is this maniac just going to waltz in and finally kill her?\"\n\nYou want to move but you seem frozen like a deer in the glaring eyes of the murdering midget.\n\nAs the midget slowly circles around you, he begins to cackle a laugh that seems to fill the whole house.\n\nYou suddenly snap out of whatever trance you were in. The midget seems to be unarmed. If you tackle him now- Alice might have a chance to break free and get away.\n\nWhat do you do??", "action_results": [{"action": "tackle the midget?", "result": "Without thinking you run directly at the midget. Your head connects with something hard and your vision becomes blurry. You look around the room but can't make anything out. It's too dark. You stagger about, looking for the light switch and swinging your arms out in front of you.\n\nTripping over something, you hit your head hard against the wall. Your body slumps to the floor and...you black out.\n\nYou can't breath...\n\nYou awaken to a horrible sight. You are still in your bedroom and the midget is laughing and jumping on your bed. He crouches at the edge of the bed and stares down at you. Your head is throbbing with pain and your vision still seems a little blurry.\n\nWith one quick thrust the midget leaps forward. He lands feet first, on your stomach.\n\nYou try to yell, but there's no breath in your lungs. You make a desperate attempt to roll over, but small as this creature seems to be, he is much too heavy. You can't move while he stands on top of you.\n\nHe leans forward, stares down at your face and says with low gutteral growl... \"Your angel of death awaits you.\"\n\nThe creature's sweat drips off his head and down your throat. He squats low, suddenly snarls, lowers his head and opens his mouth.\n\nOnly then do you see that he has long, razor sharp fangs. You tremble all over as that wicked mouth moves closer. You stare at the face and suddenly it changes!\n\nThe matted black hair becomes long and curly. The face of a beautiful young woman takes the place of the midget's hideous mug. It's Alice!!!\n\n\"Are you OK?...Honey, wake up.\" Alice says with a worried look on her face.\n\nYou bolt straight up into a sitting position and look around. You are in your own bed with Alice...your wife. She sits beside you in her red night gown.\n\n\"You were screaming in your sleep again.\" she says.\n\nYou calm down as reality all comes back to you.\n\nYou are a comic book writer working on a horror story in graphic novel form. Its about a midget clown that goes on a drug crazed frenzy, escapes the circus and kills lots of people.\n\n\"Must be the story I'm working on.\" you tell Alice.\n\nShe kisses you on the cheek and tells you to get some rest. You let out a sigh of relief and settle back into bed.\n\n\"Good night baby.\" you whisper to her.\n\n\"Good night.\" she replies as she turns out the light.\n\n~~THE END~~\n\nNOTE: Good Work. You survived the Murdering Midget...as if there ever really was one.", "action_results": []}, {"action": "run down the hall and make for the back door?", "result": "\"I've got to get out of here!\" you think.\n\nLeaving Alice in the hands of the midget, you run down the hall toward the back door of the house. Alice calls for you and is stunned by your actions just to leave her there.\n\nAs you get to the alley, you hear screaming followed by...\n\nBLAM BLAM BLAM!!!\n\nYou stop running and wonder where the gunshots came from. You wonder if you should run back to the house or keep running down the alley and away from all this madness.\n\nThree possibilities quickly come to mind.", "action_results": [{"action": "go back to the house?", "result": "You wait a few minutes contemplating your decision to go back to the house. You take your time going back and are welcomed by two police officers standing in your kitchen. They escort you to your living room. Alice and Tom, your nieghbor from across the street, are sitting with bewildered looks on their faces.\n\nAlice looks up at you in disgust as you enter the room and sit down in your recliner. Apparently Tom was watching what was going on from across the street and had his son track down a police officer. He watched you flee the room and thought he better think fast.\n\nGetting his Colt .45 pistol from out of the hiding place in his garage, he ran over to where Alice was being dragged back into the house, leaned into the window, and emptied 3 rounds into the midgets head.\n\nJust then, the body of the midget rolls past you on a stretcher and into the coroner's van, a blanket over the body and what's left of his head.\n\nAfter having to recite your cowardly story, the police give you a shameful look and everyone leaves you to repair your broken home.\n\n\"There is plenty of brain fragment and midget blood to clean up in your room.\" Alice says to you sarcastically.\n\n\"Better get busy before it dries.\"\n\nYUCK!!\n\n~~THE END~~\n\nNOTE: Hooray!!!! The midget is dead! Thank heavens for GOOD neighbors in the area...you coward!!!", "action_results": []}, {"action": "run to a neighbors for help?", "result": "Only two homes seem to have lights on from their back yard. 1.) Old Man Smithers or 2.) The Robinson Family.\n\nMr. Smithers' dog barks frantically at you as you stand by his back alley fence. To get his help, you will have to get past his dog. You can't remember what kind of dog it is but by the sounds of the barking, it has got to be fairly big.\n\nThe Robinson Family has always been such nice neighbors. You have been over on a couple of occasions for BBQ's and know they don't have a dog.\n\nWell, which is it.", "action_results": [{"action": "Old Man Smithers?", "result": "Finding the gate latch unlocked, you race for Mr. Smither's back door. The dog jumps at you from behind and attempts to bite you on the thigh before being tugged back by it's leash tied around a tree.\n\nYou bang on the back door for what seems like hours. Smithers never comes to the door. You get tired of the yap yap yapping of the dog and go back out the way you came.\n\nYou have no choice but to try the Robinson's home.", "action_results": [{"action": "try the Robinson's home.", "result": "Finding the gate latch locked, you try to scale their brick wall by hopping on top of the trash cans. Just as you throw one leg over the top of the wall, the lights to the back yard flick on and Nancy, the youngest of their five children screams and points in your direction.\n\nThinking you to be the crazy maniac they have been hearing about all over the t.v. and radio, Mr. Robinson runs out with a shotgun, points it in your direction and in his heightened paranoia...\n\nBLAM!!!\n\n~~THE END~~\n\nNOTE: Welcome to Mr. Robinson's neighborhood. Won't you be his neighbor? I guess we'll never know what happened to Alice...hmmmm.", "action_results": []}]}, null]}, {"action": "climb in a trash can?", "result": "The trash cans are large enough for you to hide in and you crawl in one and close the lid over you.\n\nThe stench of rotten food and diapers invade your senses and you start to have second thoughts about this idea.\n\nIt takes a couple of minutes but you begin to get used to the smell. Now you are able to relax for the first time since the whole ordeal started.\n\nYou fall asleep using a garbage bag filled with shredded paper and left over meatloaf as a pillow.\n\nZZZZZZZzzzzzzzzzz....\n\nYou are suddenly awaken by movement. You push open the lid just enough to peek out.\n\nIt's day time and the trash man is in the process of picking up the garbage you are hiding in!! You attempt to scream out for the truck to stop but the sounds of the hydrolic lift over ride your screams.\n\nBefore you know it, you are on your way to the city dump.\n\nHow embarrassing is that?\n\n~~THE END~~\n\nNOTE: Talk about a dumpy ending. eh he he. By the way, what ever happened to Alice? hmmmm.", "action_results": []}]}]}, {"action": "in the closet?", "result": "The pitch blackness of the closet is not comforting but you dare not turn on the light and give away your position. you can faintly hear the thudding noises of the front door as the midget furiously uses his axe to chop it down.\n\nIt is at this time you realize that Alice is still laying in the living room and unconscious. You feel the need to help her but are frozen in fear as you try to come out of hiding.\n\nBeeep! Beeep! Beeep!\n\nIt's your phone by the bed ringing. Someone is trying to call you. Who could it be?\n\nAlice is screaming now...screaming your name...\n\n\"Where are you?!!!\" \"Please help!!\" \"AAAAAAHHHH!!!\"\n\nThe chopping has stopped and so has Alice's screams for help. All you can hear now is the faint sound of the t.v. and then...Beeep! Beeep! Beeep!\n\nWhat do you do?", "action_results": [{"action": "run for the phone?", "result": "You dash across the room, grab the phone, and run back into the closet. You are so glad you opted to buy the more expensive cordless phone at Wal-mart last month than settling for the $10 cheapy with a cord.\n\n\"Hello?\"\n\n\"Honey...are you alright?\" \" We heard what happened on the news!\"\n\nIts your Mom!! You relate the current affairs of the evening up to the moment in a very soft whisper. Your mother gasps and then there is silence...\n\n\"Son...get the hell out of the house NOW!\" Your Dad is on the phone now.\n\n\"Try to make it to a neighbors house or your car.\" \" GO NOW!!!\"\n\nYou check your pants pockets and find the keys still on you.\n\nWithout thinking you jump out of the closet and take a quick look out the bedroom door and down the hallway.\n\nYou spot the midget standing over the body of what used to be your neighbor Alice. Her head severed a few inches from the twitching body...blood pooling from her neck, covering your living room carpet.\n\nYou open your mouth in horror and attempt to let out a scream but all that manages to come forth is a squeak.\n\nThe midget turns his face down the hall and spots you halfway in and halfway out your bedroom doorway. The thin lips of his mouth draw back to expose two small narrow rows of teeth.\n\nHe begins to laugh as he draws back his axe and throws it down the hall just missing your head and meeting the wall behind you.\n\nYou pull the axe from the wall keeping your eye on the little man down the hall. He just stands there laughing at you...as if he is challenging you to a fight. He begins to motion you over...his eyes never leaving yours.\n\nYou can try to attack the midget with his own axe or make a dash for the bedroom window.\n\nWhat will it be?", "action_results": [{"action": "attack the midget with his own axe?", "result": "With axe in hand, you run down the hall and straight at the midget. Just as you are ready to use the axe on him, he darts to the left and races back out the front door of the house. You stumble over Alice's body and land face first back into your \"Lazy Boy\" recliner.\n\n\"HAAAHAaaaaaa!!!!\" you hear coming from just outside your house. \"Come and get me you @#%$!*%!!!\" the midget screams at you.\n\nPushing yourself from the recliner and mad as hell...you race out the front door swinging the axe over your head. What you see out in your front yard stops you dead in your tracks.\n\nYour front porch light illuminates the silhouette of the midget standing next to a much larger creature. A creature not of this world. A long red tongue protrudes from it's vile mouth exposing large, razor sharp teeth. The tongue quickly moves out towards the smiling midget, sliding over his face and then \"SWACK\"-like a bullwhip, wraps around the midgets neck snapping it in two, right before your eyes. The midgets body flops around like a rag doll as the monster begins to devour it, the teeth becoming dark red with the midget's blood.\n\n\"You have been chosen to find my next meal!\" you hear bellowing inside your brain.\n\n\"Is this the creature?\" you think to yourself.\n\n\"Of course this is!!!!!!!!!!\" the creature screams telepathically into your mind.\n\nYou drop the axe and cradle your head in both hands. It's as if a bomb has gone off in your brain giving you excruciating pain.\n\n\"I am always hungry and I won't let you rest until I get it!!!\"\n\n\n\"I know I should'nt have picked the little guy but I was desparate and hungry. \"You see...my ship crash landed outside your town and...well...the lights and the sounds of the local carnival were too good to pass up.\"\n\n\"What a little funny guy he was...but not much of a meal though.\" the creature states.\n\n\"Get busy and find me my next meal.\" \"I'm in the mood for an obese female humanoid for my main course...get to work.\"\n\nThe creature pushes you aside, walks into your house and flops into your recliner using the remote control to turn the channel of the television.\n\n\"I hate horror flicks.\" it says.\n\nIt turns and picks up Alice's head, by her hair, off of the blood soaked floor and brings it close to it's pig like snout. It's large mouth opens and the infamous tongue slowly rolls back out, wrapping around the head. With a flex of its muscular tongue a CRUNCH is heard as Alice's skull shatters from the pressure.\n\nWHOOP!!.. GULP!! The creature swallows the head whole.\n\n\n\"Bye the way, there is no escape.\" \"I will not let you sleep, eat, or even breathe until you either go insane or find me a meal.\" \"Unfortunately...BOTH happened to little circus clown...he he he.\" \"At least he juggled chainsaws for me when I got bored.\" \"What can you do!\"\n\n\"uhhhhhh...play chopsticks?\" you think.\n\nRAAAAAAAAAAA!!!!!!!!!\n\n\"Well, time to go \"Fat Lady huntin'\" you think.\n\nYou know that when you find that unfortunate soul...YOU will be it's next meal.\n\n~~THE END~~\n\nNOTE: You've reached the Twilight Zone ending...wierd huh?", "action_results": [null]}, null]}, null]}]}]}, null]}]}