{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=45288", "context": "", "first_story_block": "So it was the sixth of December.\n\n\nEveryone was together all warm and better.\n\n\nHouse after house, the blight now gone.\n\n\nNot a worry in sight, celebrations would dawn.\n\n\nThe town resting easy, sleeping without a cry.\n\n\nNow that the vermin had gone and died.\n\n\n \n\nOutside in the cold the nooses are full.\n\n\n Full of the dead.\n\n\nBirds slowly feasting on their heads.", "action_results": [{"action": "Homes", "result": "The town was in a forest. So pretty and green as if it home to florists.\n\n\nLife was rampant in the evergreen trees. Even though men were hung by their knees.\n\n\nA smack to the face with a bat they would receive. A drop of blood and noise would then cease.\n\n\nJust a simple crack and their world would go black.\n\n\nThe towns people danced and laughed, with the weights now off their backs.\n\n\nThe mass graves were full, all of the filth now buried under snow.", "action_results": [{"action": "Hang", "result": "The man is connected to the rope. \"You animals, Let me go!\"\n\n\nThey jeered at his fear, throwing rocks and shouting cheers. Up the body went, the neck snapping like a pulled thread.\n\n\nTo the mass grave it went, the people dancing over the buried dead.\n\n\nA death a day kept the vermin at bay.\n\n\nThe kids were taught to seek them out.\n\n\nNever to have a single doubt.", "action_results": [{"action": "Broken glass", "result": "Broken glass of broken homes.\n\n\nIn they went and out someone goes.\n\n\nPulled down the street hand by hand. \n\n\nKnees cracked so they couldn't stand.\n\n\nKilled before dawn, buried before mass.\n\n\nNothing left but broken glass.\n\n\n\"Keep calm, find the vermin.\"\n\n\nThe first ones were hermits and the homeless.", "action_results": [{"action": "Purity", "result": "The town was pure the priest would say.\n\n\nA heaven on earth where all could stay.\n\n\nIf you were good you had a home. If you were bad you had the rope.\n\n\nFollow the rules and you would live. sinners and vermin would have no forgiveness.", "action_results": [{"action": "Tears", "result": "Salty tears, salty tears.\n\n\nFear is rampant and trouble is near.\n\n\nIt can't be avoided, just to make that clear.\n\n\nNo amount of blades and gear will stop the sheer amount of angry faces wanting their blade on your ear.", "action_results": [{"action": "Screams", "result": "Sometimes people thought they were safe.\n\n\nReading books in front of a fireplace.\n\n\nGrandpa asleep snoring some more.\n\n\nShouts are heard outside the door.\n\n\n\"Come out scum, face your death!\"\n\n\nThe family confused, no one answering the door.\n\n\nStones and bricks fly through the window.\n\n\nIn they come to make her a widow.\n\n\nThis process never stops and the people never sleep.\n\n\nMore to die, less to weep.", "action_results": []}]}, {"action": "Pride", "result": "Vermin would walk to the gallows alone.\n\n\nSurrounded by townspeople throwing stones with angered tones.\n\n\nThough he would not look and he would not speak, head held high even with things so bleak.\n\n\nThe rope fitting nicely around his neck, everyone screaming for him to be dead.\n\n\nBut before the executioner pulled the lever.\n\n\nThe man said something quite so clever.\n\n\n\"For those who watch my grim demise, know that you will be next when the time is right.\"\n\n\nA smile of peace on his face.\n\n\nThen the legs go limp and all is finished.", "action_results": [{"action": "What once was", "result": "What once was is a fairy tale at best.\n\n\nA scapegoat was needed and the vermin were laid to rest.\n\n\nYears before without remembrance, plenty were killed and more where exterminated.\n\n\nSo as the story goes, there will be no end as time continues to flow.\n\n\nDon't be sad, this was meant to be.\n\n\nJust be silent and you'll have peace.", "action_results": []}]}]}]}, {"action": "Shadows of the night", "result": "So they say only the vermin died.\n\n\nBut most thought that it may have been a lie.\n\n\nIn the night someone would go.\n\n\nNo execution, no public show.\n\n\nQuestions were asked and the official would say.\n\n\n\"It was the vermin, more cleansing for today.\" \n\n\nSo that was the solution and more would die.\n\n\nYet more disappeared throughout the night.", "action_results": [{"action": "Run", "result": "Some would talk.\n\n\nSome would sway.\n\n\n\"We'll leave at night, already gone by day.\"\n\n\nSo they would leave.\n\n\nPeople would talk.\n\n\n\"They were taken by the vermin!\"\n\n\nHunts would start.", "action_results": [{"action": "Old days", "result": "No one can remember the olden days.\n\n\nWhen the town started from simple bricks and clay.\n\n\nThe official merely would say.\n\n\n\"Look to the future, push the past away.\"\n\n\nIt was maybe because of this that the vermin were hunted.\n\n\nTo keep the future safe and order well balanced.", "action_results": [{"action": "Order", "result": "Though many would die.\n\n\nIt was law, it was right.\n\n\nNo shame would be felt by the hunters at night.\n\n\nWhen they slit the throat of those too weak to fight.\n\n\nNo one was spared.\n\n\nKeep that in mind, and be prepared.\n\n\nFor the day will come, when it's your turn for the noose.\n\n\nYour soul finally able to run loose.", "action_results": [{"action": "Pax Romana", "result": "\"Will there ever be peace?\"\n\n\n\"Kill the vermin and then we'll see.\"\n\n\n\"Serve our town and protect those in need.\"\n\n\n\"Then we can rebuild and hostilities will cease.\"\n\n\nThis was asked years ago.\n\n\nThe man who asked long ago meeting the rope.\n\n\nKeep quiet and maybe you'll live.\n\n\nBut those with freedom in their hearts run thin every minute.", "action_results": []}]}, {"action": "Anarchy", "result": "The official would say that there were laws in place.\n\n\nBut everyone knew that just wasn't the case.\n\n\n\"You can't hunt alone.\" He would say.\n\n\nA throat slit without the blade or whom slayed.\n\n\nGuns though would be kept in place. But the blades roamed free tasting blood each day.", "action_results": [{"action": "Abyss", "result": "You had to understand the nature of the town.\n\n\nThose who came before and those who were here now.\n\n\nLong ago written in burned books.\n\n\nRuled a man who would try the best he could.\n\n\nHe let criminals run free and made punishments light. For he thought people could be forgiven without making it into a fight.\n\n\nNo one knows what came after that but now the vermin are hunted and we'll just leave it at that.", "action_results": []}]}]}, {"action": "Future", "result": "\"Look to the future my children, all will be okay!\"\n\n\nSaid the priest who was convicted of treachery yesterday.\n\n\nLucky he was to have a actual trial.\n\n\nUnlucky he was to be burned by fire.\n\n\nThe jury was harsh and judge harsher.\n\n\nHow could a pure man turn so vile?\n\n\nThe eyes on his face that fateful day.\n\n\nWhen he realized what he had taught and what he would say.\n\n\n\"This town needs to be burned.\" He whispered as the executioner lit the torch.", "action_results": [{"action": "Purge", "result": "No one knew how it happened.\n\n\nThe priests were slaughtered and the church lit on fire.\n\n\nWas it the rebels?\n\n\nWas it the officials?\n\n\nNo one knew.\n\n\nJust another casualty of war, nothing new.", "action_results": []}]}]}, {"action": "Rebel", "result": "You knew if you were vermin.\n\n\n They knew if you were vermin.\n\n\nIt was kill or be killed, so they took up weapons.\n\n\nMuskets and swords, bullets and blades. The rebels killed some, but were eventually laid to waste.\n\n\nMore bodies dumped, and then some.\n\n\nEverything was back to normal, what a beautiful day.", "action_results": [{"action": "Grow", "result": "\"Don't give up, we can still win.\"\n\n\nSaid the leader who hanged yesterday, buried with the others.\n\n\nLies said to comfort the doomed.\n\n\nwho are already filled with gloom.\n\n\nThough there was a sweetness to death, a chance to escape what is already so futile.\n\n\nOnly wish for their death not to be brutal.\n\n\nIt was maybe because of this that bodies were found in the lake.\n\n\nA peaceful smile never again to wake.", "action_results": [{"action": "\"I promise.\"", "result": "\"I promise to fight, for things will change.\"\n\n\n\"Until the day that things will stop being the same.\"\n\n\n\"For we live to be free, no matter our breed and creed.\"\n\n\n \n\n\"Scars won't stop us and rope won't make us sway.\"\n\n\n\"From this day I am vermin, I am prey.\"", "action_results": []}, {"action": "\"I yield.\"", "result": "\"I know when to stop, I know when to die.\"\n\n\n\"This just wasn't my fight, many fell that fateful night.\"\n\n\n\"I pity you all who have to live in fear, for you will be next. You're time is near.\n\n\n\"Perhaps it would have been best to leave with the others but I can't just abandon my brothers.\"\n\n\n\"I will not cry and I will not fight. My time is over and it's time to die.\"\n\n\n\"My story is over and it made me proud.\"\n\n\n\"I am vermin and I say this out loud.\"\n\n\n ", "action_results": []}]}]}]}]}]}]}