{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=64451", "context": "", "first_story_block": "You're on the way to Grandpa Paul's house, to help him move out because you're a good grandson. And he volunteered to pay you fifty bucks to move around some boxes that probably aren't even heavy. You're actually a little surprised he called you, given how aloof he is about family. He'll chime in every couple years or so to meet back up with everyone, exchange gifts, and give that goofy smile that everyone finds endearing. Otherwise, it's radio silence. Paul is a good person, though, and his ailing health probably has something to do with the spotty record for attendance.\n\n\nYou grab a jacket, lock the door, and leave the apartment. You're not going to turn down a little cash in a world where rent goes up and pay stays flat. Paul won't need it much anyway, since he's going into retirement. You get in the vehicle, start the engine, and drive out of the outskirt suburbs, following rural roads to a turn. The car roves over grass and dirt, coming to a quick stop at an unassuming wood-beam house. There's a ladder propped against it, upon which a lanky figure stands, throwing powder on the roof that thwarts moss. He smiles at you, that same goofy smile, then finishes the chore before climbing down to say hi.\n\n\n“Is that you, Stanley?” He walks up to take better measure. “It's so good of you to come. I knew you would, for the money if nothing else!” He gives a wry grin and chuckles you through the door. You tell him how you've been, and make small talk about the pumpkins outside. It's hard to think he'll have a lot of kids at the door on Halloween tonight, especially with everything boxed up against windows. Of course, with your insatiable sweet tooth and the candy he waves at you, that's not something you feel like pointing out. He scoots you through the house, past a room brimming with yarn — relics of his late wife — to a hallway claimed by heavy boxes of derelict hobbies. Everything from wood plane kits to soldering tools fills them, and you really wish he didn't have all these fleeting interests, since it would make the move a lot easier.\n\n\n“Why don't you sell some of this clutter? I know you don't need it.”\n\n\n“I can't find a lot of time”, he replies. “I'm cataloging my sponge collection because I've got a pitch from a museum.”", "action_results": [{"action": "“Sounds as interesting as waiting for toast, Paul.”", "result": "“Well it's not for everyone,” he admonishes. He goes on to describe his collection and the museum offer, which seems like little more than an acquisition by some eccentric. “I'm moving on to other collections,” he says, “sponges are really getting too popular now.” You don't ask more about it, but you're punished with additional details any time you stop moving.\n\n\nThe boxes in the hallway only serve to make the actual work harder. You've got three rooms overflowing with junk, which needs to be sorted, packed, and hoisted out of the way. Paul hovers around since he suddenly has nothing better to do, inventing all manner of new categories for these nick-knacks you couldn't possible surmise the need to keep. With all of his advice, the process goes well past the couple hours you were hoping for. You ask if you should come back another time, but he waves off the suggestion. He's engrossed in pouring over everything he forgot about, much to your dismay.\n\n\nHe turns the porch light off as the sky dims to night. Paul converts you into a candy funnel, fully exploiting the extent to which you like sugar. Eventually, you tell him you've had enough, and he says something about gaining weight if he were to eat all the candy.\n\n\nYou reach the third and last room, adorned with sets of bowling pins and an enormous collection of camping paraphernalia, among other things. You make some room on a relatively clean patch of letters for the first box when you see a curious pair of statues on a wall-mounted shelf. On the left is a knight in plate armor holding a longsword, tip down. Opposite of it is a hunched, faceless ghoul with balled fists and a flowing robe. They would've already been swept away, but the pewter statues both seem to have purple-tinted shadows. How is that possible? You reach to examine one of them.", "action_results": [{"action": "Move the knight", "result": "The knight stands prominently, a little larger than the ghoul, and it's closest to your hand. You pick it up; the room suddenly chills. Then, there is a coursing coldness in your body, without origin. It ends as quick as your next inhalation, and the air returns to a stable temperature. Your only guess is that you ate way too much candy. The statues are collected into a pile, along with other baubles, and you finish the job about an hour later.\n\n\n“Thanks, Stanley. You really saved me a lot of back pain. You've definitely earned the money,” he says.\n\n\n“Sure thing, Paul. I'm going to take off. Let me know how the sponge sale goes.”\n\n\n“In the dark at eleven? You're more than welcome to stay, really!”\n\n\n“Thanks for the offer, but I have other matters to attend to,” you say.\n\n\nHe offers a meek shrug and a hearty wave goodbye. You get back in your car, happy to breathe in some dust-free air. It's an hour-long drive home, but it's Halloween, and you want to go somewhere. A headache starts at your temple. You decide you can figure it out on the way. You turn the key, shift the car into gear and merge onto the freeway. A half hour goes by; the headache stops. Despite the time and the hypnotically-spaced street lamps, you're wide awake. In fact, you've decided exactly where you want to go.", "action_results": [{"action": "Drive", "result": "You ride another ten minutes on the highway before taking an exit to a forest service road. Gravel kicks up from beneath the tires, rapping against the metal underside. Fifteen minutes in, you silence the motor and step out of the vehicle. A small picket at the head of the trail reads \"Sorry Falls 5.4 mi\" under the moonlight. The trail is a jagged path of dirt cutting through the dying underbrush, and carpeted in leaves. You begin trudging along, passing by barren trees. The air is frosty under the pellucid sky. Animal trails weave across both sides of the path — the wildlife still has a presence. You stop at a point where tree roots knot across the surface, around four miles in. You're getting closer, but you won't find her here.\n\n\nYou feel the pressure of a headache as Stanley's mind kicks with the realization of what's going on; that you have taken ahold of his body. It's a harmless protest. You look at the moon, the timeless observer, who watches from its remote perch in the sky. It saw the old men kill the witches. It witnessed the fading of magic from the world, long ago. But, here in this time, the soil yearns for the return of magic. You have tonight alone to find the crypt.\n\n\nAnimal paths run like scars through the brush. Moonlight dances across groups of withered leaves, highlighting a particular patch on a hill to the right. Perhaps it's an omen.", "action_results": [{"action": "Continue on the designated trail", "result": "You continue up the path, and the dull echoes of Sorry Falls fade into earshot. The path turns, winding up to a lookout halfway down the falls. Water slips over the rim of the rock, separating into shallow rivulets, which divide further into beads before they hit the pool at the bottom. It looks vaguely like one of the waterfalls in your old memories. You jump blatantly off trail, running up the hill to your left that will take you around the falls. You should be able to ford them further upstream; it's not a deep river by any means. Half an hour later, you reach the other side. Your pants are soaked and your legs are stiff with the water's chill. You stop and dry yourself, pondering where you should be going from here. You're a little off course, so you'll need to run in the direction of the water for quite a while. That should take you down to the river, perpendicular to the falls, that it channels into.\n\n\nWith dry pants, you follow the stream downhill. The thickets pick up as you go, and you find yourself beating you way through them from time to time. Still, you push faithfully onwards through the undergrowth, reaching the river you recall. Something pushes at your mind. It's Stanley, inquiring about what's going on. He's given up on fighting, so there's no reason not to let him know what you're trying to accomplish.\n\n\nThere was a lady named Farra. She was one of the last true mystics that you know lived; she was one of the seers, fortune-makers and earth-brewers fatally punished for the crimes of witches. All practitioners were persecuted in the old days, undifferentiated. It's the cruel ones that are celebrated and remembered in the caricatures of Halloween decor tonight. The world is ready to see the light of the true mystics again, for the role of mankind in the play of worldly events is a lonely role indeed. Their heavy industrialization in the last few centuries marked a permanent departure from the old ways, and the seed must be resown before it's lost forever. These are not the instructions of a prophecy, you relay. They fall from a deep understanding of The Forms — the ways of nature itself.\n\n\nHe quiets down to consider the potency of those thoughts. You glance up and downstream, trying to recollect where you're supposed to go. Upstream seems the most likely. You walk along the stream for another hour, listening to the water playing at the edges of the bank, gurgling in eddies and slipping past itself in a muted rush. There is something eternally relaxing about such things. This is why the world must see the return of the mystics, and perhaps with them, the return of magic.\n\n\nStanley notices you've let your guard down.", "action_results": [{"action": "Fight for control over the body", "result": "A headache sharply forms as Stanley strains to repossess the body. Caught entirely by surprise, you can't pin his conscience in time...you're extracted, materializing as an ethereal wisp, circling madly. His mind is steeled to you, now. There will be no way in, so you rush off in the hopes of finding another vessel.\n\n\nYou're free of it, back in control of your own body. You test out your legs, blink and steal a few lungfuls of air. Your legs are throbbing with the shallow pain of oncoming soreness. You walk downstream for hours until you hear the dull roar of a highway, and continue onwards to it. You're close, but far too tired to make it all the way, so you pick a particularly comfy ditch and take a long nap. Still entirely yourself, you wake up, and spend the next half of the day navigating back to your car. You don't know exactly what to make of all this. The ghost certainly wanted full control over you for its incomprehensible quest; at the same time, you had an undeniable supernatural experience. How much of its rambling could be true? As you slot the key into the driver's side door, you can only imagine you'll be wearing a tin foil hat next year.", "action_results": []}, {"action": "Abide the possession", "result": "Stanley does nothing, and you don't notice.You reach a tight bend in the stream that sparks your memory. From here, Farra's grave must be a few hours to the left. You depart from the river banks, blazing directly into the forest. It isn't an easygoing hike, and it becomes clear that Stanley's body suffers from a lack of regular exercise. You find yourself breathing heavily, and often stopping to recover along the route. It's well after midnight, so you'll only have a few hours left. Stanley offers the thought of checking the phone for the current time. It's clear he's decided to accept your temporary inhabitance. You convey thanks. The phone indicates that you have about four hours to find the site. However, you're beginning to have problems doing so. Your memories are old, and few things remain in their places after a few centuries. Signs are scarce. You're forced to keep going until you, hopefully, run across a surviving landmark and get your bearings.\n\n\nMore hours of trudging through underbrush pass, and your body has switched over to a mixture of reserve energy and adrenaline. At this rate, you think, you'll be passing out just as the sun rises. Only minutes after that thought, you happen upon a clearing. Massive boulders lay strewn about, instantly matching memories; it would appear you're close. The grass grows unbridled here, with the longest blades threatening to reach your shoulders, and regular clusters up to knee height. Moonlight dapples the primal scene, and you can see short foliage in front of you, all beginning to curl at different points along their length, to differing degrees. You breathe in relief. Those are the ferns, the same ferns, that were here a millenium ago. You wade to them through the sea of grass, and the ground transitions to a mixture of trees, with ferns to fill the spaces between. You comb through them, searching for evidence of a grave.\n\n\nYou're leaning with fatigue by the time you find it, buried, hidden beneath the plants as though protected. Little round rocks, separated many feet apart by cycles of growth and decay, freeze and thaw. You remember these, taken from the forest around you 1,000 years ago, and stacked around the headstone that's no longer here. Probably for the best, you think, that there are no workings of man here at all.\n\n\nThe stones are gathered, gently, and arranged into three circles: one for The Observer, who hovers above even now; one for The Forms, which includes all aspects of nature; and one for The Provider, who will compete for the sky only hours from now. You build them around the ferns, and the work is done. There is no further reason to be here, and the end of the night marks your departure. You part from the body, flying in an astral path to the moon, who will shutter you to the Otherside. Stanley collapses to the ground from overwhelming weariness.\n\n\nSunlight wakes you around midday. You touch your head, blink, and shuffle around. He's gone, and you're back in control. You can't help but shiver as you recall last night. That possession shattered so many things you thought were true about the world. You look at the sky, and The Provider beams down at you. You head off to the stream, and follow it back until you hear the roar of the highway.", "action_results": []}]}, {"action": "Follow the animal path", "result": "You step off the manicured road and into the brush, sweeping spiderwebs as you move along the small path. A wintry gust riles branches into motion as the trail takes you on a curve over a steepening hill. You're forced to make switchbacks down to safely resume along the path below. Reaching the bottom of a small gully, you see a quiet stream. The animal trail ends at the river. Memories of how the land used to look come to you, and after a moment, you get your bearings. Her grave is upstream.\n\n\nShe was Farra, the last true mystic that you know lived; she was one of the seers, fortune-makers and earth-brewers fatally punished for the crimes of witches. All practitioners were persecuted in the old days, undifferentiated. It's the cruel ones that are celebrated and remembered in the caricatures of Halloween decor tonight.\n\n\nAlong the way, you see a black silhouette against the trees, opposite of the bank. It lumbers towards you as you walk upstream — a large bear. Your hands reach for imaginary weapons at your waist, but you're not in your own body, and Stanley has nothing convenient for defense. A pressure in your head reminds you that he is still in there. All he has to offer is fear, and the desire to run. You're also considering spooking it off.", "action_results": [{"action": "Yell at the bear", "result": "Making yourself as tall as possible, you call at the bear. It lowers its head, staring at you across the distance, and stands resolutely still. You're not sure exactly how to follow up. You could make a careful retreat, hoping you'll find the gravesite without the aid of the river. Or, you could walk towards it, yelling aggressively, in an attempt to scare it away.", "action_results": [{"action": "Avoid the bear", "result": "Walking away might just be announcing your presence. Walking forward could be a threat. It's a gamble, but you'll take the safest bet possible. You start backing up and strafing to the tree line, ensuring your chest and eyes are always facing the bear. Your left foot lands on leaves, and you've made it to the trees. You probe blindly with your foot leading you uphill, watching all the while. Trees slowly begin to obscure your view, crowding in until there's no threat in sight. You sigh in relief. You'll have to give it a wide berth if you don't want to risk another encounter.\n\n\nAfter a good hour of flattening bramble, you get on a long groove heading in the same direction. The trek is difficult on the body, which you figure isn't conditioned for much more than walking around the house on a regular basis. You find the stream again, confident that the bear is long behind you. Walking the graveled shore, you try to remember where to go.\n\n\nThere should be ferns...ferns, curled on end, growing in irregular circles. Nearby would be a headstone, if human activity hasn't ground it to dust. There never was a body beneath that grave; it was built as a tribute from those that knew her. It's only by the moon's influence, or forces stirring beneath the sandcastles of man, that this whole area remains untouched by concrete and steel. The stream, which in your time was a river, must be followed for a few more hours.\n\n\nIt's not an easygoing hike. You stop to recover your breath at many points along the route. It's well after midnight, so you'll only have a few hours left. Stanley senses the question and, no longer fighting, pushes forth ideas about checking the phone. Either he gave up, he's biding time before the next tantrum, or he's accepted that you're in charge. The screen indicates that you have four hours to find the site. However, you're beginning to have problems doing so. The trees are different, right down to their species. Nothing matches up with your antique memories. In the vegetation overhead, well above the leafless thistles, is an owl. It hoots when your eyes meet its gaze, throws out its wings, and descends rapidly towards you. It looks like it might collide with your face.", "action_results": [{"action": "Duck", "result": "The owl is probably trying to ward you away, so you shield your face and duck. It sweeps overhead, close enough to rake wind across your hair. You turn around to see where it went, but it's already out of sight. It must be hunting mice.\n\n\nYou pause to take inventory of your location, but the survey yields nothing for memory. Farra's grave could be a couple hours in any orientation from here. You begin to probe in different directions, hoping to see something indicative, something to spark a memory. An hour passes, then hours, and you become desperate. You'll be too far away to reach the site in time if you don't pick an angle at random and hope to run across it. You pick an arbitrary direction and walk.\n\n\nThe leaves grow wildly here, in the rustic colors of Autumn, still attached to branches for the most part. Patches of moss cling around their limbs. The floor is composed of mostly bramble. Time slips ever forward, all without results.\n\n\nYou can feel the encroaching emptiness of oblivion. You look mournfully as daylight forms a thin line on the horizon. There is no suitable place to harbor until next Halloween. The moon beckons you to the Otherside, and so you make your final astral light, leaving business unfinished. Stanley collapses to the ground from overwhelming weariness.\n\n\nSunlight wakes you around midday. You touch your head, blink, and shuffle around. He's gone, and you're back in control. You think about last night with a shiver and a touch of sorrow. At first he seemed mad, but that faded over time. The possession shattered so many things you thought were true about the world; you can hardly imagine the ramifications of what would happen had he accomplished his goal. But instead, the world will remain bleak, without the touch of magic. If you can be controlled by a ghost, that lends some credit to its claims, and you're inclined to believe them. You head off to the stream and follow it back until you hear the roar of the highway.", "action_results": []}, {"action": "Don't duck", "result": "You decide not to duck. If it's an omen, you want to know. The owl bears down, but spreads its wings wide, right before collision, launching itself over your head. Your eyes follow the silent dart as it takes steep banks, carving an angular path through the trees.\n\n\n“Thanks,” you whisper. A clear omen. You start in the direction it indicated. There is no pretense of a trail, and you are forced to bushwhack for another few hours until you reach a clearing. The longest blades of grass threaten to reach your shoulders, with regular clusters up to knee height. Moonlight dapples the primal scene, casting silhouettes from tall rocks. You remember them; the site is very close, now. You can see short foliage off to the left, all beginning to curl at different points along their length, to differing degrees. Those are the ferns, the same ferns, as you remember. You wade to them through the sea of grass, and the ground transitions to a mixture of trees, with ferns to fill the spaces between. You comb through them, searching for evidence of a grave.\n\n\nYou're leaning with fatigue by the time you find it, buried, hidden beneath them as though protected...little round rocks, separated many feet apart by cycles of growth and decay, freeze and thaw. You remember these, taken from the forest around you 1,000 years ago, and stacked around the headstone that's no longer here. Probably for the best, you think, that there are no workings of man here at all.\n\n\nThe stones are gathered, gently, and arranged into three circles: one for The Observer, who hovers above even now; one for The Forms, which include all aspects of nature; and one for The Provider, who will compete for the sky only hours from now. You build them around the ferns, and the work is done. There is no further reason to be here, and you rush away to the moon, who will catch your spirit before The Provider can burn it. Stanley collapses to the ground from overwhelming weariness.\n\n\nSunlight wakes you around midday. You touch your head, blink, and shuffle around. He's gone, and you're back in control. You can't help but shiver as you recall last night. That possession shattered so many things you thought were true about the world. You look at the sky, and The Provider beams down at you. You head off to the stream, and follow it back until you hear the roar of the highway.", "action_results": []}]}, {"action": "Press towards the bear", "result": "Moving towards the bear is the best idea, you reason. You take some long strides forward, arms wide, and yell. The bear retracts a few feet in response, and you continue moving forward. It growls, stops walking backwards, and looks at you again. Except, this time you're pretty sure it's sizing you up as a threat. Then it starts walking at you.\n\n\nYour confidence shatters when you realize you're in a losing situation. You try to strafe to the river, away from the trees, but the bear bounds after! There's no time to think — you leap in, wading fiercely to the other side. Before your hand can find purchase on the other side, claws separate the tissues in your back. Your head plunges underwater, and it finishes dissecting your torso.", "action_results": []}]}, {"action": "Flee", "result": "Walking at the bear can only end in disaster, so the best course of action is to run! You turn around and begin jogging away. Seconds later, you feel the heavy weight of the beast pressing its forepaws onto your back. It must've given chase, considering you prey. Your face smashes into the ground, hard. It proceeds to gouge away at your back.", "action_results": []}]}]}]}, {"action": "Shift the ghoul", "result": "Perhaps it's the featureless face, with its distended chin and vague indications of a scream, that draw your hand to the ghoul. As you graze the figure, a wash of callousness pours over you, followed with anger. By no means should you be paid only a hundred bucks for spending all day doing this chore! You dump the statues unceremoniously in a heap, flinging adjacent oddities from their perch on the shelf. The sound of impact and breakage draws Paul over.\n\n\n“Hey! Be careful.” He touches your shoulder, and you spin around. “This job is worth more than a hundred,” you sneer. “I should get paid more, like two hundred.”\n\n\n“Look Stanley, I can't do that much. If you really want to call it quits, I'll just give you the full hundred now,” he says. Part of you thinks he's being kind, but really, he's just making an excuse to get out of giving you what you deserve.", "action_results": [{"action": "Make a convincing counterargument", "result": "You rush him, or part of you does. You don't seem to be in control of your own body; that part of you is celled somewhere inside by a malicious force that's trying to kill Paul.\n\n\nWaiting in that statue was an eternity. You're looking forward to this. The hands and legs are strong despite a lack of exercise. Stepping right up to Paul, you test a punch on his neck. He coughs, eyes wide in shock, and moves to cover it. He's still trying to choke out some words when you circle around and deliver a hard stomp to his lower spine — the hotspot for his arthritis. He's crying on the ground now, and you press information out of Stanley's conscience. Ah, he pulled the money jar out ahead of time and set it on the counter.\n\n\n“Don't get up,” you advise, and run out to get the jar. You return, squatting and lauding the jar over his head. You frown, yanking his phone out of his hands. He hasn't dialed the police yet, good. You convert it to metal scrap with your shoe.\n\n\n“Now then, ah yes. You were just going to pay me. I think this is fair, what do you say?” He shakes his head sadly. You kick it into compliance. Now his head bobs nicely up and down when you ask. Satisfied, you thank him and snap his neck. Stanley's presence is in the back of your head, whining and screaming about all of it. You'll be through with him soon enough.\n\n\nYou get into the car, reading Stanley's mind in its confused, unguarded state. It was an act, but a useful one; he's shocked now, and unlikely to offer much resistance for the time being. You turn the key and rumble the car onto some country roads leading to the highway. Kess knows more about keeping a prize body after Halloween's end. Last you knew, he was occupying a sorry vase in Greg's house, but Halloween is the one night with no restrictions, so he could potentially be anywhere.", "action_results": [{"action": "Find Kess", "result": "The car rolls down the highway in your search to meet up with Kess. He should be at the house with that deranged codger, where you were until a few years ago when he sold you to Paul. That old man would collect anything he thought was haunted, and his damnable superstitions make his mind impenetrable. On any night but Halloween, you can't do much to separate from your container without traveling through solids. There's no textbook on the physics of being a dead ethereal wisp, so everything you know is from years of watching others make mistakes. Kess probably has things under control by now.\n\n\nYou drive through a series of increasingly obscure backstreets until you arrive at the house, identified by its cheap metal roof and the oddments littering the yard. There's nobody outside, the lights are off, and the place remains undecorated. Maybe he's out trapping for ghosts or something. You park the car against the curb a house away.", "action_results": [{"action": "Try the front door", "result": "It's best if that old man Greg doesn't suspect you at all. He knows more facts about ghosts and the Otherside than probably anyone in a 200 mile radius. You jiggle the handle of the door. It's locked. You start knocking, but there's no response. He could be deeply involved in one of his queer study sessions as he so often was when you were a nick-knack on the wall. Creeping along the windows to see if he's home would instantly arouse suspicion, and he knows you're here, so it would be unwise.\n\n\nA minute passes by. Even in a deep study, he should be shuffling to the door by now. Curiosity always gets the better of him, on many levels. Another minute passes, and you're beginning to doubt he's actually here when you catch the sounds of languished moaning emanating from the other side of the door.\n\n\nSuddenly, it flings open, and you're greeted by not-Greg. It has many of his features, but it's taller, muscular, and a bold shade of red. The demon pierces your throat with the claw of a bony finger, and laughs. You exit from the body as an otherworldly wisp. Before you can dart away, you're siphoned into some kind of container shaped to look like a demon. The tug of the container far exceeds your ability to escape, and you get the curious notion that Greg meant to entrap it with this.", "action_results": []}, {"action": "Peer in through the windows", "result": "You step out of the car and make your way up to the side of the house, walking over small twists of metal that seem to have fallen off a nearby piece of \"lawn art\". You duck under a window and take a peek from below. You see furniture: a television, an armchair, and a table, all swept to one side of the room. In their place, candles take the arrangement of a seance pattern. Greg, the old man, sits in the middle of the circle, forming words on his lips that you can't hear from outside. You lower your head out of view. What exactly is he trying to accomplish, you wonder, never having seen this before. But Greg always puts his best foot forward to anything he tries to accomplish, so unless he became senile in the last few years, he's not following a D.I.Y. occult recipe.\n\n\nTrying the front door would be fruitless, given what he's up to. You could break in through a window or drive the car into the house. That's certainly one way to make an entrance.", "action_results": [{"action": "Break a window", "result": "Breaking in from a window is more sensible, you think. You lean down to collect a particularly jagged metal scrap from the lawn, admiring its potential uses as both a shiv and hammer. You take a good step back and heave it into the window, resulting in a loud but ineffectual thump. You drop it in favor of a concrete statue (it's upper half) shaped to look like a marsh witch. The makeshift ram puts a radial crack in the window that spiderwebs to the edges. Another hefty run does it in, throwing glass shards around like the spray of a champagne bottle. Picking up the shiv-hammer, you climb through the window and run up to Greg. He's still chanting gibberish that means as much to you as it did when you couldn't hear it. You plunge the sharp end of the metal fragment in his flesh, pressing in with both hands to grind it into his organs. To your surprise, he holds it from going further, and looks at you with contempt.\n\n\n“Who are you and why are you interfering with me, ghost?” A metallic voice questions from beyond. Greg pushes the metal out of his chest, overpowering your arm strength. The wound begins to heal of its own accord. “Just a little longer, and then I'll play your games.” It looks like Greg's goal was to get possessed by some creature. He always was a nut job, so you're not too surprised. Whatever is currently transferring into his body is as weak now as it will ever be, and still has the strength to control some limbs. You don't know what it is, but you hardly want to wait and find out.", "action_results": [{"action": "Try to halt the possession", "result": "It looks like Greg is unable to move for the time being. You start kicking over the candles around the circle, which earns you a scowl. A heap of unrelated baubles and clothing lay in a pile near the circle. Only some of them cast purple shadows...an offering for the possession, maybe? The ghosts left must be too afraid to leave their containers, for fear of being absorbed or exchanged as currency for the arrival of this being. You kick the pile away, and Greg's face twists with anger. He continues chanting.\n\n\nYou walk around him. He shifts in place to face you, but he has to lift himself only with his hands. It's easy enough to outpace his clumsy hand-turning. You circle around and catch him in the neck with the shiv, snapping through the vocal cord. He screams hoarsely and then goes quiet. Something arises from the body, juxtaposed between the house and its distant origin. It's stuck, halfway between the planes. You laugh — a mixture of spite and satisfaction. The red mist can only quiver in place. Greg's left hand goes limp, releasing a stone figurine with demonic features. It looks like it could've been the catalyst that started the whole thing. You switch over to the blunt end of your shiv-hammer implement and slam it down.\n\n\nWith Greg taken care of, you move on to the clutter around the house. With so many haunted objects, you do all your sifting through the rubber insulation of your shoe. Direct contact is the easiest way to get possessed, and you're not sure how strong you are against some of the spirits in this house, especially after putting an end to that.\n\n\n“Kess. Come out and jump into a convenient vessel so I can carry you off to a habitable body.” He needs an actual mouth to relay information, and it's just about the only leverage you have to get information out of him to help yourself. From your mortal years, you know he doesn't give things out for free. A pale cloud snakes out from a flashlight, circles, and returns. “If you're not Kess, I will personally return you to the Otherside. Come out again if you want to confirm who you are.” It does. You grab the flashlight with your sleeve.", "action_results": [{"action": "Visit the neighbors", "result": "If the neighbors next door are around, one of them would do. You walk up to the nearest house, blue-trimmed and nice in stark contrast to Greg's, and knock at the door. At first, there's no response, and you're waiting impatiently under the yellow porch light. A young girl answers the door; she must be around ten. You put your foot in the doorway and lean forward, touching the flashlight to her arm. She stands still for a moment, then closes the door. Just in case something goes wrong, you walk back out to the street, casually returning to Greg's. A light goes on. A minute passes, and it turns off. A man steps out from behind the door and walks over.\n\n\n“Kess?” you inquire.\n\n\n“Yeah.”\n\n\nNow that he's got a mouth, you want your answers. “I need to know how to push out a conscience,” you bluntly state. “The original. So I can live in this body through and past sleep, if you wouldn't mind sharing.”\n\n\n“Thanks for the body, by the way. I'll have to go find something to do that myself. I'll be leaving you to do the same, Viktor. After all, there's only so much time left in the night, and I can't risk wasting it to train you on the few things I learned at old Greg's mad house,” Kess replies. “I suppose if you promise to pay me, wherever I go, so I can live a stable life without work, that would be fine by me. Just for a lifetime, mind you. Say what you need to now. I've got to get this done as soon as possible.”\n\n\nThere aren't many options. It's a promise to work for Kess in exchange for a permanent secret to immortality — the kind you thought you'd get when you first became a ghost. There's no guarantee of success, especially when his host has a lot of willpower. The alternative is to likely end up haunting a trinket for yet another year. All activities that delve into dark mysticism tend to carry the risk of oblivion when they go wrong, which is something you're not looking forward to.", "action_results": [{"action": "Search for answers at Greg's", "result": "“I'll pass, Kess. I've got my own ideas on how to make this last.” He shrugs, walking back inside with you. After a moment of fumbling around, he snatches the keys to Greg's car and takes his leave. You're standing alone in the house, with its bipolar arrangements and the cold draft coming in through the window. You snuff some of the candles still burning around the summoning circle. You collect them up to an unassuming dining room table, swiping off heaps of paper and clutter. This will be your study chamber for the coming hours.\n\n\nThe first few are spent congregating all the books roaming the floors and ranging across shelves. There are several hundreds of them. More time yet is devoted to turning through the table of contents for most of them, discarding the ones that seem least related to your goal. Except for a few outliers describing the history of famous hauntings (both places and people), the majority are a mixture of conjectured witchcraft and psychosis. On the Indigo Plains sounds like a vision of the Otherside through the lens of a horror narrative. Inhaling Immortality comes across as someone's power trip fantasy; you know all too well the restrictions of ghosthood. You continue on through the mostly handwritten books, reading the chicken scratch edits in the page gutters. A Compilation on Ghost Theory seems to be little different than the baseless hypothesizing of other volumes. But, in frenetic, fine sharpie are little notes. A chill tingles your neck and spine. The notes and their descriptions...these were written by the mind of another ghost.\n\n\nYou lean in, scooting the candle closer, and take a deep read. Stanley is in there somewhere, exerting his maximum force to expell you. Your concentration is partitioned between the book and maintaining bodily dominance; time flows by. The portal between the mortal realm and the Otherside yawns open only once a year, on Halloween. When it closes, it brings finality to any ghost without a physical tether.\n\n\nYou glance out the defunct window. The sky is rising into a deep blue color, and your head is bobbing dangerously in sleep deprivation. Stanley is likely to awaken at a different time than you...if he wakes up first, he'll probably send you to oblivion.", "action_results": [{"action": "Inhabit an object for another year", "result": "You sigh. It's time to pack it in. Regretfully, you depart from Stanley. He falls immediately to sleep. You follow suit, waiting just long enough to ensure he's not watching. In your lassitude, you slide into one of the many books scattered around. Some come in to clean up the body, and an investigation follows. Dutiful feet mince across the floor, and then they're absent, none approaching the bookshelf or your particular prison. Winter passes into the new year. All the while, you're stranded in isolation.\n\n\nJune rolls around, and new feet enter the house. You overhear something about an estate sale, but you're goaded into the garbage by gloves you can't travel through, apparently unworthy. The garbage comes to a processing center, where standard procedures stymie any hope of direct possession. Eventually, you reach your final destination in landfill, waiting for the next outing. But sometime in all that isolation, you lost count of the current day, and there's no one around to remind you, not for miles.\n\n\nIt's the little things that damn us the most.", "action_results": []}, {"action": "Finish the study", "result": "The weight crowning your neck is like a bowling ball. Your shoulders slouch, and your head bobs with the nearness of rest. It would be intriguing, at any other time, to muse why even the unnatural possessor of a body is subject to lethargy. You finish the rest of the script and give your head a tired shake. You traipse through the glassless void, out to the backyard, and collect a shorn length of wrought iron from the scatterings. It comes to an agreeable, liberating point. You plunge it through a lung, howling and coughing up blood. The pain fries thought and, for a while, the two of you suffer in unison. But having endured much worse pains, you recover first. With a great heave, the essence of Stanley is ousted. The adrenaline runs dry a few minutes later.\n\n\nYou rouse to consciousness, and crack a smile. Stanley is truly gone. Then you notice the chain connecting your wrist to the bed, and the officer in the corner. It looks like they identified Greg's murderer. You reach out to touch the nurse's wrist as she gets close, finding...you can still transfer over.\n\n\nYou read about it all a few weeks later. Man suddenly dies after self-inflicted wounds. Doctors baffled. The story goes on to describe how the nurse felt a powerful, almost supernatural feeling as the young man passed away. The officer was so disturbed that he left the room and stabbed himself later that night. He said it was an unrelated event, that his life was just too hectic. His family was surprised when they heard how it all shook down. It doesn't mention that he resigned from the police force, that he pushed away his close family so they'd believe a radical shift in personality later, or anything about the numerous times he broke out into hectic laughter when he came to thinking that he actually did it.", "action_results": []}]}, {"action": "Agree to the deal", "result": "“Fine,” you reply. Sifting through the disarrayed contents of Greg's house, you search for the keys to his four-seater vehicle. Kess finds them first, on a surprisingly tidy nightstand in the bedroom. You climb into the passenger side, the engine turns over, and he begins driving.\n\n\nThe car gets onto the freeway and heads North, away from town. After the first ten minutes, your mind departs from immediate concerns. Your thoughts start to linger on well-trodden grounds of uncertainty. Will you be vested in life, in lives, jumping from host to host ad nauseam? Will you ever feel that the inherited families are your own, or will you file them away as relics of the old hosts?\n\n\nKess interrupts the silence with his own thoughts. “So Viktor,” he begins, “let me tell you how things are going to work. We're going to drive up to Hyacinth Beach because I heard about it in one of Greg's ravings. We'll be away from the sand, up higher and into hills where there's some old military bunker. I know that area should have a portal somewhere that connects to the Otherside.”\n\n\n“No way. How do you know you even exist after you cross through it? All I know about it is black nothingness. We were there with the witches when we saw it.”\n\n\n“As if I'd forget a crucial moment in my life. I don't plan on finding out if there's an afterlife behind the curtain. It's possible to separate the host into the portal.” Kess replies. “I know the actions required.”\n\n\nThe drive is broken up with Stanley's brief, sporadic reminders that he doesn't appreciate having his mind sequestered away. It's interesting how much you appreciate downtime on the only eventful night since last year. The sky hovers above, the roads sits below, and the whole world flits between. Kess cruises along for another half-hour before pulling into a residential network of streets. There's a medley of developments both new and historic along the downhill route.\n\n\nHe pulls around an inclined bend to the right, drifting to the side of the road. The moon beams down from the clear sky, throwing muted light across the grass on a nearby hill. You march towards it, revealing the corner of a forgotten concrete bunker as you crest a minor mound. Kess stands beside you, pointing indecisively at one corner of the building and another, trying to remember further details. At last, you follow him into the main entrance. You stop to listen for signs of occupancy. Hearing nothing, the two of you walk purposefully down a hall, using phones for illumination. Kess immediately locates the anomaly in a gray, featureless crate of a room, with white scratchings on otherwise indistinguishable walls. Something black burbles, suspended, in the corner. It has a wispy outer atmosphere, always curling and reaching. The heart is an inscrutable black canvas, wider and taller than any person, roiling inwards. It really is a fragment of the Otherside. How did it get here?\n\n\nAs you stare at its stark presence, a sound chimes off the walls somewhere outside.", "action_results": [{"action": "Investigate the noise", "result": "If that noise means someone is approaching this room, they're less than ten seconds away. There's no point in going through with Kess's plans just to be interrupted. With a quick nod, you smooth yourselves against the wall, looking out around the corner. The shuffling of many legs fades into earshot. In the dull light they carry, you see two men and a woman, probably in their twenties. The woman is holding opposite ends of something rectangular, which you can't make out in a passing glimpse. They're definitely headed this way, and neither of you have a viable weapon.", "action_results": [{"action": "Announce your presence", "result": "“Hello?” you inquire at them. The footsteps all come to a sudden halt, without reply. A light beams in your direction. You and Kess step out into the hallway, surveying the crowd of three. The tougher-looking guy on the left has a denim jacket; his counterpart is wearing a hoodie. The woman between them is wearing black jeans and holding an unlabeled book. Kess shoots you a look that suggests diplomacy wasn't his first choice.\n\n\n“All done with the sight-seeing?” asks the one with a hoodie. “We've got things to do.” The other guy fishes a knife from his coat, with some difficulty, holding it at his side. Damn, you'll have to talk your way out of this somehow.", "action_results": [{"action": "“Careful, friends. We're not what you think.”", "result": "“So what are you, then?” the woman asks. Her buddies shift around expectantly.", "action_results": [{"action": "“We're ghosts.”", "result": "In response, the woman throws something to each of you. You snag it from the air without thinking. Kess lets it clatter, chipping as it hits the floor. You open your palm to see a small figurine, of green painted stone, and shaped like a head. Then, some force draws at you and you're snapped out of the body as invisible reigns tighten; the statue siphons the loose spirit.\n\n\nYou overhear nothing, but with Kess being outnumbered, you could guess he's stuck in a statue now, too. Your prison is absolutely silent, with no windows to see out of, and no parol. A year passes, or maybe just a month. Then another, and another. You've been listening to your own memories for so long that every single one feels overplayed, but there's nothing new to tune in. There's no chink, no exploitable deformity, in these walls.\n\n\nYou begin to pray for release, even oblivion. Then, after some incalculable tract of time, the walls suddenly give way, and you hurtle through the boundary...into a familiar black nexus, sacrificed as part of some dark liturgy.", "action_results": []}, {"action": "“The nether lords of another realm.”", "result": "She looks askance at you. “That's really hard to believe. Do you have any evidence?” They're definitely practicing witchcraft with that book, you figure. If they believe the lie long enough to even ask, they can surely be made to leave. Kess speaks up.\n\n\n“We opened the portal,” he says. “Now we've come back to use it. Are you volunteering to be part of our work? We could use a few upstart witches.” He stares as though the verbal transaction has bored him already.\n\n\nShe stays silent, wanting to dismiss the claim but afraid of the consequences. She works towards a response. “Sorry, but we were really hoping to use it and for a fairly quick thing, so would you mind we do that?” After a second thought, she adds “after you, if it's short, we hope.” Her companions move around, agitated.", "action_results": [{"action": "“No.”", "result": "She believes the lie well enough to stay her feet, but the jacket-wearing guy starts rotating a knife. He looks like he's willing to get involved in some havoc.\n\n\n“Fuck this, you're not nether lords, and there's no such thing,” he calls out. He points the knife threateningly at you, ten feet away.", "action_results": [{"action": "“BEGONE! M'yuh sha takyeh, gos ney'sa raktur...”", "result": "You swing your arms wide, angling down your hands to point fingers at your audience, and shout. You flip your eyes up, obscuring the pupils, and begin muttering gibberish, hoping the presentation bears effect. The group begins to backpedal out of the bunker, and you increase your voice to compensate. They turn and bolt.\n\n\nThe sound of rubber on concrete fades soon enough, and you step back into the room with Kess. “They're either waiting at the entrance or a short distance away,” you mention.\n\n\n“Oh, absolutely.” He draws in some air. “Any time you're ready then, Viktor. Stand about two feet from the portal.”\n\n\nYou walk over to its effervescing surface. Kess produces a sewing needle that he must've filched before leaving the house. He instructs you to open your hand. The needle dips in, under the skin, and emerges with a crimson droplet balanced at the end.\n\n\n“Now touch it to the portal and exhale your little puppet.”\n\n\nAs you do so, the wisps are drawn to the blood, and begin to eddy ominously around the pin. Stanley fights again, predictably weak despite his striving, as you breathe out. The wisps swirl in, to your throat and clutch at something unreal, or not quite of the same material as the world, withdrawing it, and Stanley's presence dulls away to nothing. Kess follows suit.\n\n\nIt's a strange feeling to own a body again, as the owner rather than the intruder. It's pretty evil, you acknowledge, that you sent Stanley to the Otherside when you fear it yourself. On the other hand, it's just survival, and you shelve the remorse, happy to return to the flitting world once more.\n\n\nNo witches greet you as you leave the compound, and you part ways with Kess. The transgressions of that night get you labeled the prime suspect for murder, forcing you to flee to other areas. You make friends again, getting caught up in the world of boating, among other simplicities you've forgotten you enjoy. You have to move now and then to evade notice from officials who might connect you to the past, but you manage to escape dicey situations. You pay Kess now and then through a cryptocurrency account he directed you to use, keeping your end of the bargain.\n\n\nThirty years pass, and you've grown fond of living. It's more peaceful than your original life, which is difficult to remember among your new, competing memories. Time keeps flowing onward, putting wrinkles on your face and pain in your joints. Looking back, having just turned eighty, is a funny feeling. It doesn't feel like much time passed at all. Still, a thought nips at the surface of your mind, suggesting you need to move onto a new host. Only, your life has been a little different this time around. It has been peaceful, and you think it would sting you a little more now, knowing how good life can be, to take another's.", "action_results": [{"action": "Find a host and live again", "result": "Still, the thought of death is haunting. You tell your friends that you're going on vacation, mellow at the thought of leaving them behind, and get into your vehicle. You begin to make your way back, old now, to that same bunker near the beach, where you expect to find the portal on Halloween. Even if the murder case is cold, flight security makes you nervous, and you find it's still a pleasant drive across country.\n\n\nHalloween rolls around, and you check out of the hotel. You hand the hotel card, a pin, and your keys to the reception clerk, touching the back of his hand and transferring over. Your old body falls, aged and lifeless, on the opposite side of the desk. The man has few superstitions, and his mind is easily dominated. You excuse yourself from work, and the day carries on.\n\n\nClouds ride in on a rain front in the late afternoon. You get on course to Hyacinth Beach, a little over an hour away, driving through bouts of rain under a clouded sky. There are more buildings in the neighborhood around the beach. Some of the oldest ones have been scrubbed away, making room for the future. The bunker itself, dim under a clouded sky, is etched with the slow passing of time. Additional cracks spider across the walls, filled with peeking moss.\n\n\nYou walk into the room, expecting to see nothing. There it is, a quivering hole to nowhere, passively violating all expeditions of science. The host squirms at its sight, but can't escape. The needle prods flesh, and the host is exhumed from your lungs, only to be snuffed by the hungry emptiness before you.\n\n\nIt's unfortunate, but it's survival.", "action_results": []}, {"action": "Move on", "result": "You've enjoyed the benefits of two lifetimes. This one, you've truly lived. You wouldn't deprive someone of the opportunity, now.\n\n\nMore years pass, bringing new problems. Life is slow, hobbling around with a cane. You feel like your mind is worn down. Memory becomes difficult. You're in the decay part of the lifecycle, and you intend to ride it all the way out.\n\n\nAnother five years pass. On a typical day in Autumn, you return from an excursion to the store. A few days later, you develop a wet cough. You're admitted to intensive care with a life-threatening case of pneumonia. The condition seems stable for a week, but sharply worsens thereafter.\n\n\nOn the ninth day, between fitful coughs, you die. You don't see it, but you feel the tug of those mysterious gates that all souls are drawn to when the body expires, and enter the Otherside.", "action_results": []}]}, {"action": "Look at him completely unimpressed", "result": "You relax all the muscles of your face, looking on with sheer disinterest. He's short-tempered, and the guise isn't good enough. He runs at you, beating away your arms with ease, and plunges the knife just under your heart. You scream! The knife twists, and a miniature obelisk goes sailing through the air at you. Your killer reaches a hand up to grab it, then wrenches open one of your fists, forcing you to hold the stone. He smiles as some force draws at you, and you're snapped out of the body as invisible reigns tighten; the statue siphons the loose spirit.\n\n\nYou overhear nothing, but with Kess being outnumbered, you could guess he's stuck in an obelisk now, too. Your prison is absolutely silent, with no windows to see out of, and no parol. A year passes, or maybe just a month. Then another, and another. You've been listening to your own memories for so long that every single one feels overplayed, but there's nothing new to tune in. There's no chink, no exploitable deformity, in the marble surface.\n\n\nYou begin to pray for release, even oblivion. Then, after some incalculable tract of time, the walls suddenly give way, and you hurtle through the boundary...into a familiar black nexus, sacrificed as part of some dark liturgy.", "action_results": []}]}, {"action": "“I will permit this, but you must not peer at our work if you value living.”", "result": "The group begrudgingly retreats to linger elsewhere, hoping to overhear the results of your work with the portal. Good.\n\n\nKess leans in to quietly pass instructions. “Any time you're ready then, Viktor. Stand about two feet from the portal.”\n\n\nYou walk over to its effervescing surface. He produces a sewing needle that he must've filched before leaving the house. He instructs you to open your hand. The needle dips in, under the skin, and emerges with a crimson droplet balanced at the end.\n\n\n“Now touch it to the portal and exhale your little puppet,” he whispers.\n\n\nAs you do so, the wisps are drawn to the blood, and begin to eddy ominously around the pin. Stanley fights again, predictably weak despite his striving, as you breathe out. The wisps swirl in, to your throat and clutch at something unreal, or not quite of the same material as the world, withdrawing it, and Stanley's presence dulls away to nothing. Kess follows suit.\n\n\nIt's a strange feeling to own a body again, as the owner rather than the intruder. It's pretty evil, you acknowledge, that you sent Stanley to the Otherside when you fear it yourself. On the other hand, it's just survival, and you shelve the remorse, happy to return to the flitting world once more.\n\n\nYou walk out of the room, passing by the group of three on your way out. “Go ahead,” Kess tells them.\n\n\nThe two of you part ways. The transgressions of that night get you labeled the prime suspect for murder, and you're forced to flee to other areas. You make friends again, getting caught up in the world of boating, among other simplicities you've forgotten you enjoy. You have to move now and then to evade notice from officials who might connect you to the past, but you manage to escape dicey situations. You pay Kess now and then through a cryptocurrency account he directed you to use, keeping your end of the bargain.\n\n\nThirty years pass, and you've grown fond of living. It's more peaceful than your original life, which is difficult to remember among your new, competing memories. Time keeps flowing onward, putting wrinkles on your face and pain in your joints. Looking back, having just turned eighty, is a funny feeling. It doesn't feel like much time passed at all. Still, a thought nips at the surface of your mind, suggesting you need to move onto a new host. Only, your life has been a little different this time around. It has been peaceful, and you think it would sting you a little more now, knowing how good life can be, to take another's.", "action_results": [null, null]}]}, {"action": "“Demons, as patient as they come.”", "result": "The group looks unconvinced, but the lady seems to be weighing the possibility. The threat isn't lost on her. “How long do you think you'll be?” she asks.", "action_results": [{"action": "“A short while.”", "result": "“I don't believe you,” she says. “About being demons. No demon is so compliant without offering a deal.” The guy to her left fiddles with a pocket on his jacket, fishing out a knife, then springs at Kess. He moves to block his opponent, but the man has fought with a knife before, and knocks away his defenses. A quick swivel of the torso keeps it out of knife reach, and they continue with the deadly dance.\n\n\nThe hooded one starts running at you, now, though he is equally unarmed. He stops just outside the radius of your arm, moving back and forth looking for an opening, but you adjust position quickly. You move towards him, forcing engagement, and let him make a kick at you. You run as soon as he starts the motion, knocking his leg away and driving knuckles into his sorry throat. A few additional hits end him utterly, and you move onto the witch with the book.\n\n\nShe's holding it in both hands, verbalizing a string of syllables adhering to no modern language. A rapid check on surroundings reveals that Kess has a knick on his arm, cutting through the fabric, and exhaustion in his defenses. You make a crunch decision.", "action_results": [{"action": "Go after the witch", "result": "You rush the witch before she can finish her incantation. She takes off at a sprint, shutting the book and tracking the page with her finger. You run after her, wondering if Kess will be alive when you return. As you close the distance, she flings the book at you, hoping it will slow you down. You watch her continue to run as you stoop down to grab it. There's no need to pin another murder on you so quickly.\n\n\nYou rush down the bunker hallway, running into a figure on his way out. He goes to stab with the knife; it skids off the hardcover surface of the book, which then meets his face. You follow up with an opportune strike to his wrist, disarming him, and pick up the knife as he grabs your back. To avoid getting kneed in the head, you collapse and pull him down, twisting in the process, to put him in a prone position. A fist cracks you in the temple, but the sure sound of the knife sliding into flesh secures your victory. You turn him over as blood weeps out, and stand, pinning him underfoot, until he becomes irrelevant.\n\n\nKess is backed to the wall, holding a hand over his wound. “Little known fact,” he says, “Ghosts aren't just subject to the laws of sleep and memory loss. If you die in a body, you die with the host. So, if I do, take this needle and poke the center of your palm. Hold the blood drop in the Otherside and exhale your host. Please find someone!” You chuck the book in a random room in case the witch comes back, and leave to find a nearby victim. You're hardly going to leave him to die.\n\n\nYou return to Kess a little over ten minutes later, finding he's still awake. The youth you're holding onto heaves, throwing all his weight away and towards you, trying to trip out of your grasp. You subdue his thrashing long enough to get a steady connection to Kess's dying body. The adolescent twists, even more violently, breaking your grasp. His spasms last seconds, and then he stands with newly-restored composure, and all the mannerisms that follow Kess through his hosts.\n\n\n“Thanks. That was hellish. I thought I was going to die.” Kess exhasperates. You nod. “Any time you're ready then, Viktor. Stand about two feet from the portal,” he adds.\n\n\nYou walk over to its effervescing surface. He scours the old host for a sewing needle that he must've filched before leaving the house, and instructs you to open your hand. The needle dips in, under the skin, and emerges with a crimson droplet balanced at the end.\n\n\n“Now touch it to the portal and exhale your little puppet.”\n\n\nAs you do so, the wisps are drawn to the blood, and begin to eddy ominously around the pin. Stanley fights again, predictably weak despite his striving, as you breathe out. The wisps swirl in, to your throat and clutch at something unreal, or not quite of the same material as the world, withdrawing it, and Stanley's presence dulls away to nothing. Kess follows suit, bidding an early goodbye to his adolescent host.\n\n\nIt's a strange feeling to own a body again, as the owner rather than the intruder. It's pretty evil, you acknowledge, that you sent Stanley and, indirectly, that teen to the Otherside when you fear it yourself. On the other hand, it's just survival, and you shelve the remorse, happy to return to the flitting world once more.\n\n\nThe two of you part ways. The transgressions of that night get you labeled the prime suspect of two murders, and you're forced to flee to other areas. You make friends again, a few per year, lying low most of the time to avoid notice. Simple hobbies take your interest in the off-time, like Lego construction and board games. You move now and then as years pass, escaping dicey situations including background checks. You pay Kess now and then through a cryptocurrency account he directed you to use, keeping your end of the bargain.\n\n\nThirty years pass, and you've grown fond of living. It's more peaceful than your original life, which is difficult to remember among your new, competing memories. Time keeps flowing onward, putting wrinkles on your face and pain in your joints. Looking back, having just turned eighty, is a funny feeling. It doesn't feel like much time passed at all. Still, a thought nips at the surface of your mind, suggesting you need to move onto a new host. Only, your life has been a little different this time around. It has been peaceful, and you think it would sting you a little more now, knowing how good life can be, to take another's.", "action_results": [null, null]}, {"action": "Keep Kess alive", "result": "If Kess continues to fight alone, he'll die. Then at the very least, the two of you would be objects for another year, since he wouldn't be able to act upon or convey the ritual. That's with the optimism that someone thumbs through a few haunted objects on Halloween.\n\n\nYou flank the knife assailant, striking at the underside of his ribcage. He shifts an elbow to cover, only to be clocked by a sidewinding fist. The ceiling begins to undulate with the witch's foreign enunciations. Shrivaled roots curl out from the floor, ratcheting over your feet with a paranormally strong bond. She walks forward, still speaking. The roots bow away from her feet, or lay flat to be stepped on, as she approaches.\n\n\nAs her wicked chant continues, the ground beneath you begins to roll, sideways, washing you against the wall, where additional roots spring forth and pin you down. She retrieves a short kris from a bag at her waist, and runs it into your heart. You feel a spreading warmth...then welling pain. The moment is fleeting, and you transition from panic to stillness. Thoughts fire in your head at random; among them, the feeling that you didn't make it, didn't make it... ", "action_results": []}]}, {"action": "“Too many questions.”", "result": "You sneer disdainfully with the delivery of your message. The group seems skeptical, but after a few seconds of back-and-forth, it looks like they're buying the act. They settle outside of the room. Figuring they're eavesdropping, Kess leans in to quietly pass instructions. “Any time you're ready then, Viktor. Stand about two feet from the portal.”\n\n\nYou walk over to its effervescing surface. He produces a sewing needle that he must've filched before leaving the house. He instructs you to open your hand. The needle dips in, under the skin, and emerges with a crimson droplet balanced at the end.\n\n\n“Now touch it to the portal and exhale your little puppet,” he whispers.\n\n\nAs you do so, the wisps are drawn to the blood, and begin to eddy ominously around the pin. Stanley fights again, predictably weak despite his striving, as you breathe out. The wisps swirl in, to your throat and clutch at something unreal, or not quite of the same material as the world, withdrawing it, and Stanley's presence dulls away to nothing. Kess follows suit.\n\n\nIt's a strange feeling to own a body again, as the owner rather than the intruder. It's pretty evil, you acknowledge, that you sent Stanley to the Otherside when you fear it yourself. On the other hand, it's just survival, and you shelve the remorse, happy to return to the flitting world once more.\n\n\nYou walk out of the room, passing by the group of three on your way out, saying nothing.\n\n\nThe two of you part ways. The transgressions of that night get you labeled the prime suspect for murder, and you're forced to flee to other areas. You make friends again, getting caught up in the world of chess, among other simplicities you've forgotten you enjoy. You have to move now and then to evade notice from officials who might connect you to the past, but you manage to escape dicey situations. You pay Kess now and then through a cryptocurrency account he directed you to use, keeping your end of the bargain.\n\n\nThirty years pass, and you've grown fond of living. It's more peaceful than your original life, which is difficult to remember among your new, competing memories. Time keeps flowing onward, putting wrinkles on your face and pain in your joints. Looking back, having just turned eighty, is a funny feeling. It doesn't feel like much time passed at all. Still, a thought nips at the surface of your mind, suggesting you need to move onto a new host. Only, your life has been a little different this time around. It has been peaceful, and you think it would sting you a little more now, knowing how good life can be, to take another's.", "action_results": [null, null]}]}]}, {"action": "“We also want to use that portal.”", "result": "The woman looks the two of you up and down. “Tell us what for,” she demands, “and maybe we'll allow it when we're done.” She shifts the book under an arm, leaving one hand open for emergent situations. You're fairly certain you don't want to mention the actual reason for using the portal.", "action_results": [null, null, null]}]}, {"action": "Try to ambush them", "result": "The two of you wait quietly, listening to the increasing noise of their approach. As a leg sweeps by, you strike the head of its owner, sending the man reeling. The flashlight is dropped, and a commotion ensues in darkness. An elbow crashes into your side, and you feel the rush of a wild swing missing you a finger's length away. Your fist finds someone's stomach; they let out a wheeze that couldn't be Kess, and you hone in. Haywire attacks connect to your face, your shoulders, and your legs throughout the melee, inducing little noises of pain. Something smashes your nose, and you make a violent kick at the source. After the ordeal calms down, you produce a light from the phone in your pocket. You see one of them knocked out and the other two trying to crawl away. You and Kess grab at them, one by one, and beat them until they stop moving.\n\n\nThe rectangle they were carrying is an unlabeled book, with long passages about ghosts, demons and darker things.\n\n\n“Looks like they might've been witches. Or at least thought they were. I wonder if they have anything to do with the portal,” you say.\n\n\n“Maybe.” Kess takes another look at them. “We'll throw them at it if they decide to do anything.” He draws in some air. “Any time you're ready then, Viktor. Stand about two feet from the portal.”\n\n\nYou walk over to its effervescing surface. Kess produces a sewing needle that he must've filched before leaving the house. He instructs you to open your hand. The needle dips in, under the skin, and emerges with a crimson droplet balanced at the end.\n\n\n“Now touch it to the portal and exhale your little puppet.”\n\n\nAs you do so, the wisps are drawn to the blood, and begin to eddy ominously around the pin. Stanley fights again, predictably weak despite his striving, as you breathe out. The wisps swirl in, to your throat and clutch at something unreal, or not quite of the same material as the world, withdrawing it, and Stanley's presence dulls away to nothing. Kess follows suit.\n\n\nIt's a strange feeling to own a body again, as the owner rather than the intruder. It's pretty evil, you acknowledge, that you sent Stanley to the Otherside when you fear it yourself. On the other hand, it's just survival, and you shelve the remorse, happy to return to the flitting world once more.\n\n\nKess and you part ways. The transgressions of that night get you labeled the prime suspect for murder, and you're forced to flee to other areas. You make friends again, getting caught up in the world of boating, among other simplicities you've forgotten you enjoy. You have to move now and then to evade notice from officials who might connect you to the past, but you manage to escape dicey situations. You pay Kess now and then through a cryptocurrency account he directed you to use, keeping your end of the bargain.\n\n\nThirty years pass, and you've grown fond of living. It's more peaceful than your original life, which is difficult to remember among your new, competing memories. Time keeps flowing onward, putting wrinkles on your face and pain in your joints. Looking back, having just turned eighty, is a funny feeling. It doesn't feel like much time passed at all. Still, a thought nips at the surface of your mind, suggesting you need to move onto a new host. Only, your life has been a little different this time around. It has been peaceful, and you think it would sting you a little more now, knowing how good life can be, to take another's.", "action_results": [null, null]}]}, {"action": "Start the ritual", "result": "“Quickly,” you urge.\n\n\n“Ok. Prick your finger with this, hold it in the portal, and exhale the host.” He produces a sewing needle that he must've filched before leaving the house.\n\n\nTaking it, you carry out the instructions. The wisps on the edge of the portal are drawn to the blood, and begin to eddy ominously around the pin. Stanley fights again, predictably weak despite his striving, as you breathe out. The wisps swirl in, to your throat and clutch at something unreal, or not quite of the same material as the world, withdrawing it, and Stanley's presence dulls away to nothing.\n\n\nIt's a strange feeling to own a body again, as the owner rather than the intruder. It's pretty evil, you acknowledge, that you sent Stanley to the Otherside when you fear it yourself. On the other hand, it's just survival, and you shelve the remorse, happy to return to the flitting world once more.\n\n\nJust as this occurs, a group of three steps into the room. They're lead by a black-clothed woman carrying a voluminous book. To her right is a man with a denim jacket, and to her left, a man with a hoodie. They're taken aback when they discover the room is occupied, but they recover.\n\n\n“Who are you?” the woman clips.\n\n\n“None of your damn business,” Kess retorts. He snatches the needle, performing the ritual in only seconds, and then turns to face the door. “We'll be leaving now,” he informs.\n\n\nThey watch intently as the two of you shuffle past. The denim-wearing one looks like he'd be happy to put that knife somewhere, but the three of them permit you to leave. Nobody wants to deal with cleaning up a body.\n\n\nThe two of you part ways. The transgressions of that night get you labeled the prime suspect for murder, and you're forced to flee to other areas. You make friends again, getting caught up in the world of boating, among other simplicities you've forgotten you enjoy. You have to move now and then to evade notice from officials who might connect you to the past, but you manage to escape dicey situations. You pay Kess now and then through a cryptocurrency account he directed you to use, keeping your end of the bargain.\n\n\nThirty years pass, and you've grown fond of living. It's more peaceful than your original life, which is difficult to remember among your new, competing memories. Time keeps flowing onward, putting wrinkles on your face and pain in your joints. Looking back, having just turned eighty, is a funny feeling. It doesn't feel like much time passed at all. Still, a thought nips at the surface of your mind, suggesting you need to move onto a new host. Only, your life has been a little different this time around. It has been peaceful, and you think it would sting you a little more now, knowing how good life can be, to take another's.", "action_results": [null, null]}]}]}]}, {"action": "Try to possess Greg to push out the other", "result": "In a risky move, you reach out and grab Greg, transferring to him. The half-presence here already has strict control over Greg's body, and you're immediately fighting for dominion. You close the mouth to stop the chanting, but a hand grapples the chin to keep it open. When you exert effort in any direction, it's denied from two angles. Stanley has regained his common sense and breaks for the door. You're beginning to wish you did that. Greg's face smiles. A small statue with demon-like markings on it, held in Greg's left hand, is raised to shoulder height. Suddenly, you're being pushed from the body, and an unnatural force is dragging you towards the statue. You sink into it, like iron to a magnet, and can't escape.", "action_results": []}]}, {"action": "Drive the car through the house", "result": "Given the layout of the house, there's a good chance you can just run Greg over. This could be a lot easier than dealing with whatever mess he's creating in there, if his ritual is working. It's basically impossible not to get the police called on you, though, so you'll have to find Greg sooner than later. You start the engine, reeling the car back to the end of the cul-de-sac. Stanley struggles feebly for control, but his attempts are easily quashed. You stomp on the pedal, aiming for the living room window in the front of the house, with drawn curtains. You plow through it, losing momentum, but drag on through the falling wood and drywall until you hear the thud of metal against flesh.\n\n\nYou step out of the vehicle, dazed and whiplashed. The brunt of the damage fell upon the fender, leaving your body alive and the car operational. That was a risky move. You turn on a light and glance under the car at Greg's lifeless corpse. A red mist-like substance jitters and swirls, clawing at the air with whip tendrils, only to recede in defeat. It's not a normal possession, that's for sure. Good thing he died before that found its way over.\n\n\n“Kess,” you call out, “there isn't a lot of time. I'm sure one of the neighbors saw me launch the car into the house. Show me where you are so I can bring you along in a convenient container and deliver you to a habitable body. Then I want to talk.” You walk around the rubble, seeing nothing for a few minutes. Perhaps he's no longer here. Then, a ghastly white fog emerges from a flashlight and circles to indicate its presence before returning. It occurs to you there are others in this hell house. “One more thing. If you aren't Kess, I'll personally return you to the Otherside. Come out again to confirm who you are.” It does, and you grab the flashlight. You hear the sirens of the police coming down to investigate. By the sound of it, there are two or three cars. They pull up to the scene with guns drawn. Convenient, if handled correctly.", "action_results": [{"action": "Walk outside to the officers", "result": "“I'm glad you're here,” you say, walking out of the newly-formed building hole. Officers instruct you to drop the flashlight and put your hands above your head. You comply, and one walks over to handcuff you. You manage to touch her wrist with a finger, and dart out along the boundaries where the skin connects. The woman you inhabit expects nothing, and is easily taken over. You finish handcuffing Stanley and grab the flashlight. You feign interest in its design, handing it off as a curiosity...easy contact. The search for suspects takes a little over two hours to fully wrap up. Stanley, being the only living suspect and owner of the car is booked for murder. It's a neat trick.\n\n\nNeither of you are required to stick around with the coroners. After waiting for most of the officers to get a head start, the two of you get in your respective vehicles and drive off. You go slowly, letting the cops fade into the distance ahead, then sidetrack onto the freeway. You pull off at a nearby trail, followed by Kess, and get out to talk.\n\n\n“I need to know how to push out a conscience,” you bluntly state. “The original. So I can live in this body through and past sleep, if you wouldn't mind sharing.”\n\n\n“Thanks for the body, by the way. I'll have to go find something to accomplish that myself. I'll be leaving you to do the same, Viktor. After all, there's only so much time left in the night, and I can't risk wasting it to train you on the few things I learned at old Greg's mad house,” Kess replies. “I suppose if you promise to pay me, wherever I go, so I can live a stable life without work, that would be fine by me. Just for a lifetime, mind you.” He twitches a bit. “Damn host has some fight in him. Say what you will; I need to get this done as fast as possible.”\n\n\nThere aren't many options. It's a promise to work for Kess in exchange for a permanent secret to immortality — the kind you thought you'd get when you first became a ghost. There's no guarantee of success, especially when his host has a lot of willpower. The alternative is to likely end up haunting a trinket for yet another year. All activities that delve into dark mysticism tend to carry the risk of oblivion when they go wrong, which is something you're not looking forward to.", "action_results": [{"action": "Agree to the deal", "result": "“Fine,” you reply. The two of you get in his patrol vehicle and drive, with Kess at the wheel. The car gets onto the freeway and heads North, passing by town. The patrol radio squawks orders to return to the station as it's silenced. After the first ten minutes, your mind departs from immediate concerns. Your thoughts start to linger on well-trodden grounds of uncertainty. Will you be vested in life, in lives, jumping from host to host ad nauseam? Will you ever feel that the inherited families are your own, or will you file them away as relics of the old hosts?\n\n\nKess interrupts the silence with his own thoughts. “So Viktor,” he begins, “let me tell you how things are going to work. We're going to drive up to Hyacinth Beach because I heard about it in one of Greg's ravings. We'll be away from the sand, up higher and into hills where there's some old military bunker. I know that area should have a portal somewhere that connects to the Otherside.”\n\n\n“No way. How do you know you even exist after you cross through it? All I know about it is black nothingness. We were there with the witches when we saw it.”\n\n\n“As if I'd forget a crucial moment in my life. I don't plan on finding out if there's an afterlife behind the curtain. It's possible to separate the host into the portal.” Kess replies. “I know the actions required.”\n\n\nHe continues to spasm on the drive, even flinging an arm off the steering wheel before regaining control. The car jerks accordingly, and after the third murder attempt on his host's account, he pulls over so you can take the driver seat. The rest of the drive is uneventful. It's interesting how much you appreciate downtime on the only eventful night since last year. The sky hovers above, the road sits below, and the whole world flits between. You cruise along for another half-hour before pulling into a residential network of streets. There's a medley of developments both new and historic along the downhill route.\n\n\nYou pull around an inclined bend to the right, drifting to the side of the road as Kess indicates. The moon beams down from the clear sky, throwing muted light across the grass on a nearby hill. You march towards it, revealing the corner of a forgotten concrete bunker as you crest a minor mound.\n\n\n“No!” Kess blurts, slugging himself in the head. “Get the fuck out of me!” His arms strain and pull inwards, erratically, making it difficult to pin him down. When you attempt to do so, your host's conscience doubles down on their exorcism attempt, and you're forced to release him. Your headache grows to a roaring cranial pain; you struggle to occupy the body. Kess fights even harder, falling to the floor and writhing. You scream internally. She fights a little less. You scream louder, and her edge faulters. You overpower her conscience, secure control, and rise to a stand. Kess is sprawled across the ground, but he looks stable. He raises a hand. You pull him to a standing position.\n\n\n“Ok, it should be in that bunker,” he says. “Follow me!” You jog with him to the perimeter, looking it over. It seems unoccupied. He motions for you to follow, and he leads through a series of rooms, using flashlights for illumination. He scours dozens of them before he finds the correct one: a gray, featureless crate of a room, with white scratchings on otherwise indistinguishable walls. Something black burbles, suspended, in the corner of the room. It has a wispy outer atmosphere, always curling and reaching. The heart is an inscrutable black canvas, wider and taller than any person, roiling inwards. It really is a fragment of the Otherside. How did it get here?\n\n\n“Go ahead and stand in front of it. I'll chant,” Kess offers.", "action_results": [{"action": "Begin the ritual", "result": "You move towards the physics-defying smear near the corner. It offers no smell, no sound, and no sights within. It only consumes. You open your mouth to ask what to do next when hands thrust you forward. You stumble from the force, enough to touch the blackness. Your fear spikes, your heart runs wild, and then the body slaps to the wall on the other side. It rolls down, lifeless, both souls absorbed within.\n\n\n“That's what you get, you damn ghost! Fuck you,” spits Kess's old host. His craze continues for a while, but it's all irrelevant to you now.", "action_results": []}, {"action": "Refuse to participate", "result": "The portal wobbles in place enigmatically, anchored by unfathomable means. Staring at that inky mass of nullity, your confidence wanes. You're fairly certain Kess is using you to test the experimental ritual.\n\n\n“Hey, Kess. I'm not doing it. You go ahead if you want.”\n\n\nHis face contorts. “What? Of course you are. How could you not?!” He isn't acting like Kess, and you begin to get a sinking feeling that Kess was expelled in his struggle. You see him going for the taser on his belt, and you lunge, catching him around the midsection. The two of you roll across the ground. You pin his arms, but he catches knees below your stomach and kicks you away. Stumbling backwards, you grapple his wrist, jerking him across the floor. You motion to kick at his head, but cancel the movement in order to throw your hands over the taser he's removing from its holder. You intercept him again, but he rolls himself over you, pinning your sides with his lower legs, and proceeds to deliver blows to your head.\n\n\nUnder the influence of repeated knuckle impact, you manage to fumble the taser off of your belt and fire it against his head. He jitters from the electricity, giving you enough time to stand up, but he clutches to your chest. He uses it as leverage, causing you to stumble backwards from the weight. You wrap arms around him just as you realize you're losing your balance in the direction of the portal.\n\n\nYour leg crosses the threshold, followed by your chest, your head, and then his. Both of your bodies fall to the ground, now empty husks, and it all becomes unimportant.", "action_results": []}]}]}, {"action": "Hide inside", "result": "With the flashlight in hand, you hide under the car inside. Officers run in; you can hear their shoes clattering on the wood floor. You start feigning shock, breathing whole lungfuls of air in and out, and even twitching now and then. Someone orders you to come out. You do, and they ask you, calmly, to place your hands behind your back. You set down the flashlight, expecting you'll be able to touch their wrist, but they remain cautiously out of reach. Damn. Everyone stands in place, warily watching their only suspect, until the search is complete. You have no choice but to wait and watch. They return, and a murder charge is dropped on your head. From that point on, it becomes impossible to rectify the situation. Nobody makes direct contact to the flashlight, or to you, and you're placed in a holding cell at the end of the night. You grow tired, to your mounting terror. No, it can't end like this. You struggle to press Stanley entirely out of the body, not knowing how, but he's playing the endgame card. He followed your thoughts well enough to know what's going on.\n\n\nSometime when he awakes, just before your conscience rouses, you're exhumed from the body, whereupon you dissipate into oblivion. You might've ruined his life, but he ruined your afterlife.", "action_results": []}]}]}]}]}, {"action": "Take the offer and leave", "result": "“Fine, let's do that,” you say. You're not sure what's going on with your personality. It doesn't even feel like you. You snatch the money out of Paul's hands when he returns with it, and leave wordlessly. You kick in the pumpkins on the porch, making your way to the car. A headache erupts out of nowhere, creating pockets of numbness that annex the body, then recede, seconds later. You watch yourself get into the car and start driving, but you're controlling none of it.\n\n\nHijacking the body took little effort. Stanley had a weak mind. You probably didn't have to play friends with his uncle before taking full possession. His kind of personality would've cracked under violence, making your life even simpler. You start up the car, reading Stanley's mind with ease. You get on the highway, heading off to find your old friend, Kess. He should be occupying a sorry vase in Greg's home, and he knows more than you about sticking around after Halloween.", "action_results": [null]}]}]}]}