{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=32087", "context": "", "first_story_block": "You are Lucy Janis, aka, 'The Hippie' or a former cashier at the town's local corner store.\n\n\n\nThere's not much about you, expect you're in your early twenties, you work as a cashier at a corner store in the small town of Quietus, you've graduated college, and you live in an apartment complex.\n\n\n\n\n\n ", "action_results": [{"action": "Onward, my trusty steed!", "result": "Ahh yes, day-shift.\n\n\n\nIn your ol' black-ish blue beater car, you roll into the parking lot of your $5 an hour day-shift job. \n\n\n\n\"Alright, another day wasted.\" You say to yourself, rolling your eyes as you unbuckle your seat belt. You look at the rear-view, glancing at your shitty eye makeup job. Sure, you're not no makeup artist, but you could've done better.\n\n\n\nYou quietly shame yourself, grabbing the door handle of the box car.\n\n\n\nYou step out onto the asphalt parking lot, looking around at the other cars in the parking lot. Left, two spaces to you, there's a white pick-up, you recognize it as Tom Filler's truck, aka, 'the guy who always shows up to work, but never is actually out working, more in the back smoking a cigar, but gets paid' type of guy. To your admit, you're honestly kind of jealous of Tom. Hardly ever works, still gets paid, sounds good to you!\n\n\n\nOn the right side of you is Grammy Crystal's  gold Toyota Avalon.Grammy Crystal isn't her actual name, you just enjoy calling her that because she's most likely over 50. Crystal's always bitching about her grandkids and how they have high quality careers, while she's stuck at a corner store. She's nice to you, so you don't mind her too much. Just kinda nod your head and smile.\n\n\n\nEnough daydreaming, you've got your $40 dollars to make! (Your shift is from 8 am until 4)\n\n\n\n ", "action_results": [{"action": "Enter", "result": "You entered the corner store, immediately greeted by the smell of a freshly cleaned gas station and the familiar chime of the door opening. An open sign is displayed on the door, and Stone Temple Pilot's Plush is blasting throughout the store. You, Tom, and Crystal have turns on music choice, this pick is probably Tom's, since Crystal usually picks some weird 50's songs. \n\nYou make your way to the counter and go behind it, shoving open a white door. You spot Tom sitting down on the floor in front of a big black bulky TV that's been set on milk crates.\n\n\n\n\"Mornin' Lucy.\" He nodded at you as you picked up a basket filled with clip-on name tags. \n\n\n\nYou found yours, clipping it onto your light red shirt. You adjusted your shirt and your 'hippy jeans', nodding back at him. \n\n\n\nTom started up again, \"Monday, ha, I hate mondays.\" He said in a old man trucker voice, scoffing at the word Monday. \n\n\n\nYou shrugged, fighting off the urge to make a smart ass comment 'why do you hate them? You don't work anyway.'\n\n\n\nYou decided to not start a fight at 8 AM, and just nodded again.\n\n\n\nOverhearing the chime of the front door, you pushed open the back door, letting yourself out behind the counter. \n\n\n\nGrammy was stocking shelves in the far back, too busy to hear the customers come in.\n\n\n\nThe corner store was in a strange format.\n\nThe front door was on the far left, as you walked in, you'd see shelves in front of you. Right of the shelves is the counter and the back room is behind it. On the left of the shelves you'd see refrigerators/freezers and a bathroom at the end. Behind the shelves was a few pop and coffee machines.\n\n\n\nThe customers were two thin nerdy looking kids. They went to the refrigerators, grabbed two cokes, then made their way up to the counter. You rang them up and they left. Nothing special.\n\n\n\n\n\n\n\n ", "action_results": [{"action": "Go back into the back room and talk to Tom", "result": "You decide to go to the back room and leave Crystal with the stocking job. \n\n\n\nYou open the white door and find Tom. You invite yourself to take a seat.\n\n\n\nYou start a conversation about\n\n ", "action_results": [{"action": "The weather", "result": "Out of all the topics, you start talking about the most boring one, the weather.\n\n\n\n\"It's been pretty stormy lately, when do you think it might start clearing up again?\" You asked, glancing over at him.\n\n\n\nTom is staring intently at the TV screen, pretty much ignoring what you're saying. \n\nHe's watching the news, something about a virus going around, turning people into brain dead cannibals. The news switched to clips of people eating each other's limbs, then being carelessly shot by others sometime later.\n\n\n\nYou decided to\n\n ", "action_results": [{"action": "Leave him", "result": "You finally got up, leaving Tom to his beloved TV.\n\n\n\nYou went back out, behind the counter, waiting for some more customers.", "action_results": [{"action": "Tom comes into the main area", "result": "Tom comes in the main area, his deep tanned is faded in a ghostly pale paste.\n\n\n\nHe looks as if he's about to faint.\n\n\n\nCrystal made her way up to the counter, somewhat leaning on it.\n\n\n\nTom was standing behind you, his mouth hanging open. \n\n\n\nYou reached up, placing your hands on his shoulders. Surely, he was taller than you, but you made it work. \"Tom, you alright?\" You said in a bit of concern and panic.\n\n\n\nAll he said was, \"They're here.\" Then fainted.\n\n\n\nHe fell into your arms, you stumbling back on impact.\n\n\n\nCrystal hobbled over to you, instructing you to put him in the back. You did as she said.", "action_results": [{"action": "Sometime Later", "result": "Tom still isn't awake, more people came in, etc, etc.\n\n\n\nSomething doesn't feel right though.\n\n\n\nWhat's 'they're here' mean? You think to yourself, leaning on the counter.", "action_results": [{"action": "Suddenly", "result": "All of a sudden, sirens are blaring outside, people are running and screaming, and chaos is erupting. \n\n\n\nCrystal hears, and comes out from mending Tom. \n\n\n\n\"The hell?\" She grumbles, going outside of the store.\n\n\n\nWatching her from beyond the counter, you see her being approached by some sickly-looking green human-creature thing.\n\n\n\nThe creature is limping, it's arms are thrown up into the air, and it's almost groaning.\n\n\n\nYou shout for Crystal, but she can't hear behind the doors.\n\n\n\nThe creature grabs her and begins biting her. Her screams and painful moans are heard everywhere, they were loud.\n\n\n\n\"O-Oh my G-God..\" You watch the creature feast on your co-workers limbs from the counter. Not sure if it's reality or not, you step back, hunch over, and throw up the contents in your stomach.\n\n\n\nYou sluggishly wipe your mouth, and rush over to the front doors, quickly closing and locking them. You don't bother to flip the open sign to close. You try and keep your head up because beyond those doors, right in front is used-to-be Crystal, and beyond the parking lot is a world filled with those creatures. ", "action_results": [{"action": "At 6 PM", "result": "It's now 6 PM, Tom's awaken, you've explained 'Old Lady Helga's death, and the banging on the doors increased. \n\n\n\nTom is handling this whole situation pretty well, expect he's not gonna be running around, killing people any time soon.\n\n\n\nLucky for you guys, the TV still works (replaying a news broadcast), the store has power, and the radio is now switched to dead silence. Tom and you are camped out in the back, watching the broadcast.\n\n\n\n\"Minute by minute, hour by hour, people are dying.\" The spokeswomen says, gesturing to the ruins behind her. (Burning houses, broken windows, stranded cars, crashed into poles, people screaming, and those sickly green-ish pale creature chasing them.\n\n\n\nPretty soon, the cameraman drops the camera and runs, the spokeswoman is left, screaming in pain, being eaten. \n\n\n\nTom flinches at the screams, closing his eyes. \n\n\n\n\"W-We've gotta do something, Luc.\" Tom mumbles, glancing over at you.\n\n\n\nHuh? What's this crazy bastard talking about? He's in no sh- Alright, you're in no shape to be running around, killing those pale freaks. You think to yourself, sighing.\n\n\n\n\"I dunno..\" You start. \"Think you can cope?\" You returned the glance, giving off a somewhat nervous/concern vibe and expression.\n\n\n\nTom nodded, \"Oh yeah, I'll be fine, sweetheart.\" He smiles, speaking in his normal scruffy tucker accent.", "action_results": [{"action": "Try to convince Tom otherwise", "result": "\"Well, Tom, are you sure you wanna go out there and become a killer? Surely you have family, what will they think?\"\n\n\n\nHe shrugged, \"Honestly, they're probably dead.\"\n\n\n\nSomething else in the broadcast caught both of your attention\n\n\n\nSYMPTOMS & TURNING Was across the screen. \n\n\n\nA man in front of the camera casually read the symptoms.\n\n\n\n\"The virus's symptoms include; High fever, vomiting, groaning, light headedness, anger, biting at your own limbs, and going in and out of reality.\" The man glanced at the camera, then started with the effects/starting points of people turning, without cards.\n\n\n\n\"When someone gets bit, they always turn into 'one of them'. Doesn't matter where the individual got bit, just know that they turn. The screams erupting from their vocal cords and the blood splattering from the bite is the last time you'll see them normally function. After a few minutes, a bite mark appears. The spit from the creature goes into the individual's bloodstream, infecting everything. The infection starts from the inside, working it's way out. 20 minutes from the bite, the symptoms kick in, worsening the person's body/mind. If a loved one is bit, don't seek for a medic's attention. THERE IS NO CURE. The only way to kill one of these creatures is directly through the brain or the heart. These creatures do not feel pain like humans, so it's pointless to slice and dice their decaying body. If there's anyone listening right now, stay indoors or find sheleter.\"\n\n\n\nThe TV goes blank, leaving you both in silence. Tom starts hitting the sides of the TV, cursing. \"Damn thing, piece of shit!\" He gripes, basically throwing a tantrum. As he's doing all that, the chime of the door opening alerts you both to stay frozen in place. Right now, that chime sounds like death to you.\n\n\n\n\"Hello? Is anyone in here? I need some help!\" Someone yells, sounding like a teenager. ", "action_results": [{"action": "Stay in the back with Tom", "result": "You decide to not move from the back. \n\n\n\nThe white door opens eventually, displaying a girl, around 15 or so. She had brown hair, put into a normally straight side bang. Tattered clothes, and a frown burned into her mouth. \n\n\n\nShe wasn't alone though, someone was on her back, looking around 7 or 8. Her eyes were closed, her bleach blonde hair pushed off into a pony tail. She had pale sick skin, but no trace of green like the creatures. Her face was a wreck, glass in her arms and legs, looks like she's been through hell already.\n\n\n\nTom eyed the two, quickly standing up. \"You.\" He pointed to the first girl, then the floor. \"Put the girl down. Everything I say to you from now on is an order, not a request.\" \n\n\n\nThe 15 year old nodded, gently placing her friend down. \n\n\n\n\"Spread your arms out wide.\" Tom commanded, the girl doing as told. Tom scanned her body for bites, luckily finding none. \n\n\n\n\"How'd you get in here without any bites, missy?\" Tom stepped back, looking her up and down.\n\n\n\nThe girl shrugged, speaking with a heavy Australian accent. \"Those things are attracted to noise, I threw a bottle and they followed. Easy.\"\n\n\n\nTom grinned, walking over to the girl's friend, checking her for bites and he talked. \"And your friend here? Happened to her?\"\n\n\n\nThe girl kicked at the ground. \"She's not bit. She was in a car accident.\"\n\n\n\nShe sighed, looking down at Tom and the child. \"I found her. I don't know her. You see, I was wandering around, looking for weapons and food. She was in a flipped upside down car, banging on the window. Her family was dead next to her and the buckle was stuck. The great thing was, no creatures were there, so I simply told her to roll down the window and I cut the seatbelt with my pocket knife.\" The girl grabbed her pocket knife, showing it at him.\n\n\n\nYou stood there, keeping a watchful eye on everyone.\n\n ", "action_results": [{"action": "Time passes (20 mins)", "result": "20 minutes have now passed, everyone is now just doing nothing, waiting for the girl to wake up. You're leaned against the counter, Tom is wandering around the store, looking out of the windows, and the 15 year old (Charlotte Marquez) and the girl is sitting in front of you, the girl, then Charlotte. \n\n\n\n\"So.. Are we the last people alive?\" Charlotte asks, looking towards you.\n\n\n\nYou shrugged, deciding to", "action_results": [{"action": "Nod", "result": "You simply nodded at her, saying nothing else.\n\n\n\nCharlotte raised an eyebrow. \"You don't talk much.\" \n\n\n\nAll of a sudden, Tom broke out into song.\n\n\n\n\"I WISH THAT I HAD JESSE'S GIRL. WHERE CAN I FIND A WOMEN LIKE THAT!\"\n\nHe began dancing around awkwardly in front of the window.\n\n\n\nYou and Charlotte both laugh at him.\n\n\n\nTom goes over to you, offering a hand down to you.\n\n\n\nYou\n\n ", "action_results": [{"action": "Accept Tom", "result": "You accept Tom's offer, latching your hand onto his.\n\n\n\nYou both began dancing, laughing, and smiling. Not romantic, not at all. Just, y'know, 'I'm gonna dance with you because you might die in the next hour dance'. That's it.\n\n\n\nHe spins you around, then continues causally dancing. \n\n\n\nCharlotte watches, clapping her hands and laughing.", "action_results": [{"action": "1hr later", "result": "It's been an hour. You're still sitting down by the counter. The violent banging on the front door is somewhat scaring you. You're sure the glass will break any second.\n\n\n\nThe girl has woken up, Charlotte and her are in the back with Tom. Tom is helping with plucking out the glass. Occasional screeching and screams from the girl assure that.\n\n\n\nA couple minutes later, they all come out again.\n\nCharlotte sighed, setting the girl down. Tom wanders around the store, teasing the creatures beyond the door.\n\n\n\n\"Got a name, Blondie?\" You smiled at the 7/8 year old. She nodded. \"Lara. Lara Campos.\"\n\n\n\nTom over hears, blurting out. \"James. James Bond.\"\n\n\n\nYou, Charlotte, and Lara all roll your eyes at his comment.\n\n\n\nTom frowns at the windows and the creatures. \"We should leave. We can't stay here forever.\"\n\n\n\nYou", "action_results": [{"action": "Agree with Tom", "result": "You nodded in agreement, standing up and stretching. \n\n\n\nCharlotte and Lara do the same. \n\n\n\nCharlotte asks, \"Where should we go, Luc?\"\n\n\n\nWhile you and Charlotte are discussing safe places to go to, Tom looks for 'supplie holders'.\n\n\n\nHe rushes behind the counter, into the back room. He comes out with a single backpack and a  bright blue duffle bag. Tom throws the duffle bag at you, instructing you to fill it up with necessities.\n\n\n\nHe begins going around the corner store, shoving supplies into this backpack, you doing the same.\n\n\n\nAfter you guys finish filling up the 'supplie holders' you bring up the discussion you and Charlotte had.\n\n\"Where are we gonna go? Charlotte suggested a forest, a house, or an empty building.\" \n\n\n\nTom put the backpack on, shrugging. \"Up to you. But, that's not important right now. What's important is getting out of here.\"\n\n\n\n\n\nYou nodded and decided to", "action_results": [{"action": "Be smart", "result": "You decided to be smart and go to the back door of the corner store. The back door of the corner store is fenced in, so the creatures are all on the outside. \n\n\n\nAs you were unlocking the door, Charlotte ran by a freezer, grabbed a glass bottled refreshment, dumped all of the drink out, and then ran over to you, Tom, and Lara. \n\n\n\nYou finished unlocking, then let Charlotte out first. She chucked the bottle far away from the corner store, attracting some creatures from the front, and creatures from the back to follow the bottle.", "action_results": [{"action": "A random house", "result": "You decide to get pick the nearest house. Sounds bad, but then sounds good at the same time.\n\n\n\nYou pick a normal looking enough house. Nothing special. \n\n\n \n\nYou realize it's owned, but no one\n\n\nlives there right at this moment of course. It's 7:20 PM after all.\n\nit's dark (despite the picture), and you're tired.\n\n\n\n\n\nYou call dibs on the couch and fall asleep. The others soon joining you.\n\n\n ", "action_results": []}, {"action": "A abandoned building", "result": "You decide to look around for an abandoned building. Surely everyone has fled by now, right?\n\n\n\n\"Let's look for an abandoned building.\" You smiled, nodding.\n\n\n\nYou four all continued walking down the sidewalk, trying to dodge un-dead best you could.\n\n\n\n\"Hey!\" Lara called out, pointing to a big office building, a skyscraper at that. \"How about that?\"\n\n\n\nTom says yes, Charlotte agreed with her. You said nothing.\n\n\n\n\"But..\" You started. \"Won't there be a bunch of creatures in there? It's pretty big, and people work on Mondays. They probably didn't lock the doors either.\"\n\n\n\nThey all stopped, reconsidering.\n\n\n\n\"Nahh, they've probably all cleared out by now. Don't overthink.\" Tom remarked.\n\n\n\n\"Alright, well...", "action_results": [{"action": "Let's continue then.\"", "result": "\"Alright, well, let's continue then.\" You nodded in agreement with Lara's choice.\n\n\n\nIt's far away from the corner store, but fuck it, nothing's too far now.\n\n\n\nYou all arrive, causally filtering into the main office. Blood splatter, gory, papers everywhere, chairs flipped over, and paintings knocked onto the ground greets you when you walk in.\n\n\n\n\"Uh.. We're staying here? For how long?\" You ask. \n\n\n\nTom sighs, \"However long you girls decide.\"\n\n\n\nBy now, the time is 7.20 PM, it's dark, and you're extremely tired. \n\n\n\n\"I'm gonna find somewhere to sleep.\" You suggest.\n\n\n\nCharlotte and Lara raised their hands. \"I'm coming!\" Charlotte says. \"Me too!\" Lara blurts out.\n\n\n\nThere's stairs on one side, and an elevator on the other side of the room.\n\n\n\nYou pick \n\n\n\n ", "action_results": [{"action": "The elevator", "result": "You, Charlotte, and Lara try the elevator. \n\n\n\nStill works, sweet! You think to yourself.\n\n\n\nThe elevator opens, creatures are just standing there (4), beating their heads against the mirrors.\n\n\n\nThe ding of the elevator turns them around. Now, they're looking at you three. Without time to react, they limp forward, grab you, Charlotte, and Lara, starting to eat you. You all scream and screech.\n\n\n\nThis is what you get for trying the easy way out.", "action_results": []}, {"action": "The stairs", "result": "You decide you need to work off that Mc.Donalds you had for breakfast off of your thighs. \n\n\n\nYou, Charlotte, and Lara hike up two flights of stairs, coming to a small room with a locked door. Charlotte looks through the door's window, telling you what she sees inside.\n\n\n\n\"There's a bunch of cubicles. It looks cleaned though- L-Lucy!\" \n\n\n\nCharlotte backs away in a panic. \"There's people inside!\" \n\n\n\nYou take a look for yourself, seeing a man with a fire extinguisher in his hand, sitting next to a wounded woman that's on laying the  floor.\n\n\n\nYou glanced around the room, spotting numerous broken windows and doors, thrown computers, paper everywhere, and bloodstained carpet/walls.\n\n\n\nThe woman is painfully moaning and groaning, the noises of the man hushing her can be heard.\n\n\n\nLara states the obvious. \"She doesn't sound so good. Think she's sick?\"\n\n\n\nYou mumbled, looking down at Lara. \"Probably.\"\n\n\n\nThe man spots you, running over to the door in a state of relief. \n\n\n\nHe unlocks the door, you letting off and backing away, Charlotte and Lara doing the same.\n\n\n\nHis voice is a regular guy-from-Boston accent. \"H-Hey!\" He smiles at you, then gestures inside.\n\n\n\n\"You guys gotta help me, my wife isn't in good health.\" \n\n\n\nYou stare at his weapon, the fire extinguisher. \"Uh..\"\n\n\n\nHe notices, dropping it behind him. \"I won't hurt you. You're all human, right?\" He chuckles nervously.\n\n\n\n\"P-Please, help us.\"\n\n\n\nYou", "action_results": [{"action": "Help him", "result": "You're a sucker. \n\n\n\n\"Yeah.. I can help.\" You boldly say, \"Under one condition.\"\n\n\n\nHe nodded, \"What's that?\"\n\n\n\n\"Once I help your wife, you let us stay and sleep.\"\n\n\n\nThe man nodded again, \"Yeah, yeah, sure thing!\"\n\n\n\nYou tell Charlotte and Lara to stay out by the stairs while you deal with the wife. They do as you said, you going into the room.\n\n\n\nThe woman weakly smiles at you as you kneel. \n\n\n\nOh shit, wait, I dunno how to help..\n\n\n\nThe news board began ringing through your head. \"There is NO cure.\"\n\n\n\nYou ask the man for his fire extinguisher. He questions you, but gives it up, saying, 'well you're the doctor, not me.'\n\n\n\nThe woman smiles at you again. You stand up, dropping it onto her head. Her brain splats, and blood puddle forms.\n\n\n\nThe man turns angry, grabs the weapon and knocks you down with it. He then smashed it onto your head, no hesitation. \n\n\n\nCharlotte and Lara ended up running downstairs, got Tom, Charlotte gave him her pocket knife, he ran upstairs, and killed the man who killed you.\n\n ", "action_results": []}, {"action": "Turn around", "result": "Without another word, you three just walk back down the stairs and find Tom again.\n\n\n\nTom locks the front doors, and asks you about what happened.\n\n\n\n\"Nothing much. Found people. Infected though.\" You said, laying down.\n\n\n\nPretty soon, you all fell asleep.", "action_results": []}, {"action": "Don't help", "result": "You decided to pass up the offer. \"Sorry, none of us are doctors.\"\n\n\n\nThe smile from his face fades. He yells, \"Fine, leave then!\" and begins violently swinging the fire extinguisher around. He points down the stairs.\n\n\n\n\"Alright, good luck.\" You remark back.\n\n\n\n You three just walk back down the stairs and find Tom again.\n\n\n\nTom locks the front doors, and asks you about what happened.\n\n\n\n\"Nothing much. Found people. Infected though.\" You said, laying down.\n\n\n\nPretty soon, you all fell asleep.", "action_results": []}]}, {"action": "Stay where you are", "result": "With the looking around you guys did, you decided it'd be best just to stay where you're at.\n\n\n\nTom locks the front doors, and sits down, laying down eventually.\n\n\n\nPretty soon, you all fell asleep.", "action_results": []}]}, {"action": "Goodluck dying!\"", "result": "\"Alright, well, good luck dying!\" You stop and turn around, walking off from the group.\n\n\n\nYou walk and walk, finding yourself back at the corner store. You stupidly walk in front, attracting all of the creatures with your loud ass footsteps. \n\n\n\nThey grab you, bite you, and you're infected. That easy.\n\n\n\nShould've stayed with them. You have no weapons to fight with anyway.\n\n\n\nWhat'd you expect, being a lone survivor would do you good?", "action_results": []}]}, {"action": "A forest", "result": "You decide a forest would be a good place. \n\n\n\nLuckily, you know a nearby forest. You hike into the forest, sitting down in the middle of it.\n\n\n\nMan, I'm hungry. You say to yourself, placing the duffle bag down.\n\n\n\nYou begin sorting through it, looking for something to eat.\n\n ", "action_results": [{"action": "Look through the duffle bag for something to eat.", "result": "You sort through it, grabbing one of those swiss roll things. You happily tear the thing open, eating one. \n\n\n\nAfter your snack, you stuff the wrapper into a small side pocket on the duffle bag.\n\n\n\nYou then lay back, falling asleep.\n\n\n\n ", "action_results": []}]}]}, {"action": "Be stupid", "result": "You decided to unlatch the front door open. \"Hi friends!\" You squealed, running towards the creatures. Grammy Crystal grabbed you and began feasting on your limbs. \n\n\n\nThe others poured into the store, grabbing Tom, Charlotte, and Lara, infecting them all.\n\n\n\n\n\nLucy, I thought you were smarter, god damn.", "action_results": []}]}, {"action": "Disagree", "result": "You shook your head, staying slumped against the counter. \"We have no place to go. No vehicles. It's pointless.\"\n\n\n\n\n\n10 minutes passed, the creatures finally broke through the door. They started pouring in, three grabbed Tom. He began shouting and screeching. Pretty soon him yelping was muffled.\n\n\n\nTwo grabbed Charlotte, she tried fighting them off by stabbing their chests. Didn't work. She shouted and scuffled, bit and shuffled, then finally her noises were muffled like Tom's.\n\n\n\nLara watched them both, melting down and crying. She fell to the ground, creatures quickly ending her crying and screaming.\n\n\n\nYou just sat there. Closed your eyes and waited.\n\n\n\nWhy were you so stubborn? \n\n\n\n\n\nBeing stubborn causes death, y'know.", "action_results": []}]}]}, {"action": "Deny Tom", "result": "You smiled up at him, shaking your head. \"No.\" You continued laughing along with Charlotte. \n\n\n\n\"Suit yourself!\" He smirked, dancing around stupidly some more.", "action_results": [null]}]}, {"action": "Scare Charlotte", "result": "You then get a wicked idea, smirking evilly.\n\n\n\n\"Probably. If you're lucky, you'll have to go out and find a pretty boy to reproduce with to start up the population again. Tom's mine.\" You laughed. \n\n\n\nTom glanced over at you three, chuckling.\n\n\n\nCharlotte made vomiting sounds, \"EW!!\" She glanced at your nametag, \"Lucy, I'm 15! He's to old for you anyway!\" She rolled her eyes, with a disgusted expression.\n\n\n\nYou just continued laughing.", "action_results": [null]}]}]}, {"action": "Help the new comer", "result": "You walked out of the back room. \"Yeah, relax. We're humans.\" You smiled, the teenager coming closer to you. You stepped out from behind the counter, into the main area. Tom followed through, standing in front of you.\n\n\n\n It was a teenaged girl, around 15 or so. She had brown hair, put into a normally straight side bang. Tattered clothes, and a frown burned into her mouth. \n\n\n\nShe wasn't alone though, someone was on her back, looking around 7 or 8. Her eyes were closed, her bleach blonde hair pushed off into a pony tail. She had pale sick skin, but no trace of green like the creatures. Her face was a wreck, glass in her arms and legs, looks like she's been through hell already.\n\n\n\nTom eyed the two, quickly standing up. \"You.\" He pointed to the first girl, then the floor. \"Put the girl down. Everything I say to you from now on is an order, not a request.\" \n\n\n\nThe 15 year old nodded, gently placing her friend down. \n\n\n\n\"Spread your arms out wide.\" Tom commanded, the girl doing as told. Tom scanned her body for bites, luckily finding none. \n\n\n\n\"How'd you get in here without any bites, missy?\" Tom stepped back, looking her up and down.\n\n\n\nThe girl shrugged, speaking with a heavy Australian accent. \"Those things are attracted to noise, I threw a bottle and they followed. Easy.\"\n\n\n\nTom grinned, walking over to the girl's friend, checking her for bites and he talked. \"And your friend here? Happened to her?\"\n\n\n\nThe girl kicked at the ground. \"She's not bit. She was in a car accident.\"\n\n\n\nShe sighed, looking down at Tom and the child. \"I found her. I don't know her. You see, I was wandering around, looking for weapons and food. She was in a flipped upside down car, banging on the window. Her family was dead next to her and the buckle was stuck. The great thing was, no creatures were there, so I simply told her to roll down the window and I cut the seatbelt with my pocket knife.\" The girl grabbed her pocket knife, showing it at him.\n\n\n\nYou stood there, keeping a watchful eye on everyone.", "action_results": [null]}]}, {"action": "Agree with Tom", "result": "\"Alright then. Let's g-\" You stood up, but Tom reached up, pulling you back down. \n\n\n\n\"Listen.\" He motioned with his hand to the screen.\n\n\n\nSomething else in the broadcast caught both of your attention\n\n\n\nSYMPTOMS & TURNING Was across the screen. \n\n\n\nA man in front of the camera casually read the symptoms.\n\n\n\n\"The virus's symptoms include; High fever, vomiting, groaning, light headedness, anger, biting at your own limbs, and going in and out of reality.\" The man glanced at the camera, then started with the effects/starting points of people turning, without cards.\n\n\n\n\"When someone gets bit, they always turn into 'one of them'. Doesn't matter where the individual got bit, just know that they turn. The screams erupting from their vocal cords and the blood splattering from the bite is the last time you'll see them normally function. After a few minutes, a bite mark appears. The spit from the creature goes into the individual's bloodstream, infecting everything. The infection starts from the inside, working it's way out. 20 minutes from the bite, the symptoms kick in, worsening the person's body/mind. If a loved one is bit, don't seek for a medic's attention. THERE IS NO CURE. The only way to kill one of these creatures is directly through the brain or the heart. These creatures do not feel pain like humans, so it's pointless to slice and dice their decaying body. If there's anyone listening right now, stay indoors or find sheleter.\"\n\n\n\nThe TV goes blank, leaving you both in silence. Tom starts hitting the sides of the TV, cursing. \"Damn thing, piece of shit!\" He gripes, basically throwing a tantrum. As he's doing all that, the chime of the door opening alerts you both to stay frozen in place. Right now, that chime sounds like death to you.\n\n\n\n\"Hello? Is anyone in here? I need some help!\" Someone yells, sounding like a teenager. ", "action_results": [null, null]}]}]}]}]}, {"action": "A customer comes in", "result": "A women and a child comes in, the women grabs some sleeping pills, the child grabs a Mr.Goodbar. \n\n\n\nYou ring them up and they leave, just like the kids.", "action_results": [null]}]}]}, {"action": "Aliens", "result": "\"Y'know what's really cool? Space. Aliens.\" You smiled over at Tom.\n\n\n\nTom is staring intently at the TV screen, pretty much ignoring what you're saying. \n\nHe's watching the news, something about a virus going around, turning people into brain dead cannibals. The news switched to clips of people eating each other's limbs, then being carelessly shot by others sometime later.\n\n\n\n\n\nYou decide to\n\n\n \n\n \n\n \n\n \n\n \n\n ", "action_results": [null, null]}, {"action": "Family", "result": "\"Random question, but what's your family life like? Are you married? Have kids?\" You questioned, tapping Tom's shoulder.\n\n\n\nTom is staring intently at the TV screen, pretty much ignoring what you're saying. \n\nHe's watching the news, something about a virus going around, turning people into brain dead cannibals. The news switched to clips of people eating each other's limbs, then being carelessly shot by others sometime later.\n\n ", "action_results": [null, null]}]}, {"action": "Help Crystal stock", "result": "You go to where Grammy is and begin helping her stock the shelves. \n\n\n\nAs you finish up, she smiles widely and croaks out in an old women voice, \"Ooh, thank you, Dearie.\" \n\n\n\nYou returned the smile, going back behind the counter afterwards.\n\n\n\n ", "action_results": [null, null]}]}]}]}