{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=11142", "context": "", "first_story_block": "Your eyes snap open as you realize the odd smell. It smells like vomit. You gag and sit up. Your in a dark room, filled with random items. You see a spoon to your right. To your left, a toaster. You slowly get up, but as you do you notice something out of the corner of your eye. It looks like a person curled up in a ball.", "action_results": [{"action": "Go over and try to talk to him", "result": "You walk over and touch his arm. He looks up at you. His beady eyes seem to stare right into your soul. His mouth seemed to be sewed shut. He made a sound. You leaned over closer to try to hear him, but it only cam out as a soft grunt. \"I cant understand you.\" You say. He looks at you with pleading eyes, then when he realizes your telling the truth he sinks back into a ball.", "action_results": [{"action": "Search the room", "result": "You find an assortment of items, none that seem at all useful. You sit down, more confused then you were when you woke up. You rest your head on your hands and try to close your eyes, but the open with every sound. You lean against the wall and take a deep breath. You stand up again and see what looks like a door.", "action_results": [{"action": "Go to the door", "result": "You see a light from the hallway through a crack in the door. You lie down and try to peak under it, but its useless. You thrust your hands in your pockets out of anger, and find that your finger has made contact with something cold and metallic.", "action_results": [{"action": "Look in pocket", "result": "You pull out a key. You have never seen this key before, but before you could even think of where you found it you knew what to do with it. You searched the door for a key hole and when you found it placed the key in. It fit perfectly. The thing in the corner looked up, its beady eyes searching frantically for what caused such a bright light. Its mouth moaning through the sewing. It tried to stand up. As it stood i noticed it had no arms. It seemed to sway as it walked. It let out a squeal and backed away, falling back down and going back into a ball.", "action_results": [{"action": "Turn around", "result": "You come face to face with a monster. Its face was of a human, but a human that had undergo multiple face surgeries. scars made up most its face. It opened its mouth to speak, opening more wounds from the badly stitched wounds on its face. As it is cringing in pain, what do you do?", "action_results": [{"action": "Run around it and into the hall", "result": "You run past it and into the hall. You are about to run down the hall when you hear a terrible screeching noise behind you.", "action_results": [{"action": "Turn around", "result": "You turn around to see the thing standing and opening its mouth. Its lips are tearing and its making terrible sounds. You lean over and throw up. You hear the moan of the monster with the stitching and you spin around. It has recovered and is lumbering for you. You walk backwards until your backed up against a wall. You look over and see the thing open its mouth, and in a scratchy, unused voice, it said, \"Grab the knife.\"", "action_results": [{"action": "Grab the knife", "result": "Your eyes scan the ground until they lock on a knife. The monster grabs at you, but you swiftly duck out of its path. You slide to the knife and grab the handle. You get up and attack the monster. It is now facing you. It punches you in the stomach, and you fly to the wall. Dazed and hurt your head leans to the door.", "action_results": [{"action": "Run out the door", "result": "You run out the door, holding onto the knife and round the corner. You come face to face with a tall man holding two knives. What do you do?", "action_results": [{"action": "Run Back", "result": "You try to run away, but before you can turn around his knife is through your head. You are Dead", "action_results": [{"action": "Waking up", "result": "Your eyes snap open as you realize the odd smell. It smells like vomit. You gag and sit up. Your in a dark room, filled with random items. You see a spoon to your right. To your left, a toaster. You slowly get up, but as you do you notice something out of the corner of your eye. It looks like a person curled up in a ball.", "action_results": [null, null]}, null]}, {"action": "Knife him", "result": "You try to stab the man. He side steps and chops your hand clean off. You stumble backwards. As you hit the wall, you watch as the blood trickles down your arm. The man drives the knife through your head. You are dead", "action_results": [null, null]}]}, {"action": "Get back up and fight", "result": "You slowly get to your feet. You are lucky this monster isn't quick, or you would be dead. As he reaches you he tries again to punch you, but you are ready for this. You drop to the ground and stab his foot. He screams and backs up. You get up and run straight at it. You drive the knife through its head. It drops dead. \"Now come over here.\" Says the shaky voice.", "action_results": [{"action": "Walk over", "result": "\"Where am I? Who am I?\" You ask as you sit down with the thing. \"You are in a 'insane asylum'. There is an evil doctor here the experiments on the insane. I wasn't once his son, thought i talked to much, but that's not important. What is important is killing the doctor.\" It said, straining for each word. \"Okay, but who am I?\" you ask. You forgot your name the moment you woke up. \"The doctor knows.\" It said.", "action_results": [{"action": "Part 2 coming soon", "result": "You won! I will be making a part 2 shortly. Thanks and be easy on me this is only my second one. Also any tips on how to use pictures would be helpful. Thanks!", "action_results": []}]}]}]}, {"action": "Ignore it and try to attack the monster", "result": "You try to punch the monster. It bites your hand off. The mixture of your blood and its pour from its mouth. It stomps toward you, licking its lips. You cry and wish you had listened to whatever the hell that thing was in the corner. The monster stomped on you, caving in your chest. You are dead.", "action_results": [null]}]}, {"action": "Run away", "result": "You run away from the noise. As you are running you turn a corner. Before you stands a tall skinny man. He is wielding 2 knives and is slowly walking towards you. You try to run but he throws one of his knives at. It hits you in the back of the knee. It is the most intense pain you have ever felt. You try to crawl away but he grabs the back of your neck and spins you around. He takes his knife and slits your throat. You are dead.", "action_results": [null]}]}, {"action": "Wait for it to stop", "result": "When it finally stops it looks at you. It yells, ripping even more stitches, and grabs you. You try to break out, but its grip is strong. \"Help...\" You manage, but that's all you manage. Soon he has squeezed all the life from you. You are dead.", "action_results": [null]}, {"action": "Attack it", "result": "You hit it in the face. It stumbles backward and out the door, falling down while holding its face. Blood seemed to pour for the multiple wounds that had opened. You decide it best to walk away, but as you do you hear the worst sound you have ever heard. It sounds as if something were screaming with its mouth closed.", "action_results": [null, null]}]}]}]}]}]}]}