{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=63471", "context": "", "first_story_block": "Damn. You couldn’t get out of visiting your grandparent’s house. You’re not a fan, to say the least, of visiting the old cottage filled with just-as-old people. Ok, that’s mean. Deep down, you love your grandma and grandpa, but seeing them is never like in the movies. Grandma doesn’t bake cookies all day and slip you 20 dollar bills while your parents aren’t looking. Grandpa doesn’t sit in a recliner, playing a game of am I asleep or dead?! No, it’s never like that.\n\nThe old cottage is far off from any neighbors, deep in the jungle-like Appalachian rainforest. The northbound highway cuts into a smaller state road, single lane, that leads into the heart of the forest. It’s a sudden shift, entering into the forest. Clear, open air is replaced with a constant layer of gray mist, hanging heavy, not unlike bathroom air after a steamy shower. A single lane invites you in, coaxingly, comfortingly. A single road leads out.\n\nYou sit in the backseat of your parent’s RAV 4, headphones in, doing your best to ignore the unfortunate circumstance you found yourself in. To your left, behind the driver’s seat, sits Emma, your little sister. Ha! She couldn’t get out of it either. Being the favorite doesn’t come with unlimited power, although at times it seems that way.\n\nShe’s tuned into an intense episode of New Girl on her iPad, eyes glued on the screen, child-like demeanor becoming more “teen” by the day, another word for rebellious. Your parents “love you both equally,” yet somehow that statement doesn’t seem to be true. Give it a couple of years, and see how much they favor their baby girl when she's a full-blown teen. You imagine you’ll come across as goddamn presidential when that happens. You know, like the stories of past US presidents as kids; they’re always so well-behaved, so perfect, little rule-followers unmarked by scandalous behavior.", "action_results": [{"action": "Arrive", "result": "After a safe, gradual pump of the brakes, your father turns the RAV 4 down a gravel driveway. Calling it a driveway is an understatement. The gravel road runs for several hundred feet, and your father takes care to avoid all the potholes lining the way like uncovered landmines. Each small dip into one of the holes, sends your parent’s heads swaying side-to-side. You move your head from its resting position against the window after one nasty dip results in a minor bump (and laugh from Emma) to your temple.\n\nUntrimmed trees, in desperate need of a good haircut, hang over the driveway, creating a small tunnel and blocking a good amount of sunlight, not that there’s a good amount of sunlight to be blocked. Rain continues to drizzle. The RAV 4 keeps a steady rhythm with its wiper blades. Finally, after a sharp turn, the cottage appears in the distance.\n\nSmall and unassuming it sits, resting nicely between two large trees. From this distance, the trunks rise high like football goalposts. Single story, single garage, the beige house is quiet. Its weathered lavender trim is becoming more gray, blending in with the primary house paint. The living room window is split down the center with a large crossbeam, creating a pair of eyes, illuminated with soft yellow light, watching your arrival. It doesn’t say a word as your father sends the RAV 4 into parked position.\n\n“Now be respectful to your grandparents,” your father lectures as you unbuckle your seatbelt. “Help me unload.”\n\nYou watch your sister and mother head towards the front door, each head still buried in their book and iPad.\n\n“Why don’t they help?” you ask.\n\n“Because it’s proper for a man to do the lifting,” your father answers. “That’s why God gave you these,” he adds, squeezing your arm.\n\n“Sure thing, Dad.” You roll your eyes in good fun, not unaccustomed to your father’s stereotypical humor.", "action_results": [{"action": "Unload", "result": "You grab an ice chest from the trunk of the RAV 4 and head towards the front door, which has been conveniently closed by your sister, even though she’s probably well aware you needed it ajar. You set down the chest and reach for the knob. Before your hand touches the metallic knob, the door swings open and you find yourself staring face to face with wrinkled skin and that smell which accompanies anyone over the age of 65. Your grandma, dressed in a gown that would be considered outdated decades ago, reaches over the chest to wrap you in a loose hug.\n\nAwkwardly, you return the favor, having to lean over the parked ice chest and sending your hips back for a counterweight. Warm skin presses against the side of your cheek, closely followed by a wet kiss. Respectfully, you don’t wipe it just yet. It sits there on your cheek like a domesticating brand, one that allures to desmaculation and neuterization. Behind Grandma, Emma gives you a devilish grin, well-aware of the fact you’re not a fan of sloppy wet kisses from old people.\n\n“Hi Grandma. Good to see you,” you say, respectfully.\n\n“Good to see you too, dear. Oh leave that for your father,” she says looking at the ice chest. “He’s looking a bit thin. You already have a lot of muscle built up,” she adds, touching your arm. It’s not hard to see which side of the family she’s from.\n\nYou follow her inside to the kitchen and plop yourself down at the dinner table. Aged wallpaper surrounds outdated appliances and furniture like a picture-perfect antique store. Small designs of green and red stripes line the base of the wallpaper. God knows why the designer did that.\n\n“Honey, why don’t you greet your grandpa? Grandma says he’s out back,” your mom says from the head of the table, face still buried in Nicholas Sparks Land.", "action_results": [{"action": "Yes", "result": "The back door could use some work. It takes a couple of pulls before the thing actually swings open. It’s probably a struggle for Grandma to even open the damn door. Of course that’s assuming she actually leaves the house. Something tells you she mostly stays within the kitchen and living room. The small treadmill placed in the corner of the living room provides good proof to that fact. Outside, you’re greeted with gray sky above an evergreen backdrop.\n\nGrass, long neglected, rises waist-high burying unkempt bushes under its overgrowth. A single path leads towards the shed, which has more in common with a garage than a shed. It’s the size of a two-car, its sides long lost their red paint, leaving behind a barely visible red streak covering its panes of wood. A soft glow from an overhead light, like the ones mechanics use, shines through a crevice left by the cracked-open door. Walking briskly to avoid raindrops, not that you succeed, you arrive at the shed door and peer inside.\n\nOpposite of the door, a backdrop of tools hang on the wall. It looks like a cork board, but instead of posters listing Roommate wanted! No animals allowed! it simply holds aged hammers and different sizes of screwdrivers. You hear scratching inside; whatever Grandpa is doing, it sounds like a file rubbing against rusted metal.\n\n“Grandpa?” you speak into the cracked door.\n\nNothing.\n\nYou slide the door open a few inches further and scoot inside like the upright version of a high jumper, narrowly hitting a pole. You’re hit with a wave of dust, causing an instant sneeze. As sneezes often come in pairs, you patiently wait for the second one. After it passes, you wipe your nose on your sleeve and continue the search. An aged Challenger takes up most of the shed’s inside, losing most of its original yellow paint. Hard top, a 1973 Rallye, you’d find out later.\n\nThe scratching grows louder, and you feel the hair on the back of your neck rise. Suddenly, you have a great urge not to be in your grandfather’s shed. Steady raindrops patter on the shed’s roof. Behind you, water drip, drip, drips: a result of cracks in the shed’s roof.\n\nErrrrch!\n\nThe scratching grows into a longer, slower resonation.\n\nErrrrrrrrch!\n\nStill, it draws out in length. That does it. Time to return back to the cottage. You whip around, ready to leave the place and run smack into the wall. No, not the wall. Grandpa. His flannel, likely made decades ago, is rolled up at the sleeves exposing a lifetime of forearm muscle built from working with his hands. Like a weight is placed on one shoulder, his torso leans slightly to the left, his right shoulder resting an inch higher than the other. His face is mostly covered in shadow, save for the point of his nose, from the trucker hat pulled low on his head.\n\n“Leave, boy.”\n\nHis voice is firm, cracked near the edges, not from ill-intent -- likely the cause of living through years of regular smoking. There’s a solid amount of force behind the voice; it’s not some labored breath slinking from an elderly man’s throat. It’s intentional, and it means business.\n\nWithout a word, you take off running. Outside, you sneak a glance back, still moving quickly. Through the crack in the shed door, you see Grandpa staring at you, only enough room for one eye to peer through the slot. The door shuts completely.", "action_results": [{"action": "Dinner", "result": "A little while later, you’re back at the dinner table surrounded by your immediate family and Grandma. Grandpa still is “out back,” whatever that means. Well, she likely means the shed, but you still don’t know what exactly he’s doing in there. And there’s the fact he definitely didn’t want you poking around there. Fine. Keep your precious outhouse. I’ll reside in the main house, mastuh! According to Grandma, that’s where he spends all of his time.\n\nIronically, Grandpa arrives shortly after the words leave her mouth. His trucker hat is no longer pulled down low; it rests normally on his head like how an ol’ vet would wear one. He sits down at the head of the table, right next to you.\n\n“Nice of you to join us, Dear,” Grandma speaks, passing a bowl of lightly-toasted rolls.\n\n“Had some business to take care of. How’re doing, kiddos?” Grandpa answers, taking the bowl of rolls, and flashing a toothy smile, one that displays surprisingly good dental work for someone his age. Either that, or they’re dentures. Your guess is the latter.\n\nA moment of silence passes before your mother commands, face un-buried in her novel this time. “Well? Answer him?”\n\n“Good,” you and Emma say, simultaneously, not really sure what else to say.\n\n“Good!” Grandpa answers, taking his knife to a piece of chicken. For the remainder of the dinner, you do your best to input little yes’ and no’s when the circumstance arrives, but honestly, what’s more boring than dinner at your grandparent’s house? You’ve heard the same stories about your dad several times now, and you can only smile, nod, and act surprised so many times. Strategically, you always keep a mouthful of food as an excuse for staying silent.", "action_results": [{"action": "Politely listen to a story", "result": "You’re only here a short while, and you decide listening to another story on your dad’s childhood wouldn’t be the worst thing in the world. There’s no WiFi here, so that title is already claimed. Having nothing better to do, as horrible as it sounds, you stick around after dinner. Unsurprisingly, Emma leaves to keep her iPad company in the guest room, one that you’re sharing. Surprisingly, your parents don’t stick around either. They follow Grandma into the living room (to take another peek at the “fine” china?), leaving you alone with Gramps at the table.\n\nYou both sit, silent, staring straight ahead before you take the initiative. “Are you fixing up that car in the back?”\n\nGrandpa answers. “The ‘73 Rallye? Once upon a time I was. Parts are hard to come by now. She still runs, though. Less beautiful as before.”\n\nSilence returns, to no fault of your own. Typically the way these things go is the older one speaks and you nod and listen.\n\n“Do you have your license yet?” he asks.\n\n“Just a permit. Dad says I’ll need to find a job to pay for gas.”\n\n“A man needs to work,” Grandpa says. “When I was your age, I was working full days at the factory, only taking breaks to attend classes at school.”\n\nThat sounds like a story you’ve heard before. You’ve heard a similar one told by your father, about walking 10 miles in the pouring rain to school, and then walking 10 miles home just to strap on an apron and bag groceries at the local supermarket. You wonder how much of that is true. Maybe it felt like 10 miles to an adolescent kid.\n\n“Listen, kiddo,” Grandpa speaks again, lowering his voice so the others in the living room won’t overhear. The fun, smile-flashing old man is gone, replaced with the one you ran into earlier. “Stay away from the shed. There are...dangerous tools in there. I wouldn't want you to get hurt.\nYou nod. \"I saw them hanging on the wall, but I didn't touch any. Promise.\"\n\n\"Not those!\" he breathes through a sharp whisper-like burst of air. \"There are things, unseen things, happening all around us. Most go about their lives never noticing. Their ignorance protects them. Here, the curtain is drawn back just enough to peer inside. Here, fairytales don't end 'happily ever after.' Here--\"\n\n\"Ready for bed, Slugger?\" your dad says from the entryway, suddenly pulling you from Grandpa's story.\n\n\"Ready, Dad.\"\n\nYou feel Grandpa's eyes burning into your back as you leave, for the second time today. He continues to sit at the dining table, milking a bottle of Budweiser. Once he finishes, he adds the empty bottle to the gathering collection and leaves. You can't see him, but you hear the back door open and close.", "action_results": [{"action": "Retire to your room", "result": "The guest room is everything you expect from a spare room in your grandparents' house. Two twin beds take up most of the floor space, covered seemingly head to toe in stiff pillows, dressed in outdated pillow cases and covers. And yes, there's a homemade quilt on each bed. A fat TV sits in the corner. It's one of those that weigh about 300 lbs, despite its 24 inch screen, and has a VCR player built into it. Next to it, in a wicker basket, are old VHS tapes that are probably worth less than the plastic they're made of. Man, having no WiFi sucks. Sharing a room with your sister is a close second.\n\nEmma ignores you, intensely continuing her binge of New Girl as you throw several pillows to the ground making room for you on the bed. You shut off the lamp, bathing the room in darkness, save for the glow of the iPad. By the angle Emma watches the screen, she looks like she belongs in one of those old horror flicks. You know, the ones where someone tells a creepy story around the campfire, shining a flashlight underneath their chin for effect. Worst horror story ever. Who's that killer? Who's thaaat killer? It's Jess!\n\n---\n\nTotal darkness. You awaken in the middle of the night; the light from the iPad is off, signaling Emma's asleep. Soft breathing next to you solidifies that fact. The red glow of an alarm clock tells you it's 3:09. You roll over, attempting to get comfortable kicking another pillow to the ground in the process. As you settle in, a subtle wave of air passes over your neck, like a sigh, silent in the night. Instantly, alertness rushes over your body, but still, you remain unmoving.\n\nBesides Emma's breathing, it's quiet in the room. Like a predator stalking the jungle, your body is aware of every detail in the room, ready to burst into motion, senses at a heightened level elevated by an unexplainable knowledge of present danger.\n\nErrrrch!\n\nThe scratching sound from earlier rings into the blackness. You sit up, quickly, and turn to the other twin bed. \"Emma,\" you whisper. Her breathing pattern remains the same, and she's unresponsive to your hushed tone. Footsteps rush past the bedroom door, swiftly and gracefully, approaching and subsiding like a car whizzing by. The footsteps are light and catlike, far from the heavy stomping you're accustomed to hearing from your parents.\n\nYou pause for a moment, unaware you've turned one ear towards the door as if it'll help you hear better. The night shifts back to silence, void of sound and signs of life.", "action_results": [{"action": "Stay put", "result": "“Rise and shine, Bro!”\n\nA pillow smacks you in the face, thrown from the other twin bed. Emma sits on top, hair tangled in a loose bun, readying another missile. Luckily, ammo is plentiful, and you fire back a few shots of your own. A wave of bacon hits you, and voices from the kitchen area temporarily distract you from your current battle. Your stomach growls in response to the image of crispy strips of bacon, lined neatly in rows like soldiers standing at attention, their spaced shared with yellow clouds of fluffy scrambled eggs. Instead, you eat another pillow to the face.\n\nSomeone knocks at the door, and before you can say “Come in!” the door swings open. Typical parent move. Your father stands in the doorway wearing pajama bottoms and a white tee, brown-rimmed glasses resting lazily on his nose, hair tangled, though to a lesser degree than Emma’s.\n\n“I hope you’re not making a mess in here,” he scolds, then breaking the act he adds, “because you forgot to invite me!” He solidifies the point by chucking a pillow at the two of you. Emma ducks out of the way, and it hits you in the chest. Direct hit from downtown! The ol’ man’s still got it!\n\nAfter breakfast, you’re volunteered to accompany your mother to the grocery store. Since the default activity visiting grandparents is to eat, the stock runs down quickly. It’s up to you and Mom to replenish the pantry for the sacred activity. To be honest, it’s nice to get out of the house, even if it’s technically for “running errands,” the other main skillset of your mother besides sticking her nose, and getting it stuck apparently, in a novel. Is that mean? Eh, it’s true. Emma and Dad stay put, getting the short end of the stick in your opinion.\n\nIt takes almost thirty minutes to reach the grocery store, which is really more of a gas station that also happens to sell food. As your mom checks each aisle to see what she’s dealing with, verifying she can stay somewhat close to her militarily-conscripted shopping list, you pass the time looking at the 25 cent candy machines and free realtor brochures outside. Desperate times, desperate times -- the internet on your phone is spotty at best.\n\n“Yer not from around here.”\n\nYou turn to find the gas station attendee, a thin man dressed in a dirty blue polo displaying the station’s logo. It’s one of those off-brand types, like Honey O’s instead of Cheerios. Instead the typical shell logo you’re used to seeing, this one is a conch. Close, but not close enough for Shell’s lawyers to do something about it.\n\n“Nope. I’m visiting my grandparents,” you answer.\n\n“Not staying too long, I hope,” is his answer. Strange to say in the least. Usually, people spout some stereotypical bullshit like There’s no time like family time! or Teamwork makes the dream work! Ok, that second one is a stretch.", "action_results": [{"action": "Press the man", "result": "“No offense, but that’s a strange thing to say,” you answer in a tone that is respectful. After all, this is an adult you’re talking to.\n\nThe man laughs. It sounds like someone clearing their throat after drinking coffee. “Very perceptive of you, young man.” His tone shifts to a more serious one. “Take care that you don’t stick around past your welcome.”\n\n“I’ve been here before,” you answer. “This isn’t the first time I’ve visited.”\n\n“I’m telling you this for yer own benefit, kid. Lot’s changed in the past few years. Willing to bet yer last visit hasn’t been in the last five years?” Seeing you shake your head, he continues. “Town’s had some weirdness lately. You look old enough for me to share. Hell, yer probably playing video games that have much worse.”\n\nThe attendee pulls a round container from his back pocket, fingers a pinch of black gum-looking stuff, and shoves it in his mouth. Copenhagen Black, just what the doctor ordered! Shove that gunk under your lip like a real man, like a real motherfuckin’ bonafide fuckin’ badass. Suck on it, spit, then repeat! Easy as 1, 2, 3! After a few seconds, he spits a sizable amount of dark saliva on the pavement, wiping his mouth with a rag from his other back pocket.\n\n“Terrible stuff, don’t ever try it, kid.”\n\nYou utter a “Yes, sir.”\n\n“Listen, I don’t mean to scare ya. Nothing illegal is taking place. Just...weirdness like I said. People hearin’ noises and jumping at the wind. Then there was that whole business with the Marchecks. That, kid, was illegal.”\n\nCatching on to the irony of his statement, you patiently wait for him to continue. After another glob of spit, he does.\n\n“Crazy old man Marcheck went off the rails. Took an old woodcutting axe and, well, confused his wife of 40 years of being a tree, so to speak. They’d been high school sweethearts, born and raised here in the Appalachian. Bill Marcheck was a hell of a quarterback. Still holds the completion and touchdown record. His wife, Martha (yes, Martha Marcheck), was on the cheerleading squad. It’s quite the American story, isn’t it son? The quarterback gets the cheerleader, and they live happily ever after...in this case, they lived happily for a while, until the thing.”\n\nThe man stops, letting the story sink in, gauging your reaction to see if he’d overdone telling the story to someone who didn’t even have their driver’s license. No doubt, he tried to soften, to Disney-fy the story at the end, referring an axe murder to “the thing.” Before you can answer, your mother comes outside with a full cart of groceries.\n\n“There you are. Help me load these in the car.” She flashes a smile to the gas station attendee, who returns the smile. As you leave, the man holds a palm up in farewell, angled in a way like someone pushing open a revolving door. Then, he adds to the building pool of tobacco spit.", "action_results": [{"action": "Back at the cottage", "result": "When you arrive back at the cottage, you help unload the groceries. With several hours until the next meal, otherwise the next activity, you hole yourself into the guest room, perusing the dozens of VHS tapes packed neatly into a wicker basket. The basket is filled with movie titles you’ve never heard of, ranging from old westerns to soapy romances. On both ends of the spectrum, you’d rather blow your brains out. Not that you have anything against westerns, the old ones just have too many bad actors and lack proper special effects. I mean, damn, people get shot all the time and there’s no blood. Realism much?\n\nAfter your search turns the neat stack of movies into a scattered mess, one catches your eye. It’s at the bottom of the basket, unmarked, and looks homemade. It’s a simple white box, different from the magnificent portraits painted on the other tapes. You open the box and find a black VHS tape inside. A white rectangular note is posted to one side of the tape. You’re right; it is homemade as the custom tape leaves room for the recorder to write a description. The outside may be unmarked, but the tape itself definitely isn’t.\n\n\nFour simple numbers mark the side, the year in which whatever the tape holds was recorded. That’s your best guess at least. Curiosity getting the better of you, you shove the tape into the TV. After a few white lines of scuff, images begin to appear. A younger version of Grandpa and Grandma appear on the screen, the color faded and washed like old footage of ‘Nam. Grandpa is youthful, wearing a military uniform, not a single wrinkle rests on his face. His bright blue eyes can even be seen through the aged technology. Grandma is the same. Wearing a long dress skirt (that’s the best way you can describe it), her hair is curled at the edges, and red lipstick opposes the two blue eyes of Grandpa.\n\nSuddenly, Emma barges into the room. “Bro! Guess what I found? Wait! No, I’ll bring you there.”", "action_results": [{"action": "Follow Emma", "result": "Obviously whatever Emma found is more exciting than an old tape of your young grandparents staring at each other with doe-like, googly eyes. You lunge forward and hit the off switch on the TV.\n\n“This had better be worth it,” you warn, half-seriously. “I found a VHS tape from 1973 of Grandma and Grandpa.”\n\n“Yeah, like you had anything better to do,” Emma retorts. “Are VHS tapes even that old?”\n\nYou’re actually not sure. They have to be, right? She leads you down the hallway, passing a Little Mermaid night light, to the garage door. The door opens to a single car garage. An older model Buick sits in the center, its brown paint could only be described as dirty puke. It doesn’t look as if it’s left the garage in the last ten years.\n\n“I was grabbing sodas from the refrigerator,” Emma explains, “and I found this.”\n\nShe points to a corner of a trap door. Covered by a stack of boxes, which you promptly slide over, the corner is barely visible. Normally this wouldn’t grab either of your attention, after all, who wants to explore the underside of a house, but the trapdoor is different. It’s made from metal. Steel beams cover the front, reinforcing it. The center holds a single key hole with one of those handles in a X shape, giving it a vault-like appearance. Stick it in, give a little twist, and explore the treasures within! The trapdoor is custom-built, intentionally placed to hide its contents.\n\n“Cool find, Sis,” you say, demonstrating the door’s locked state. “But you need a--”\n\n“--key?” she answers with a smile, holding up a keyring rivaling a janitor’s.\n\n“Where did you get that?” you question.\n\n“Grandma gave it to me in case the garage door locks. Apparently, it has a nasty habit of locking from the inside.”\n\nNot waiting for your response, or words of warning, she starts trying to fit keys in the keyhole. After the 6th try, the locking mechanism releases, and with a triumphant smile, she spins the handles and pulls the door up and open.", "action_results": [{"action": "Down the ladder", "result": "Not allowing chivalry to die a lonely pillow-smothering death, you motion to Emma that you’ll climb down first. Your hand grips the cold metal ladder that’s barely visible at the opening of the trap door. With one hand, you climb holding your phone out for light. Once you get to the bottom, you flash the phone around to survey your surroundings.\n\n“Wait up there for a sec,” you call up the ladder. Emma nods and throws out a “Be careful!” It’s not a long climb, only around 8-10 feet. Still, you feel as if it’s your older brotherly obligation to do stuff like this, you know, stuff like scaring boys her age and climbing into creepy crawl spaces. Your phone light finds a switch on the wall, which you promptly flip.\n\nFluorescent light fills the room. It’s not a big room, probably around the same size as the spare bedroom, although that’s where the similarities end. Instead of two twins, this room holds a single chrome table in the center. Leather straps are chained to each corner, along with what looks like a catcher’s mask at the far end.\n\nAs you approach the table, one of the fluorescent bulbs overhead begins to flicker, creating a minor strobelight paired with the buzz of electricity. There’s something familiar about this table. A feeling of Deja Vu runs through your body. A crash echoes throughout the room like a thick book falling to the floor, causing you to jump slightly. The beam of light pouring through the ladder, originating from the garage, is gone. Fucking sisters. Emma probably planned the whole thing. You turn--\n\n--the table calls to you. Its voice appears in your mind, like the way two lovers whisper into each other’s ear. Compelled to feel its cold metal, to run your hands on the smooth chrome and smell the fresh leather straps, you approach the table once more. Your hand hovers over its shine, savoring the moment, giving your senses full consent to violate wet pleasure.\n\nYou place your palm on the table.\n\nscratch at the walls, grind their bones, scratch at the walls, grind their bones, scratch at…\n\nImages flood into your mind, not only images, but someone infiltrating, occupying your mind space and filling it with their own. Suddenly, light flashes behind you, like a ray of sunshine meandering through a forest. The trapdoor back to the garage swings open. You walk to the base of the ladder and look up. Emma’s face peers down at you, marked with worry.\n\n“Sorry. I must not have propped the door open all the way. Are you ok?” she asks.\n\nScratch at the walls.\n\n“Yeah, there’s nothing down here,” you answer, gripping the base of the ladder. “Nothing exciting, anyway.”\n\nGrind their bones.\n\n“Get back up here, then. Before we get caught,” Emma says.\n\nYou do as you’re told.", "action_results": [{"action": "As you're told", "result": "The room’s dark. Your phone tells you it’s just past 3am. Wakefulness, or perhaps restlessness, overtakes your body, like you’ve just had a solid 12 hours of sleep and can’t stand being in bed a moment longer. Softly, Emma breathes on the bed next to yours. Tip toeing, you place your feet on the ground and silently exit the room.\n\nThe hallway is lit, dimly, from The Little Mermaid night light from the end of the hall. The light draws your attention, not just because it allows you to see. There’s something comforting about it, mesmerizing, like the golden reflection of a chest of cold coins.\n\nTrancelike, you approach the light, squatting down to get a better view. Ariel, smiling brightly in her shelled bra, sits in front of the small light bulb, red hair flowing at her shoulders like a crashing wave.\n\nScratch at the walls.\n\nThe voice appears from Ariel.\n\nGrind their bones.\n\nYour face curls in confusion, hoping that you just imagined the voice. If indeed you’re hearing a night light speak, something about it is very...unsettling, whether you imagined it or not.\n\nAre you a fucking man? I see how you look at me. Bet you’d like for me to take off these shells, huh? Is that what you want? Would you make Ariel moan? Would you twist my tits and bite my neck? Come on, baby. Make it happen. Scratch at the walls. Grind their bones. You and I could have some fun together, the two of us.\n\nThe Little Mermaid continues smiling brightly, the voice subsided. Another urge fills your\nbones\nbody, compelling you down the hallway towards the back door. The door, once sticky and hard to open, slowly opens on its own, like a gentle breeze is softly guiding it. Ahead in the dark, your grandfather’s shed looms, shadowy and inviting. You’re urged forward.\n\nCool night air greets you as you make the walk towards the shed. The long, overgrown jungle-like grass blows in the wind, like anchored tumbleweeds forever in stagnation. Crunch, crunch, crunch, your footsteps ring in the night, sending loose bits of gravel grinding against one another.\n\nJust as the backdoor was open, so too is the shed. No light shines from within. Moonlight shines directly at the face of the shed. A single beam fires into the shed’s interior, caused by the open door, a beacon for you.\n\nInside, you can barely see. Everything’s dark with a hint of blue from the moonlight. The tool rack lies straight ahead. To the side, taking up most of the space, is the ‘73 Challenger Rallye. What a piece of shit. Just an old man holding onto the past by keeping that piece of junk around, the old man, the enemy.\n\nHe’d beaten you once before. Damn him. Scratch at the walls. The ‘73 Rallye had no small part in it. The sight of the car sickens you, as if a testament to your failure. Susan, called Suzy as a child, was weak. Calling upon her traumatic past had been easy enough. Memories are suppressed easily enough, especially ones rather left forgotten. A grin appears at your lips as if your raffle ticket was just chosen. What are the fuckin’ odds?\n\nLittle Suzy had quite the experience tucked away, deeply buried within her mind. If asked, she would deny and could so honestly. Not even she knew it happened, not until you made her remember. Oh, she remembered after that, couldn’t stop remembering. Little Suzy, object of her father’s affection. Boy ol’ boy could that man show his affection. Dear little Suzy. Too cute for her own good. Why’d she have to go and marry a stubborn mule like the old man? Doesn’t matter, your failure would be avenged tonight.\n\nYour eyes find the old man’s woodcutter’s axe, leaning against a post. You lick your lips in anticipation. It’s perfect. The lifetime tool of the old man would be his undoing. The axe, an extension of the old man, fitting, no -- molding to his palm, the object used for decades, his hands rough and calloused by the handle, to be used by you, here, tonight. How fuckin’ poetic.\n\nIt does feel nice in your hands, the smooth wooden handle angled to help with swings, the head filed to a razor’s edge. A little too big, perhaps, but you’ll make it work.\n\nYou exit the shed, back into the moonlight. Gravel crunches underneath your steps, steps compelled in a robotic rhythm. The axehead drags on the ground behind you, creating a line in the gravel, tracing your journey back to the cottage. Once again, the back door lies open, inviting you in. Step right up! Let’s see how hard you can swing that axe, old sport. See if you can win the fuckin’ prize. Scratch at the…", "action_results": [{"action": "Your parents", "result": "Their bedroom lies just down the hall from the guest room. The door’s shut. It’s always shut when they sleep. Strange, you remember as a kid it would be slightly ajar at night, as if to say there’s room for three in here! Despite your worst nightmares, you’ve never slid your hand into the cracked door, opening it just wide enough for your head to peer through. It was slightly ajar, but it might as well have been closed. Something about it felt intrusive, even if the opportunity was there for you. The door in front of you, now, is shut completely.\n\nFor the first time in your life, you open the door.\n\nThis isn’t a scared kid walking into his parent’s bedroom in the middle of the night, afraid, ashamed at himself for wetting the bed. He won’t stand bedside, gently waking up his mother to share with her his shame, hoping she’ll hold him close in comfort. There won’t be space made in between Mom and Dad, in protection against further night terrors. There is no protection against this terror in the night.\n\nYou stand bedside, watching your mother’s breath expand and contract her body, the soft glow of an alarm clock shines on her face, bathing her face in red. The axe raises high. At the same moment, she senses your presence, the whites of her eyes appearing, suddenly, shining bright in between the red glow of the alarm clock. Fear, confusion, surprise, horror. The axe swings down.\n\nA click, and light fills the room. Your father, awakening, groggily reaches for his brown-rimmed glasses sitting at his nightstand, facing the opposite direction, unsure and unsuspecting. As he turns your direction, you kick the severed head of your mother, sending it through the air with a trail of red, like a gory comet in the night sky. Mother’s head slams into your father’s face as if a\npillow\nsoccer ball, dazing him. Quickly, you jump onto the bed, over the body of your mother, swinging the axe overhead. It lands true, sinking into the chest of your father, dying his white t-shirt with crimson streaks. Your father’s body sits half upright against the bedpost like someone lounging against the base of a tree trunk. You stand overhead, one leg on each side of him, cutting, swinging, occasionally pressing your foot on his chest to dislodge the axe.\n\nHeaving, labored by the act, you rest a moment, feeling satisfied, arousal starting to show at your pajama bottoms. There’ll be time for that later. The job’s not done yet.", "action_results": [{"action": "Emma", "result": "Your dear sister, your parent’s favorite. They won’t be able to take her side now. This time she’ll have to fight her own battle, so to speak. Goddamn she’s annoying. The way she eats, smacking her lips as if each bite was a mouthful of bubblegum. God, that drives you crazy. Why can’t she conduct herself like a normal person? Always gotta be the center of attention, whether that’s by popularity or annoyance. The spotlight always has to be on her.\n\nShe has your focus, alright.\n\nHer “little innocent” act is finally coming to an end. This is her fault, after all. She took Grandpa’s keys. She practically made you climb down the ladder. Maybe there is such a thing as karma. There’s certainly no debate on cause and effect. You insult a woman, and her hand slaps your cheek. Can’t argue with the results: it’s the law of the jungle. Mock the boar in its lair, and it tramples your body. It’s just the way it is. Since her birth, it’s been one long mock, taking the positive attention from your parents and leaving the negative for you. It’s her fault. It’s by her doing. She shouldn’t be surprised at the act.\n\nThe guest room is dark, darker than you remember. No clocks, cell phones, or tablets shine quietly, not even signaling their charging state. That’s ok. You know where she sleeps. Feeling the axe handle, you approach the side of the bed, slowly raising the head with both arms. The blade swings down with all your might towards Emma. She always sleeps on the right side.\n\nInstead of a satisfying crunch, the axe buries itself in pure mattress, sending a chunk of padding into the air. Confused, you pull the string of a nearby lamp, illuminating the room in its warm glow. Emma’s gone. A growl escapes your lips. That bitch. Where is she? The thing compels you onward. You know what they say about idle hands.", "action_results": [{"action": "Your grandparents", "result": "Your grandparents’ room is in the back corner of the cottage, away from the hallway where you sleep. Across the living room, kitchen, and finally to their bedroom door. It’s a flimsy little thing, the door. Hollow inside, feigning strength on the outside. It pretends to be strong, sturdy, able to keep out intruders. Fucking pathetic. The old man is the exact same way. It’d take two or three good swings to bring it down, to see what’s inside. Same goes for the old man.\n\nAxe swings aren’t necessary, though, the knob’s unlocked. What’s the point of closing a door, to keep outsiders as the name suggests, if you aren’t going to lock it? Not that it’d matter. A simple lock won’t keep you barred from entry. It’s just the thought that counts. Maybe the old man knew that and left it unlocked just to spite you. He’ll pay for that.\n\nThe door creaks open slowly. It’s not completely dark. An aged television, a fatty, probably pushing a 30 inch screen, is on, hung from the corner of the room opposite of the door. Some old show is on in black and white, the cast wearing army fatigues and looking chummy with one another. Dramas, it’s never the same way in real life. In real life, there are consequences. Real consequences. In real life, you exist.\n\nTwo lumps are on the bed, lying underneath a hand-woven quilt. Some nightmares are recurring, dear Suzy. You sleep softly now, forgetting, attempting to bury what happened. The old man protected you once before, back when that title didn’t apply. Now, though, he’s old, weak, while I’m just as strong. Stronger, even. Unarmed, vulnerable, you both sleep dreaming of your youth, most likely, when you could run and fuck and walk up stairs without aching, back when your bodies were healthy and full of vigor. My little Suzy. All grown up.\n\nFirst the old man. Then Suzy can have your full attention.\n\nYou walk bedside to where the old man, your grandfather, sleeps. His axe rests comfortably in your hand, the smooth handle a perfect size for his hands, his neck a similar size for the blade. The axe swings high, gathering momentum for the chop, like the top of a roller coaster before speeding down earthbound. Here it is. The moment you’ve been waiting for since ‘73.\n\nThe axe swings down, piercing into the old man’s neck, but then stops suddenly. Blood oozes out, not a lethal amount. Two weathered hands hold the axe handle, just above yours, preventing the axe head from burying further into his neck. He grunts, struggling to remove his lifelong tool from your grip. You lick your lips, grinning at his struggle.\n\nA flash of light bursts in your vision. The old man releases one hand from the axe handle in order to soften your chin with a calloused knuckle. Growling, you bare your teeth, no longer displaying your inner glee. No more games. He dies. You follow suit, releasing one hand from the axe to throw a punch, only you don’t hit the old man. No, the knife edge of your hand lands on the back of the axe head, driving it deeper into the old man’s neck. His eyes open wide as you send another blow to the axe, hammering the blade into his neck, further, like a nail digging into a stubborn wall, soft gurgles the result with each hammer. Eventually, his strength fails, his fingers slowly losing hold on the axe handle. Lifeless, without a word, his arms fall limp.\n\nA cry draws your attention.\n\nSuzy, now an old woman, sits in the corner of the room, tucking her chin into her knees, as if hiding her gaze will save her. Kids. It reminds you of when she used to hide underneath the covers, thinking that’ll bring some level of protection. It never did. She sits in the corner, no doubt recognizing you, knowing she’s all yours. You stand in front of her, her husband’s axe still wet with his blood. You bend down, attempting to comfort her, wiping a tear from her wrinkled neck, offering calming shhhs while feeling her face with the back of your palm. Dear little Suzy. We’ll meet again.\n\nHer cries are stifled with a single swing.", "action_results": [{"action": "You", "result": "Finally. There’s nothing left to do. A wave of exhaustion flows through your body, like you’ve been carrying a great weight to the point of losing feeling in your muscles. Your muscles, oddly mentioned by both Dad and Grandma when first arriving at the cottage. Suddenly thirst, as if waking from a night of drinking, fills your throat. You swallow a small amount of saliva in an attempt to remedy. It doesn’t work.\n\nThe axe slips from your grasp, crashing to the floor, head first then handle quickly falling in a quick one-two burst of noise. Sluggish, you collapse, the strength guiding your body quickly fading, knowing the task has been completed.\n\nYour hand feels cold, similarly to feeling the metallic table in the basement, the chill running from your fingertips up your arm, all the way to your shoulder and torso. The voice, the compeller, the thing, leaves, abandoning you, siphoning the life from your body, using up all your energy in the night’s events. The power, the satisfaction, the arousal: it’s gone. There’s nothing left to do.\n\nSilently, you lay on the carpet of your grandparents’ bedroom. It’s thick and scratchy, somehow comfortable in this moment. Grandma sits next to you, a deep wound in her neck where the axe struck through all the way into the drywall behind her.\n\nThe body of Grandpa lies unmoving on the bed, covered by the light of M*A*S*H still playing on the aged television. You imagine him in his military fatigues, not fighting in Korea, but in the jungles of Vietnam, a man fueled by vigor and a stubborn willingness to survive. He managed to survive a jungle halfway across the world, but couldn’t make it through the one at home.\n\nYourself again, numbness creeping in, you allow your mind to wander, to think its final thoughts as you lay dying next to your grandparents. You feel nothing, not even remorse. Everything’s simply blank, dulled like the mind after several cocktails. You allow your body to relax on the scratchy carpet and wonder where Emma is. After a few moments, your vision fades.", "action_results": []}]}]}]}, null]}]}]}, {"action": "Keep watching", "result": "“I’m watching something. Maybe later,” you say.\n\nVisibly disappointed, she leaves after uttering a “hmmpt!”\n\nYour eyes return back to the small TV screen. It’s poor quality matches the aged tape, creating a video that honestly isn’t too hard on the eyes. It’s a little bit like watching a documentary in science class. Those PBS docs, loosely based on scientific fact, don’t have the best quality or narrator. It’s better than a lecture, though, so no one complains.\n\nYoung Grandma and Grandpa are standing outside of a house, not the cottage, but one that looks firmly in the suburbs. The 1973 Challenger Rallye is parked in the driveway, shining bright spankin’ new. Its yellow paint reflects the sun like a gold medal hanging from an Olympian’s neck.\n\nGrandpa whirls Grandma around and places a juicy kiss on her lips. She bends one knee, while kissing back, and grabs behind Grandpa’s head for stability, causing his military beret to fall off. Laughing, she picks it up, and places it loosely back on his head. As youthful Grandpa fixes the beret with a full-toothed smile--\n\n--the video suddenly cuts to a woman strapped to a chrome, metallic table, leather straps holding her ankles and wrists. Her eyes are black, and the hospital gown she wears is marked with stains of dirt and sweat. Recognition hits you like a pillowcase stuffed with soap bars. She’s younger, and wearing no makeup, but there’s no mistaking that’s Grandma. Standing over her head, a priest dressed in black holding a bible begins speaking in latin. As the woman seizes, arches her back, and claws out with her arms, the priest increases the volume of his voice.\n\nShe spits out, spewing incoherent words, the white of her eyes showing. Foam appears at the corners of her mouth, as she writhes, unable to move from the fastened prone position of the table. Her fingernails, long and animal-like scratch against the metal table.\n\nErrrrrrch!\n\nThe familiarity of the sound freezes you in place. Through the poor TV speakers, there’s no mistaking the sound you heard in the shed and hallway. Hairs on the back of your neck rise, as if the room suddenly dropped in temperature. As quick as the paralyzation hit you, movement soars back into your body. Instantly, you lunge forward and hit the off switch on the TV and\n\na figure stands behind you, their shadow visible in the blank television screen. Your body tenses, adrenaline running through your system at the sudden threat. You turn your head slowly, sudden movements have a way of catapulting predators into action. Your eyes move from the blank TV screen, to the aged wallpaper, noticing those god-awful design patterns, to Grandma standing in the doorway, dark bags underneath her eyelids.\n\n“Time to eat, my little movie enthusiast,” she says, smiling a devilish grin. For a brief moment, her teeth appear yellow with jagged canines, eyes flashing black as a starless night. As quick as the image pours into your mind, it’s gone, replaced with the harmless, innocent old lady before you: Your grandma.\n\n“I’ll be right there,” you answer, acting as if everything’s normal. It’s not. It’s really fucking not.", "action_results": [{"action": "Later that night", "result": "As you try to wash the earlier event from your mind, you get called on to help with dinner. A knife is placed in your hand, and you’re directed towards a cutting board with carrots lined on top like prisoners being led to their execution. You begin chopping, arranging your fingers like the way Giada does. Tonight, we’re eating Italian!\n\n“Careful with that, Dear,” Grandma says, suddenly appearing behind you. Her voice drops off near the end as if the statement was forced out with limited breath. “I’d\nlove\nhate to pick your fingers up off the floor.”\n\nYou utter a laugh. It’s polite to laugh at the elderly’s jokes. At least, you hope she’s joking. “I’m careful. I’ve seen the Food Network before.”\n\n“What a load of shit,” Grandma replies. “Those spray paint tan ‘chefs’ are nothing more than low-budget actors pretending that they can fucking cook. It’s all camera tricks and professional editing. I could kick that whore, Rachel Ray, up and down the kitchen. Then, I’d tie her up and place a blindfold over her eyes, the only thing covering her body. Then, let’s see how well she understands food. She’d be my pet, my little ‘Ray of sunshine’ ha-ha! I’d hand feed her, letting her lick the scraps from my palm, savoring the taste of my open hand. There’s more where that came from! Eat this! Whap! Ha-ha!\n\n“Dear?”\n\nYou look to see Grandma staring at you, expectantly. “Uh...I’m sorry, what?”\n\n“I said I’ve never seen that show before,” Grandma replies with a smile, heading to check on the oven. You can’t help but notice the matte pink apron she’s wearing. GRANDMA’S COOKING IS TO DIE FOR. Next to the words, woven into the apron, is the image of an old lady holding a spatula, her chef’s hat tilting to one side of her head. You’re sure the image winked at you.", "action_results": [{"action": "The shed", "result": "A familiar feeling rises through the old man’s bones. Some feelings are better forgotten, and this one was buried behind lock and key. Sweet Susan, she doesn’t deserve to go through this again. Both of them have left the past unspoken, like if it’s never materialized into words, it’ll slowly decay into non-existence. Now, when his son and grandchildren appear, it returns? Timing sure is one hell of a bitch.The past, the possession, the thing: it’s all coming back. Nightmares have a way of lingering, appearing when we least expect.\n\nOne thing’s for sure. He can’t, he won’t allow the thing to ruin his Susan -- not again -- and take his grandchildren. The old man sits in his shed, his place of solace away from that fucking table. The chrome, metallic table with leather straps, the very same one that held his Susan, sits beneath his house like a child born of adultery. Somehow, despite his hate for the structure, he keeps it. Just in case.\n\nOff to his side, sits the ‘73 Rallye, a testament to better times when youth and happiness flowed, unmarked by rust and broken parts. Damn, he loved that car. Still does, despite its state. The same goes for Susan. If the thing is back, he needs to save her. He needs to save his Susan.\n\nThese thoughts flow into the man as he gently feels the smoothness of his axe handle. That feeling, the familiar one, doesn’t compare to his hand on the woodcutter’s axe. It feels right in his hand, like it was whittled to fit his palm perfectly. In a way, it was. Years of use eroded the excess portions of the handle as if running water shifting a rock’s appearance. He’s had to change axe heads a few times, but he’s always kept the same handle.\n\nWhistling through licked lips to the tune of John Denver’s Rocky Mountain High, the old man prepares himself for the upcoming confrontation. Now his life is full of wonder but his heart still knows some fear. It’s near. Better to nip it in the bud, so to speak. He hopes the thing remembers him. He hopes it remembers suffering defeat at his hands, the very ones molded to the axe handle. He’s ready. Better call the Father.", "action_results": [{"action": "A knock at the door", "result": "A sturdy knock appears at the door, sending vibrations through the hallway and into the guest room. You flip your legs over the side and sit up, taking your eyes away from the mobile game currently occupying your time. Visitors? The whole family’s here already. On the bed next to you, Emma doesn’t even react, her attention is too focused on her iPad. The front door opens with a squeal, and adults’ voices softly make their way to your room.\n\n“Where is she?” an unfamiliar voice speaks in a hushed tone.\n\n“In the kitchen. She’s getting worse, Father,” another voice whispers, sounding like your Grandfather’s. “Remember that horrible scratching sound? I’m hearing it again. Comes mostly at night. And the kids are here too.”\n\nSilence occurs for a few moments, whether filled with thought or nodding, perhaps both, you’re unsure. Finally the Father speaks again. “Show me the others.” Footsteps draw closer, and you fall back into your prone inattentive state on the twin-sized bed.\n\nTwo figures appear at the door, your grandpa and another man, the Father. The Father, surprisingly, isn’t dressed in black with that little white thing at his neck. He’s dressed normally, at least for an older person. Neat slacks paint his legs and a plaid button down, sitting underneath a sweater vest, covers his torso. Standing next to your grandfather, he looks rather domesticated. Hands clasped behind his back, he speaks through a friendly smile.\n\n“My, you two’ve grown. You probably don’t remember me. That’s ok. I’m Mark, or Father Mark, or Father -- whichever you prefer.”\n\n“We’ve met before?” Emma asks.\n\n“We have! You two were barely walking back then. It must have been...oh about 10 years ago,” Father Mark answers, scratching his chin in response to the internal mental math happening in his mind. “Your grandpop and I have known each other for many years. In fact, we even served together. Did you know that?”\n\nYou take this one. Emma surely thanks you for it. “No, Sir. I didn’t know Grandpa and Grandma were so religious.”\n\nThe Father and Grandpa exchange nervous smiles. “Trial has a way of turning one’s attention upward,” Father Mark tactfully says. He continues, dropping his voice in volume like he’s sharing a deep secret with the three of you. “Have you heard strange noises at all? Stuff you can’t explain? Something like scratching on the walls or\nfootsteps\nobjects moving places?”", "action_results": [{"action": "Yes", "result": "“I haven’t heard anything,” Emma states. You didn’t think she had, otherwise the entire world would know about it. She’s not known for keeping quiet. The entire neighborhood knows when she finds a spider in her bedroom. It’s no wonder, there; it’s harder to notice things when your face is buried in a screen, ears plugged too.\n\nThe old men and Emma stare at you expectantly. Your apparent reluctance to answer right away causes everyone with white hair to narrow their eyes. We have specials for seniors over 55! Just check the back of your menu! Gotta keep that ol’ ticker tickin’.\n\n“I--”\n\nCRASH!\n\nYou begin to answer when glass shatters, sounding like it originates near the kitchen. Behind Mark and Grandpa, you and Emma closely follow to investigate. Down the hallway, and through the living room, to Grandmother’s kitchen we go! Grandma stands in the kitchen, hovering over shards of glass, the remnants of a fallen picture frame.\n\n“Susan, watch out. You’ll cut yourself,” your mother scolds, appearing with the usual Nicholas Sparks in hand. She neatly holds the page with a finger and bends down to pick up the fallen picture from under the glass shards.\n\n“Ow! Damn it,” your mother comments, nicking her hand with a jagged edge.\n\n“I’ll get the broom,” your father says, joining the party, adjusting his glasses which had fallen to the tip of his nose.\n\nYour mother suddenly stops moving, holding the fallen picture in her hand, transfixed upon it as if it were her novel, although the quiver in her hand speaks to the difference in reading material, mouth inadvertently cracked open, words not forming a coherent sentence from within. Instead of speaking, she simply holds the picture up for all to see.\n\nThe picture is of all six of you, minus the Father of course. You don’t remember when it was taken. Both you and Emma are held in the arms of your parents, looking plump with baby fat. In each place where a smiling face should have been, scratch marks cover the picture like the inside of a cage once an animal breaks free.\n\nThe kitchen light flickers, and for a moment you see the dark bags appear underneath Grandma’s eyes, drooping heavy like her face is struggling to maintain holding in place. When the light returns, she is gone.\n\nEmma screams, a shrill sound that looks to contribute to the shattered glass on the floor. Your dad takes her in his arms to comfort. Your mother still looks frozen in shock. A certain resolve falls over Grandpa and Father Mark; they are not inexperienced in the matter.\n\n“Stay with Father Mark,” Grandpa commands. “I need to grab my equipment from the shed.”", "action_results": [{"action": "Father Mark", "result": "Collectively, you all agree to stay with the Father. Grandpa takes off, moving with an air of grace seemingly too spry for the old man’s age. “This way,” Father Mark ushers towards the nearest bedroom, in this case, the guest room. He waves his arms in such a way that he might as well be finding you empty pew seats on a Sunday morning. Down the hall, another light flickers, then explodes into a burst of light and glass: The Little Mermaid night light.\n\nWhen you arrive in, Father Mark slams the door shut. “What the fu...dge is happening?” you mother bursts out, taking a corrective course on her word choice.\n\n“Susan is plagued by inner demons,” Mark explains. “It’s happened before, and I didn’t think it’d happen again.” Dad is solemn, taking in the news and the events that just transpired, the target of the ailment, his birth mother.\n\n“The table,” you say. Four heads turn in your direction questioningly. “The table from the video,” you repeat, scouring the wicker basket for the VHS tape. You find the blank white box at the bottom and tear it open. Caught by surprise, you fumble the tape. Instead of 1973, which was written on the side, it says:\n\n\n\n“What the fuck,” your dad says, completing the full word unlike your mother. He snatches the tape from your hand, gripping it with a hand at each end and snaps it in half. Plastic pieces and film roll onto the floor, pouring from the inside of the VHS like entrails.\n\nWhite noise suddenly fills the room at deafening levels. The TV compliments the sound with internal mechanisms moving and locking into place, the screen stuck in its static black and white state. Emma screams again, noticing that no one is near the TV buttons. This time, Father Mark comforts her.\n\nPounding appears at the door, booming into the room like thunderous footsteps, steady, four times in cadence. The TV cracks, loosening its surge of white noise, and quiets down.\n\nFather, son, and the holy grandchildren. My, my what a treat.\n\nThe voice projects from the TV speaker. It holds a hint of your grandmother’s tone, but is paired with a deeper, scratchier voice as if the two are speaking simultaneously.\n\n“You’ll not harm Susan any longer, demon!” Father Mark shouts, then begins speaking memorized prayers in latin, ones that he’s prepared beforehand. Both his hands clasp at his heart, and his eyes remain shut completely.\n\nHA HA HA you’d have the same effect reading from the slut’s book.\n\nThe voice rings again, causing a jump from your mother who rightly interpreted herself as the subject. “That does it,” she utters, more to herself, and briskly walks to the TV to hit the power button. As soon as her finger hits the ON/OFF button,\nA mother has eyes in the back of her head\nthe screen bursts into a shower of glass, as if a stray foul ball finding a window.\n\nYour mother screams.\n\nShe covers her eyes with her hands, and still, you can see drops of red flowing from underneath matching the color of the VHS tape writing. “I can’t see, I can’t see, I can’t see, I can’t…” she repeats over and over and over, her voice flaring with emotional strife. All of you huddle around her. The bedroom door swings open as if by a gust of wind, with so much force the knob buries itself in the drywall.\n\nNo lights shine through the doorway. Whatever lights were on in the house before are all off. Outside, rain pelts down on the roof, the break in volume allowing the sound to be heard. Even the sun, sitting behind a thick storm cloud layer, offers no evening light to the cottage. Through your mother’s cries, and soft drops of rain, the doorway invites you to walk through.", "action_results": [{"action": "Stay put", "result": "No way in hell you’re going to walk out, not unless everyone decides to. No one motions that way, unsurprisingly, as all attention is focused on caring for your injured mother. Tears roll down Emma’s face like the droplets of rain on your window when you first arrived. Small hairs on your skin prickle as if static electricity is in the air.\n\nThe doorway, an entryway of infinite black, looms ahead, no noise echoing from the hallway. But then\n\nErrrrchhhh!\n\nScratch at the walls.\n\na figure slowly enters from the darkness, her loose skin hanging, drooping, threatening to fall from her limbs, head pointed downward covering the whites of her eyes. Grandma. Still, she wears her apron, although it’s freshly covered with blood. Grandpa’s? Perhaps. Her white-gray hair holds streaks of red, matting it down the left side of her face, a face that’s still hidden from your view.\n\nGrind their bones.\n\nIt’s so nice to have the family together, again. I’ve missed this. You look hungry. Want Grandma to feed you?\n\nAfter the simultaneous voices end, “Grandma” holds a wrinkly finger up for all the see. Her mouth cracks open in a grin, revealing yellow, rotting teeth within like the way a predator stumbles on a trapped prey.\n\nShe takes a bite.\n\nThe sound, the fucking crunch is like a wooden baseball bat cracking a fastball down the middle, sending the ball over the fence to a cheering crowd’s delight. It’s oddly higher pitched than you’d expect as if a\ncarrot\nsnap of small twigs. She spits the finger in your direction, revealing a bloody nub, the white of her bone in the center like the way a diagram would show a planet cut in half, displaying its core.\n\nFather Mark continues praying. You’re frozen at the severed limb in front of you. Emma and Dad tend to Mom. As the thing disguised as your grandmother walks forward, the door shuts behind her, the hole in the drywall for all to see. She walks forward, slowly, coming for you first.\n\nAt the very last moment, she lifts her gaze allowing you to see the whites of her eyes.", "action_results": []}, {"action": "Walk through the door", "result": "The doorway invites you in, promising hope of escape. You’re slightly comforted by the fact either choice will likely have the same outcome. Who’s to say the guest room is safe? It’s obviously not. Your grandfather is still out there, and you figure he’s your best chance at survival. As you’re approaching the doorway, your father stops you.\n\n“Son, where do you think you’re going?” he speaks, a question one you’ve heard before, usually when going to meet your friends or hang out with the neighbor girl, Sydney. The tone, the one from a place of authority is gone. Instead, a strained curiosity cuts through, which allows you to address him as equals. The situation calls for it.\n\n“Grandpa is still out there,” you say. As you begin to explain yourself further, not that you need to, Father Mark interjects.\n\n“The kid’s right. The old man and I’ve been through a lot, and we’re better off saving Susan together. Stay put. The kid and I will be back, you have my word.”\n\nFather Mark takes point, and you follow closely behind. You exit from the light into the dark, allowing Father Mark’s faith to act as courage for you both. The shed is down the hallway, out the back door, and across the overgrown yard. Mentally, you estimate the steps to arrive. It can’t be more than two or three hundred. No that far, especially--\n\n--a young girl stands in front of the back door, dressed in a cute blue dress along with white stockings running up her legs. Her blonde hair is curled at the tips in an old-fashioned way, in the manner you’d expect from someone decades ago. She stands, unmoving, holding a stuffed animal. In this case, a rabbit.\n\n“Do you want to fuck me, Father?” she innocently asks, giving the stuffed rabbit a little swing ending with a tight squeeze. “Do you want to tie me up and rip off my clothes and feel my tight pussy? That’s what all you men want, huh?”\n\n“What? No, I--” Father Mark is taken aback by the girl’s questions.\n\n“My daddy likes it. I bet you’ll like it too. Your friend standing behind you can have me next. Here, how’s this?” The girl’s hair suddenly appears in two pigtails. “There, that’s better. ‘Suzy, show your daddy how much you love him.’ I let him run his hand up my leg, finding my cotton panties. They’re soft, want to feel? They’ll make you stiff. They made daddy stiff. He showed me, shoved it in me, sprayed it on me. Daddy likes it. You’ll like it too.”\n\nOn her last word, the girl leaps forward, brought upon by a power, allowing her to travel the 15 foot gap like she’s playing hopscotch. Mid-air, dark bags flash underneath her eyes, her face twisting back into an elderly state, while still keeping the girl’s body. You duck to the side. Father Mark isn’t as quick.", "action_results": [{"action": "Keep searching for Grandpa", "result": "There’s nothing you can do to help Father Mark. He’s as good as dead. You are, too, if you stay to help. Your family is depending on you. Silently apologizing, you break for the back door. It’s normally sticky self doesn’t cause you any issue this time. You rip that sucker open in a single pull and slam it behind you.\n\nOutside, dark gray clouds circle overhead, dropping their contents on the earth. Wet streaks fill the air coupled with gusts of wind, sending the overgrown grass to the side as if some invisible force was sitting on top. Lighting flashes, briefly illuminating the gray world into daylight. You continue running across the grass towards the shed and slip through the shed doors.\nInside, your grandfather is huddled over the workbench. “This is the worst I’ve ever seen it,” he utters, not turning your direction.\n\n“Mom’s been hurt! Father Mark is...gone,” you manage to say, not sure where to start and how to convey the scenes you just witnessed.\n\n“That thing leaves me no choice,” your grandfather says, turning around, the whites of his knuckles firmly locking a woodcutter’s axe into place. “It’s happened before, and if I don’t end it, it’ll happen again.”\n\nYour grandfather’s demeanor for the implication of his statement is rather calm, like he decided the course of action long ago. He continues. “Back in ‘73, something happened. I don’t know what exactly. I was a military man, as your father told you. Returning from the jungle of Vietnam, something was different. She was different, like the demons of her past had finally caught up and taken the driver’s seat.”\n\nHe pauses a moment to inspect the knife at his belt. Satisfied with the M7 bayonet, a tool from his past, a place of war, struggle, and hard decisions, he thrusts it back in its sheath. Fitting that it’s at his side, now, that he finds himself back, now that the thing is back. War was supposed to change him. He was the one supposed to come back affected, needing his wife’s comfort and soothing. Instead, he returned to find the thing inhabiting Susan. He would make it pay. Still, there’s the kid.\n\nYour grandfather fishes in his pockets and pulls out a set of keys, one that looks different from the one you’ve noticed attached to his belt loop. He tosses them to you. An outdated version of the Dodge logo is emblemed on the largest key.\n\n“Can you drive stick?” your grandfather asks.\n\nYou nod. “I’m practicing on an old Accord Dad has.”\n\nA laugh briefly escapes your grandfather’s lips, despite the circumstance. “This baby has a little more torque. She sticks on gear three, take it easy.”\n\n“I don’t understand--” you begin to say.\n\n“Keep it running in the front yard. If you don’t see anyone in five minute’s time, drive away. I mean it. Get the hell out of here and don’t look back. Five minutes. Then go.”\n\nYour grandfather rests the woodcutter’s axe on one shoulder and exits the shed, crossing through the overgrown backyard, heading for the house, for the thing, for his Susan.", "action_results": [{"action": "Do as he says", "result": "You watch the old man, your grandfather, approach the house, holding his axe casually like it’s just another day. He passes through long strands of grass, dancing in the wind. Your fingers feel the keys in your palm, noticing the ridges and smooth patterns of the aged Dodge logo. The ring consists of two keys: one for the car, and the other is smaller like it’s meant for a padlock or mailbox.\n\nThe shed doesn’t have an automatic door, so you quickly run to the wooden double doors and swing them open. They glide open seamlessly, without so much of a squeak or\nscratch\nsqueal from lack of oil. Then, you move to the driver's door of the ‘73 Rallye. Same thing, only the car door requires more umph to pull open. The wheel is different than you’re used to. It’s thinner, but also larger with ridges in the back for finger placement.\n\nIgnition.\n\nThe beast roars to life, a pump on the gas aiding, your right hand finding a home on the stick, its typical lollipop shape replaced with a model chamber of a revolver. The roar slowly turns into a growl, like the warning sound of a tiger hunting in the jungle.On the dashboard, the clock shows 6:12. Five minutes, he said. If you don’t see anything, then drive off. Could you really just leave your family behind? Cool leather seats behind you, a gravel driveway in front, you stamp your foot down on the clutch and pop it into first.\n\nIt jolts forward, sending a spray of gravel in the air. Cursing, you lighten on the gas. Torque, indeed. At a crawl, you bring the Challenger around to the front, exactly as your grandfather told you. Now, the waiting begins.\n\n6:13\n\nThe house sits empty, void of the life you noticed when arriving. Its two eyes, the front windows are dark, not unlike your grandmother’s eyes. The thought brings a chill to the small hairs on your neck.\n\n6:14\n\nRain pelts the hardtop, making small puddles on the Challenger’s hood, transitioning it into a glossy yellow. The beast purrs, desperately wanting you to step on the gas. It wants to run free. It may be aged, stiff from being locked in its cage, but now it can run free. It can rule the jungle again.\n\n6:15\n\nYour parents’ RAV 4 is still parked in the front. Compared to the Rallye, it looks bulky, frail, plastic, like the design is meant to distract you from its severe lack in power, and instead, focuses on features, perfect for grabbing the short attention-span of the public. Are people the same way? Does a flashy exterior attract others, despite lacking strength, a solid foundation “under the hood?”\n\n6:16\n\nThe ‘73 Challenger Rallye is the exact opposite. Sturdy, solidly built, it’s a perfect reflection of your grandfather. On the outside, it appeals to certain crowds, certainly not the vast majority. It doesn’t attempt to hide from wear and tear, scars accrued over the years. It’s not equipped with the latest tech. Hell, there’s not even a tape player, and the dashboard clock’s analog. Your hand feeling the wheel, back pressed against the leather, you’d pick the Rallye every time.\n\n6:17\n\nNo one’s coming.", "action_results": [{"action": "Keep waiting", "result": "The house lies silent, empty, no lights appear at the windows. If not for the green treeline surrounding, the cottage could easily mold into the gray, cloudy environment, absent of color. It’s quiet, save for the growling Rallye. 6:18. You’re not going to leave your family behind. Where would you go anyway? How would you explain it to the authorities? No, you must trust that your grandfather will do what must be done. You keep your hand on the stick, the chamber of the revolver, ready to shift into first at a moment’s notice.\n\nErrrrrch\n\nYour body tenses at the sound, the one you’ve become familiar with -- and the chaos that follows. Still, you wait for your family, imagining the front door bursting open, your grandfather hurriedly ushering your mom and sister through, led by Dad and Father Mark. They rush toward the ‘73, waving their arms signaling you to step on it, jumping inside the two-doored machine.\n\nThat’s not what happens. The cottage door remains shut. You shift your eyes--\n\n--two dark bags underneath eyes, drooping, sagging low on wrinkly skin stare back at you through the rear-view mirror. You don’t move, as if sudden movement will spring the creature into action. You don’t speak. Neither does the thing. From the corner of your eye, you can see the thing, whatever is possessing your grandmother, in the backseat, still wearing her apron, wrinkly fingers interlaced in her lap drawing attention to the one bitten off, stoic, as if in prayer.\n\nKeeping a watchful gaze in the mirror, your hand reaches for the handle of the car door. No sudden movement. Steady, steady, steady... Your hand finds the release, only the cold metal handle isn’t there. Instead, your fingers wrap around leathery skin, twisting, squirming in your grasp. HISSS, a forked tongue spits in your face along with the warning hiss from the snake, like hot steel placed in a bucket of cold water. Instantly, you react, throwing the serpent from your grasp. It fades into nothing as if mist fading into air.\n\nYour eyes return back to the rear-view mirror. Backseat’s empty. Slowly, you turn your head to view behind the seats, checking for signs of the thing. Nothing. Still, keeping the steady turn, your head comes back to facing forward. The backseat, passenger seat, dashboard, a sinking feeling enters your body. Face-to-face, sitting on your lap like two kids sharing a swing, lightless, your grandmother straddles your lap. Wrinkled skin, threatening to fall from her face, houses the creature like smeared paint on a portrait, her eyes dark and lifeless, cooking apron once marred with white flour, now dyed red. Her lips part, sending a wave of rotten air into your face. Yellow teeth, sharp like a canine’s, peer through the crack in her lips.\n\nThe last thing you remember is that horrible rotten smell.", "action_results": []}, {"action": "Drive off", "result": "There’s no point in sticking around. They’re not coming. Your grandfather isn’t one to act against his word. If he’s not here, if no family members or Father Mark appeared by the five minute mark, then they’re not coming. Idling the Challenger a minute longer won’t change that fact, besides upping your chances of not escaping.\n\nYour foot slams on the clutch, and your hand brings the stick to first. In a slight spin-out, spraying more gravel in the air, you leave the cottage behind, eyeing the home through the rear-view mirror as you make your escape. Your mother, father, Emma, grandparents, even Father Mark: they’re as good as dead. The things witnessed in that damn cottage are from the devil, no mistaking that fact. You’ve never been religious, but you say a quick prayer to the man upstairs, begging for your family’s safety. He doesn't answer back.\n\nRain continues to pelt against the Challenger’s hood, the wipers doing as well as you’d expect from the aged parts. The single lane road through the Appalachian forest is quiet, save for the rain. Somber gray skies peer through breaks in the treeline, basking your escape in dreary weather, fitting for the circumstance.\n\nYour foot presses harder on the gas. The sooner you’re out of the Appalachian, the better.\n\n10 years later…\n\nYour elbows rest on the hard bar top, shoulders slouching just above. It’s not a comfortable position necessarily, but it’s the only one that draws close. Although, that’s more likely attributed to the lowball glass in your hand. Johnnie Walker Red Label, your go-to, the only bandage for the things you’ve witnessed.\n\nEven that thought brings a slight chill to your body.\n\nThe smoky scotch burns a strong flavor on your tongue. You swish it around, allowing the burning to spread to your lips. The past ten years have not been blissful, to say the least. Countless nights awakening in sweat, remember the dark bags underneath the thing’s eyes, drooping skin threatening to fall from your grandmother’s aged bones. No, you’d rather not remember. At least whiskey numbs the thoughts. For a while. Then, eventually, the buzz wears off, and your mind resumes playback on the horrors witnessed. Back to the bar, and the cycle continues. You’ve driven far away from the Appalachian, to the furthest place you could get. California.\n\n“Nice ride.”\n\nNext to you, a young woman appears smiling. Her blonde curls rest just past her shoulders, framing a face with too much makeup on. Does her natural face really need that much? Apparently so.\n\n“Thanks,” you reply. “She’s a ‘73.”\n\n“Do you take passengers? I have gas money,” the woman says, touching her pointer finger to her nostril. If scotch is a bandage, cocaine is fucking makeshift splint. It does the trick for a short while, but eventually it wears from usefulness. Thirty minutes, tops. Still, that’s half an hour of peace, thirty minutes of suppressing the memories.\n\nSomehow you muster a smile, doing your very best to ignore how you really feel. “Wheel’s up in five. I’ll keep her running, but if you don’t show, I’m taking off.”\n\nThe woman nods, smiling, and rushes to gather her things. She better fucking show.", "action_results": []}]}, {"action": "Follow him to the cottage", "result": "As your grandfather heads towards the cottage, you run to the shed’s double doors. It’s not automatic, so you have to manually open each one. Once it’s open, you climb inside the Rallye, feeling the cold leather seat against your back and the sturdy wheel. The engine roars to life with your turn of the key, settling down to a throaty growl, warning nearby prey that it's king of the jungle.\n\nHeeding your grandfather’s warning, you slide the stick into first and stamp on the pedals. She spurts forward, leaving behind a spray of gravel. Then, you exit keeping the engine running. No doubt, your grandfather would hear the engine starting up. The less he worries about you, the better. Your family is still inside the cottage. After quickly searching the shed for something to arm yourself with, you follow your grandfather’s footsteps, the wooden handle of a handaxe in your palm.\n\n---\n\nHe’s a good kid. He shouldn’t be exposed to these things. This is my battle, has been for nearly half a century. I barely made it out last time, me, after all my military training, after facing real combat. No, better for him to escape. Leave this all behind. I couldn’t live with myself otherwise. My son’s family is as good as dead. At least the grandson will make it out. At least one will survive. It’s all my fault. Best I can do is try and correct it now. Make sure the thing can’t harm another family.\n\nStorm’s picking up. The old man swings open the back door to the cottage. A gust of wind blows at the same time, catching the door in its path like sails at full mast, sending a chunk of wood flying from the cottage wall on impact. The old man and his axe enter the cottage.\n\nThe first thing that greets him is Father Mark. Rather, Father Mark’s body. Claw marks cover his chest, the red streaks like bloody shooting stars. His eyes have been pecked out. One eyeball dangles to the side of his cheek as if cargo hauled up by a rope. Unable to close his eyes, putting his friend to rest, the old man removes his trucker hat and places it over Father Mark’s face. The first victim claimed. The old man knows it won’t be the last. His grip tightens on the woodcutter’s axe.", "action_results": [{"action": "The guest bedroom", "result": "No lights are on in the cottage, save for the guest room. Like a moth to a flame, the old man makes straight for it, testing light switches on the way. They’re all dead. He hopes the same couldn’t be said for his family. Axe in front, he enters the guest bedroom. Shattered glass lies on the floor, a hole in the TV the obvious source. No sign of anyone.\n\nThen, the old man notices a pair of shoes sticking out from underneath the bed. Judging by the loafers, it must be his son’s.\n\n“Son!” the old man whispers. No response from the pair of shoes. The old man gets on his hands and knees and flips the bedskirt open. Sure enough, it’s his son’s shoes and legs, just...there’s no torso. The ground lies red, dyed from from the top of the severed legs. Quickly, the old man pulls his gaze away. That fucking monster.\n\nI’m saving those for later, unless you’d like to taste them now.\n\nDual voices project from the doorway. His Susan, the thing stands at the opening, staring at the ground hiding the whites of her eyes. Her body sways, though she’s standing still, as if upheld by loose cord. There’s a new apron tied at her waist and neck. This one reads, HOPE YOU BROUGHT AN APPETITE, a dinner plate and silverware displayed like a skull and crossbones.\n\n“I’ve beaten you before, and I’ll beat you again. There won’t be another return for you,” the old man threatens, his hand on the axe.\n\nYou were weak then, and you’re weak now. Look at you, frail, probably can’t even get an erection. Do you want Suzy to try? Stick my hand down your pants and feel your manhood?\n\nSusan walks forward, her body shrinking with each step, her hair changing to blonde pigtails. Wrinkles in her face disappear, as if given a good ironing. In her smaller, childish frame, she steps out from your grandmother’s clothes, leaving the apron hanging from her neck. The words have changed to A GRANDMOTHER LIVES ON KISSES.\n\nI’ll do all the work for you. Don’t you want to rip my apron off? There’s nothing in the back.\n\nSuzy does a tiny twirl, letting the old man see her exposed backside.\n\n“No…” the old man answers. “This is wrong. I’ll not let you use my Susan.” He charges forward, axe overhead, ready to chop the thing down. Suzy scowls, her face briefly turning to it’s wrinkled state, still attached to the child’s body. She waves her arms as if throwing an imaginary ball from each hand, one after the other.\n\nTwo objects fly in the air towards the old man. With speed surprising for his age, two swings of the axe cut the forms mid-air. Like a stone in a river, the objects redirect around him, cut cleanly in half. Blood sprays in the air. The objects, now four, lie behind the old man, two pieces of his daughter-in-law, two pieces of his son’s torso, both pairs of eyes frozen, horrified, mouth spread open in a fish-like manner.\n\nWith a yell, the old man charges forward, this time pulling the knife from his belt and throwing it at the thing. This is not a fight where he can afford to play on the outside. He needs to get in close, down in the trenches, gain victory through grittiness. Suzy ducks, reacting with otherworldly quickness. The knife plants itself behind her in the hallway wall.\n\n---\n\nThe only source of light, the guest bedroom, draws your attention. Your grandfather’s voice and sounds of struggle cause you to hurry, not stopping at Father Mark’s body to check on him. You already know there’s nothing you can do for him. Maybe you can still do something for your grandfather.\n\nA whirl of air, and a knife plants itself in the hallway wall not ten feet from where you’re standing.\n\nHeavy footsteps echo the cottage, the charge of your grandfather. You imitate, abandoning the slow, steady, silent approach. Axe in hand, you break into a run, the sound of your footsteps and elevated breath cutting through all other noise. It only takes a few steps to break into the guest bedroom. Light bursts into your eyes, bringing spots with each blink at the sudden change from the dark.\n\nYour grandfather’s woodcutter’s axe lies on the floor next to him, the girl from earlier, the one you saw with Father Mark, crouches over your grandfather’s body wearing nothing but an apron, her bare backside exposed to you. This time, you do not freeze. Axe raised overhead, you charge, you rush to do what your grandfather failed to do.\n\nPain.\n\nBefore you can react, the girl picks your grandfather’s axe from the floor, swiping it backwards. It’s head buries itself in your chest, sending you sprawling next to your grandfather’s body, stiff, the feeling of your limbs starting to subside like slowly dipping your arm in freezing cold water, starting with your fingers, then moving upward. The girl rises to peer at you, visibly confused at your entrance, like her father just explained the Tooth Fairy’s secret. She bends down over your body, hands on her hips examining you, the loose apron at her neck falling just low enough to expose a pair of nipples on the verge of becoming womanlike.\n\nMovement suddenly explodes from your grandfather’s body, his hand finding the hand axe brought by you. All it takes is one. An uppercut swing, one strengthened by years of work, decades spent chopping, sends Suzy’s head flying across the room. Her head hits the wall, like a loose projectile in a pillow fight. Her body transitions back to its wrinkled, aged state, still in nothing but the apron.\n\nYou struggle to breathe. Each breath feels like it’s pressing the axe further into your chest. Your limbs begin to shake, although you have not the control to stop them.\n\n“You were...supposed to leave,” your grandfather manages to say, collapsing back to the floor.\n“I...I..” Words don’t appear. Your mind is a flood of memories, the wave too much to organize a coherent sentence. Warmth suddenly grips your hand. The coldness rushing over your body stops as you focus on the source of heat. Your grandfather’s hand grips yours. It’s calloused, rough, comforting. He squeezes gently, reassuring you that everything will be alright. At this moment, it is, the love of your grandfather displayed in one tiny squeeze of the hand. His grip softens, becoming limp, losing strength. Soon after, your strength fades as well.", "action_results": []}]}]}, {"action": "Help Father Mark", "result": "Your grandmother, Suzy, the thing lands on top of Father Mark, raking his chest with claw-like hands. The Father utters a yell of surprise, which is quickly drowned out by the ravenous scratching at his chest. She crouches over his body, fingers scraping at his torso like a bear scooping a fish from a stream.\n\nYou break into a full sprint, fully intending to tackle the thing from Father Mark. Red pools begin to form on the floor beneath him, but he’s definitely still alive. As you draw near, Suzy turns, her face curling into a smirk. She lets you tackle her. Your shoulder blasts into Suzy, blasting her from Father Mark’s body.\n\nYou land on top of Suzy, her small frame fitting perfectly under yours. With a child-like grin, her eyes meet yours for a second, briefly exposing innocence. Quickly, they change, brewing, emanating something sinister. The grin returns to a smirk, like she knows a secret that you don’t. Suddenly, her mouth bites at your exposed neck, tearing into your flesh.\n\nLike a vice, her jaws clamp down, holding firm despite your attempts to shake her off. Satisfied at the damage, she releases the bite, allowing spurts of blood to geyser from your neck. She flashes you a toothy, red smile, your blood dripping from her lips and cheeks like a child with a milk moustache.\n\nColdness sweeps over your body, your mind becoming faint from blood loss. You lie unmoving near Father Mark, listening to Suzy returning to claw open his chest. You hope you die completely before she turns back to you.", "action_results": []}]}]}]}, null]}]}, null]}]}]}]}, {"action": "Find your mother", "result": "This dude is creepy, and he’s giving you the heebie-jeebies. You know what happens to kids that talk to people who put the strange in strangers. They get their picture posted on the news next to a psycho with a giant MISSING banner.\n\n“I’ve got to help my mom. See you later,” you politely say, hoping you never actually see him later. The man grunts, shrugs, and pulls a container of chewing tobacco from his back pocket, forgetting about you almost instantaneously.\n\nInside, you find Mom searching high and low for some good ranch dressing. This might be the only store in America that doesn’t host Hidden Valley proudly, like a trophy displayed in a glass case. She has to settle for an off-brand called “Secret Mountain.” The secret might be in the questionable ingredients.\n\nNot making eye contact with you and still scanning the shelves, she speaks. “I’m glad you came with me. I know your grandparents house isn’t the most entertaining place, but I know it means a lot to your father.”\n\nNot bringing up the point that you didn’t have a choice in the matter, you reply. “It’s not so bad. There’s a box of old VHS tapes in our room.”\n\n“That’s great, Sweetie,” your mom answers. “Between you and me, this might be one of the last times you’ll get to see Grandpa and Grandma.”\n\nHaving lost your grandparents on your mother’s side, the statement doesn’t surprise you. Still, it’s not the most cheerful of subjects. “They don’t seem that old. Well, they’re old, just not old enough to...you know.”\n\nYour mother answers. “They’re spry, all right. The thing is, though, the body starts to shut down at their age.” She pulls a jar from the aisle, eyeing it, reading the ingredients, then places it back.\n\n“Their generation had some nasty habits with diet and they smoked like a good salmon filet. And don’t even get me started on their drinking habits -- different times, I guess. All that’s to say, Grandma and Grandpa weren’t very kind to their bodies, by no fault of their own. I’ve seen it before with my own parents. Between you and I, I’ve seen the toll it’s playing on Grandma. You might not see it because, like I said: they’re spry, but I’ve caught glimpses of an underlying condition. You probably think I don’t pay attention when I’m reading, but a mother--”\n\n“--has eyes in the back of her head,” you complete the statement, trying your hardest not to roll your own pair, resting in its normal place.\n\n“That’s right,” Mom beams. Losing the smile, she continues. “She’s hardly sleeping; I can tell. Beneath her makeup are two large backs resting under her eyes. I can tell when a woman’s stressed and doing her best to pretend everything is okie-dokie. Grandma’s perpetually exhausted, and I hope your father will help her relax. I hope we all will.”\n\n“Me too, Mom,” you answer, not really sure how to react to your mother telling you your only grandparents will probably die soon.\n\n“All we can do is be there for them. Same goes for your father. Now help me with these groceries, and let’s get back to the gang.”\n\nIgnoring the word choice of “gang,” you do as she says.", "action_results": [null]}]}, {"action": "Investigate", "result": "You slide out of bed, stepping on several of the pillows thrown to the ground. Your phone is charging on a nearby nightstand, and you instinctively pick it up. The phone light turns on for a brief second, brought to life by movement, and a picture of Slipknot's album cover, Iowa, appears, two nails sticking from a wooden fence, propping a goat upright by its horns. Using the screen for light (the camera flash would be too bright), you exit the guest room to find the source of the sound.\n\nThe hallway is dark. On one end, opposite of your parents' room, the soft glow of a night light shines from a socket low to the floor. You creep towards the light, for one, you'd rather walk where you can see, and two, the footsteps sounded like they were running this way. You walk on the balls of your feet, crouched down slightly as to limit the sound of your steps. Part of you thinks if the earlier footsteps didn't wake anyone else up, then they definitely won't be woken by your normal steps. Still, you don't want to announce exactly where you are.\n\nAs you approach the tiny night light, you see the light is shining from a rushing wave of water, The Little Mermaid behind it holding a bright smile above her seashell bra. Next to The Little Mermaid, her fish friend (you don't remember the name) jumps through the water, smiling back at Ariel, eyes locked with one another. Still crouched, you slow your breathing and strain your ears to see if the earlier sounds appear.\n\nNothing.\n\nQuiet as before, you slink back towards the guest room, taking one last glance down the hallway before slipping back into the bedroom. Simultaneously, as you shut the bedroom door, The Little Mermaid night light blinks dark as if someone or something temporarily blocks the light in passing, then it resumes its shine, unassuming, as if nothing ever happened.", "action_results": [null]}]}]}, null]}]}, {"action": "No", "result": "“No thanks. I’ll stick around here...in case Grandma needs help with anything,” you answer, almost leaving off that last bit. Your answer seems to satisfy Mother, although she’s a bit occupied and likely only made the suggestion to seem useful. Across a narrow archway leading into the shag carpeted living room (red carpet, no less) Emma shouts for you.\n\n“Hey! Come look at this, Bro!”\n\nSurprised at the outburst, and courtesy, you slide out from the dining chair. It squeals on the linoleum floor, mirroring the music you were listening to earlier. So that’s all it takes to be a rockstar, huh? Who woulda known! Your sister is sitting in a table top position, hands and knees, head poking into a bookcase.\n\nAs you draw closer, you see she’s flipping through a photo album. Clear plastic sheeting lines the pages, allowing the photos themselves, polaroids, to be untouched by grimy children’s fingers. Her finger draws to one image in particular. It’s a black and white photo of a younger version of Grandpa. He’s standing next to a wide-looking tree stump, leaning a woodcutter’s axe against his shoulder nonchalantly. Normal enough, except for his face. Brow furrowed, his gaze seems to be staring through the photo. At you. Corner of his lips slightly curled upward as if he knows something you don’t. Beneath his brow, his eyes glow white, a result of improper lighting. The longer you stare, the brighter they seem to glow.\n\n“Grandpa was buff, huh? Too bad you didn’t inherit that,” Emma exclaims.\n\n“What’s with everyone talking about my muscles today,” you speak, more to yourself.\n\nAfter flipping through more of the pages, pleasantly bored, you hear your mother call from within the kitchen, no doubt still staring at her novel. “Go find Grandpa, it’s almost supper time! Emma help me set the table!”\n\nAfter giving Emma a shrug, you place the photo album back and head outside looking for Grandpa.", "action_results": [null]}]}]}, {"action": "Talk with your family", "result": "You pop a headphone from one ear and ask, “Are we almost there yet?”\n\nYour father, eyeing you through the rear view mirror, speaks from behind brown-rimmed spectacles. “Not yet. Give it another hour or so. It’s only been twenty minutes since the last time you asked.” As he talks, his blue eyes blink, bobbing up and down with head movement. Your mother, in the passenger seat, keeps her head buried in a Nicholas Sparks novel. You sigh and glance out the window. All you see are streaks of green floating atop sturdy brown.\n\nYou rest your head on the cold glass window, propping the side of your chin where the door juts out at the base of the glass. Light rain starts to drip down from the sky, sending little streaks of water racing one another across the window’s width. You start to make tiny bets on the droplets. Off to the races! Sir Wets-a-Lot takes off in a burst of speed, taking the lead from Rainer Joe! Here we are, folks. Down to the wire. It’s a close, neck and neck, race. And -- Rainer Joe overtakes Sir Wets-a-Lot to take the victory!\n\nNumbly, you force the headphone back in your ear and crank the volume. So much for small talk, although many conversations don’t go unlike the one you just had with your parents. Electric guitar soon draws you into a squealing, heavy-metal trance as you let your mind wander for the remainder of the journey.", "action_results": [null]}]}