{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=4477", "context": "", "first_story_block": "    \n It was very quiet and the white of her knuckles made him shiver.\n\n   \n\n  Nathan Cross placed a hand over the girl's, her tiny fist easily cupped in his long, golden fingers. It was the hospital room he was assigned in, cold and pale in a blend of bland white and the lightest shade of blue. It draped her eight-year-old form as a blanket, her sillouette etched into the sheets. It was indeed very, very quiet. The lively zigging line on the heart monitor  was not giving a quiet tick, nor was it continuously bleeping. The tree scraping against the window was not scraping. It was as if he were deaf - deaf and dumb.\n\n     Nathan came to a frightening revelation.\n\n     Where was he?\n\n     He was no nurse, no doctor, and he did not know this girl - He was a drywaller, nothing else.\n\n     And then the eight-year-old's china blue eyes snapped open, little blue lips opening and speaking words so quiet that he could not hear them. He leaned down, unconsiously, to catch but a tiny noise from her lips. It was silent for a brief moment, and then she gripped the sides of his face with the still-white little fingers and screamed shrilly into his ear.\n\n\n   It was very silent then.\n\n ", "action_results": [{"action": "Start the Game", "result": "His eyes snapped open, an unruly haze of confusion spreading across his face and coming out his mouth in short, frightened gasps. He was no longer in the bland, soft hospital room. There was no longer a blue-sheet laiden bed, and there was no longer a danty little girl safely inbetween the covers.\n\nNo, this was worse; horrible, terrible.\n\nThe room had but one light hanging in the middle, flickering his grimy surrounding to him with flashes of pools of light. The walls were oozing with wet, waxing marroon, greasy with mold and smeared with something rusted and putrid.\n\n\n \n \nHe was the same person - Nathan Cross.\n\n\n \nHe knew this for sure; his surroundings were no longer the same, but his body was nothing different of his usual self. Except that his reddened ears throbbed from a past, echoing screaming. A tight, crisp child's scream.\n\nWhere was he?\n\n ", "action_results": [{"action": "Search North of the Room.", "result": "You found a rusty Pipe.", "action_results": [null, null]}, {"action": "Search the South of the Room.", "result": "You found a rusty key. What's it for?", "action_results": [null, null]}, {"action": "Search the West of the Room.", "result": " \nThere's a broken chair.\n\nInspect it further?\n\n ", "action_results": [{"action": "Inspect futher.", "result": "You search under the cushion of the broken chair, and find a pocket watch. It's old - and unopenable.", "action_results": [null, null]}, null]}, {"action": "Search the East of the Room.", "result": "There's a door.\n\nAre you sure you want to enter/leave?", "action_results": [null, {"action": "Yes.", "result": "Nathan took quiet steps from the grimy, red-rusted room, and looked around silently. The hall  was a one-way only path, doors spreading along the walls - his breath left his lungs.\n\nThere was something at the end of the hall - something bubbling and festering.\n\nHe couldn't tell what it was, but it was groaning in pain, festering and wriggling. It was swollen into a huge ball of flesh, so inflamed that it was stuck in the doorway. And sweat - or whatever the hell it was - was slipping down it's apricot skin, from it's pores, collecting and burning at the brown tile floor.\n\n ", "action_results": [null, {"action": "Go into the first door on the right.", "result": "You walk in, and find the smell of blood and flesh hitting your nose almost immediately. Red liquid rushed past your feet. Blood? Recoiling and trying not to vomit, you look up...\n\nNathan looked up at the room, and chills brought the hair on the back of his neck on end. There were people hanging from the ceiling, dangling and  dripping blood and interwining intestines. Like something had ripped them in fucking half. The faces were contorted in pain, and were almost watching him, gazing at him emptily.\n\nHe watched forward quietly, holding his stomach and feeling a horribly sick churning in it. The eyes of the deathly-silent, dangling corpses were following his movement with there red, bloodshot eyes. Their bottom halves were strewn along the room, and every step he took was slippery and slimy under his shoes.", "action_results": [{"action": "Look around.", "result": "The Handbooklet to The Free Hand.\n\nNote: This has nothing to do with the story in general; it just gives you tips and information on this game.", "action_results": [null, null]}, null]}, {"action": "Go into the second door on the right.", "result": "You walk into the second door on the right, and your eyes immediately dart back and forth, watching. It appears your paranoia is more than you think.\n\nNathan stepped into the room quietly, his eyes staring at the small, misshapen form in the middle of the room. He wasn't sure what it was, but with what he's seen so far, he'd rather not risk his neck over it. Hell, it couldn't get any worse than his. It turned, and looked at him with beady little eyes, and its breathing becoming erratic and eerie. It was as if it were afraid of something, but he wasn't one to know the feelings of these sick, dimented things.\n\nHe side-stepped, feeling his heart rattle unsteadily in his ribs. It was moving like a slug toward him, and a moonlit light coming from the window revealed it's form further. It was disguisting - absolutely disguisting. He was wrong about everything - it could get worse. Much worse; hellishly worse. And the sudden realization that that thing was human from the waist up made him shiver and shake. From the bottom down, a revolting mixture of dog and incomplete organs.\n\nIt opened a wide, slime-ridden mouth, teeth not even yellow, but a moldy green. It's words were slurred, almost tearful.\n\n\"Kill...me...\" It almost whispered.", "action_results": [null]}, {"action": "Go to the first door on the left.", "result": "You enter the room, and find nothing in particular worth looking at.\n\nUntil you look to the right, and notice another door. You walk to it  - it's locked.", "action_results": [null]}, {"action": "Go up to the creature stuck in the hall.", "result": "You walk up to the creature, and find it even more disguisting than from afar. Nothing you can do, with the hallway blocked. There must be another way through...", "action_results": [null]}]}]}]}, {"action": "Stumped on how to beat the story? Here's a Walk Through", "result": "If you are stumped as to how to beat the game or get the best Ending, here's a walkthrough composed by a good pal:\n\n \n \nOkay, Get everything in the first room you're in - the rusty pipe, the pocket watch, and the rusty key. Leave the room. From here, just go to the second door on the right to find a monster. Use your pipe to kill it, and then take the medikit.\n\nDon't bother with going anywhere else but the first door on the left from here. Go into the first door on the left, and use the rusty key. Don't pick up the picture (you don't use it at all) in the room, just Leave.\n\nEnter the Hall, and then continue on until you meet Allie and Richard. Remember that Medikit you got? Use it here. You'll end up saving Richard and getting Teamwork - a useful tool to kill enemies quickly. But don't waste it! In order to get the best ending, save it!\n\nGo onward until you have to fight the beast/monster. Use your pipe to kill it, and then take the knife from it. Pass up sitting in the chair - there IS an item here, but you don't really need it to win.\n\nGo into the room with the clocks, and look around. Use the pocket watch on the indention in the wall - it opens a door. Go inside, and then take the stairway and open the door to find the last boss.\n\n'Kay, she's gonna' jump at you. You can do this many ways -\n\nIf you didn't let Richard die, you can use teamwork twice or so to kill her (just make sure one is left).\n\nYou can use your knife to kill her, your pipe, or have a knife-pipe combo. Heck, even a teamwork/pipe or teamwork/knife combo is possible.\n\nIf you DID sit in the chair and busted it open in the really white room, you can use that.\n\nOnce she's dead, and Nathaniel is crying, you can do the following to get the endings:\n\nFor Ending #1: You could die during the fight. I only tell you this now because this ending shouldn't be the one you want. It's basically dying.\n\nFor Ending #2: Just walk out the door.\n\nFor Ending #3: Use Teamwork while Nathaniel is crying.\n\nThere you go!", "action_results": [{"action": "Back to Start", "result": "    \n It was very quiet and the white of her knuckles made him shiver.\n\n   \n\n  Nathan Cross placed a hand over the girl's, her tiny fist easily cupped in his long, golden fingers. It was the hospital room he was assigned in, cold and pale in a blend of bland white and the lightest shade of blue. It draped her eight-year-old form as a blanket, her sillouette etched into the sheets. It was indeed very, very quiet. The lively zigging line on the heart monitor  was not giving a quiet tick, nor was it continuously bleeping. The tree scraping against the window was not scraping. It was as if he were deaf - deaf and dumb.\n\n     Nathan came to a frightening revelation.\n\n     Where was he?\n\n     He was no nurse, no doctor, and he did not know this girl - He was a drywaller, nothing else.\n\n     And then the eight-year-old's china blue eyes snapped open, little blue lips opening and speaking words so quiet that he could not hear them. He leaned down, unconsiously, to catch but a tiny noise from her lips. It was silent for a brief moment, and then she gripped the sides of his face with the still-white little fingers and screamed shrilly into his ear.\n\n\n   It was very silent then.\n\n ", "action_results": [null, null]}]}]}