{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=48337", "context": "", "first_story_block": "My name is Claire of Lune. I have two parents who care deeply for me and a younger brother who annoys me. We live in a log cabin far outside the town of Lune, and the town is far away from the city. We work hard all day to tend our crops or rebuild our stuff, but it is a life I like. Each person in the town has something special about them. Hick can chop down trees faster than anybody. Martha can seduce any man, as long as they’re unmarried. Old Man Roberts can read. I can tell some good stories.\n\n\nWell, they say I do at least. I don’t think they’re that good in comparison to the story Old Man Roberts reads. He has a few books. They’re about long forgotten tales of heroism and bravery. He wants everybody to call him Gramps. I do.\n\n\nRight now, my family is sitting around the fire. I’ve wrapped myself with a blanket, but I’m still cold. It’s freezing outside. I don’t like the cold or the snow.\n\n\nI lean up against my father. He’s warmer than I. I say, “Will it warm soon, Father?”\n\n“Hopefully not,” he remarks, “The crazies have a better chance of freezing.”\n\n“Will they ever come out here?”\n\n“Is there food?”\n\n“Yes Sir.”\n\n“Then they will as long as they’re still breathing.” I shudder.\n\n\nThe fire barely provides any light. The windows’ curtains are drawn, and we don’t have any candles lit. Shadows dance across the floors and walls. My memories of building our home are hazy. Everything seemed bigger back then. I was fascinated by the notches we had to make in order to fit together the logs. I was so excited to climb up the ladder and play in the upper loft. My brother and I still enjoy sleeping up there.\n\n\n“You two should go to bed,” says my mother. She’s the strict one.\n\n“Do we gotta?” asks my brother.\n\n\nMy parents do not answer his foolish remark. Instead, they stare at him with an emotionless gaze. He nods.\n\n\n“Goodnight mother. Goodnight father,” we say together. I hug my father; I hug my mother. Then, I scale our rickety wooden ladder up to the loft. The floor creaks after every footstep I take, but I do not fear. We built this house well.\n\n\nI lie down in bed and close my eyes tightly. I have the same problem that I always suffer from. My head does not wish to sleep.\n\n\nI think of men and women stalking in the night like wolves looking for a wounded deer. They are hungry. Some don’t have a mind left while others do. The mindless ones are easy. My father learned to shoot bows from an Indian whose name was Joe. Joe still lives here, and he’s the best bowman I’ve ever seen. My father shoots an arrow through the heads of the mindless ones to put them out of their suffering.\n\n\nCan a person suffer without a mind? When it cracks, does everything become bliss? I really don’t want to find that out for myself, but I imagine that they still feel something. Their flesh rots from their bones, but no bird or maggot eats the decay.\n\n\nIt’s the ones with a mind that I fear. They’re fine physically. They were mostly from the city. I don’t know if anything is still there, but many men, women, and children fled. They got hungry. When people are hungry, they want to eat just as much as the mindless ones. Those people go all about looking for food, and the smart ones go out here. We are farmers, so we must have food. The problem is that there was a blight. We hardly have enough to survive. Some try to take it by force, but we and the town have killed many single people.\n\n\n“Richard,” says my mother, “What are we going to do?”\n\n“What else can we do?” He sounds so sad. He’s always happy around me. “We should be able to make it through the winter. Then, we’d plant our food. Lune will stick together like it always has. The crazies will die off from the cold and hunger. Things’ll be hard. We’ll make it though.”\n\n“We're isolated, but that doesn’t mean we’re invisible. Dorothy was found dead this morning. A mindless crazy got her.”\n\n“Hush, they still might-.” His voice trails off into a whisper. They’re still talking, but I cannot discern their voices any longer.\n\n\nI lie in bed and pray for sleep to take me. My arms and legs throb from my labors. My stomach grumbles unsatisfied by my meal. I want to have the bliss of sleep envelope my body, but the respite does not occur.", "action_results": [{"action": "Awaken", "result": "My eyes shoot open. That was a large thump. It was from outside. I sit up in bed, and see my father putting on boots. He grabs only his rifle and puts on his coat. He hands Mother a revolver and puts a finger to his lips. He opens the door. Cold wind and snow blow into the house. He shuts the door quickly.\n\n\nI climb down the ladder being careful to not wake my brother. My mother turns to me. She shakes her head and points at me. Then, she points back at the loft. I still come down.\n\n\nI stand next to my mother, and she says nothing. My ears strain to hear anything from outside. My mother holds the gun as if it’s a snake. Please, let this be a false alarm.\n\n\nThe handle turns. I smile at my overactive imagination.\n\n\nA man barges in. He pushes my mother down. The revolver falls onto the floor. He twists my mother’s arm behind her back. Two other men push their way inside and close the door. I stand motionless. My mother claws at the attacker’s face, but he punches her in the stomach. She stops and gasps for air.\n\n\nOne of them men grab the revolver while another grabs me. My brother sits up in bed. The man with the revolver points it at my brother.\n\n\n“Get down here, boy. We don’t want to hurt you,” the gunman says.\n\n“Do what he says,” orders my mother. My brother climbs down the ladder.\n\n“Sit at that table,” continues the intruder.\n\n\nMy mother and brother move to the table. I stand still. When my father comes back, he’ll have no chance. We have to fight.\n\n\n“Get on. Go with your folks,” the man holding me pushes me to the table. ", "action_results": [{"action": "Flee", "result": "I run under the arms of the intruder. I open the door. I scream as pain stabs me in my back. I fall onto the snow. My back is on fire. I reach back. It feels wet. I look at my hand, and it is red.\n\n\nThey’re shouting. I cannot tell what they are saying. Another gunshot pierces my ears. It was louder than the revolver. The revolver wielding intruder falls to the ground with blood and grey goo oozing from his forehead.\n\n\nI push myself inside the cabin. I hear another gunshot. My brother is crying. My mother is lying on the ground with a cut on her forehead. Another intruder tumbles back, but so does my father. The last man is holding the revolver. He fires two more times into my father. He does not react to the hits as his blood pools on the floor.\n\n\nThe man is crying. He leans over his two companions. He leaves them both and cries even more. My head feels light. I cry.\n\n\nI scream, “Father! Mother!” I shake. I cannot control it.\n\n\nThe man points his gun at me. I try to keep my gaze on him. It does not fire. Instead, he puts the gun in his mouth and pulls the trigger. He falls to the floor as well. My brother runs away and hides. I look at my chest. There is blood covering this side as well. I cough blood onto the floor.", "action_results": [{"action": "End It", "result": "I crawl over to the revolver. It still has one bullet left. I force my arm to not shake or my finger to not prematurely pull the trigger. I put the gun in my mouth as well. I hope this won’t hurt too much.\n\n\nNothing happens. I throw away the gun in a fit of rage. How dare it take everything away from me and give me nothing in return. I lie on my back next to the man who killed himself.\n\n\nI look over at my mother. Why is she even on the ground? Why couldn’t have she helped?\n\n\nI hear my brother’s crying. I suppose somebody in the town will take him in. The bastard is a wimp, and now he’ll be scarred for life. I wish he would’ve done something.\n\n\nI gaze at my father. Why did he have to check on that sound? If he would’ve stayed inside, then maybe we wouldn’t be dead. He had to play the hero. Thanks for nothing.\n\n\nI close my eyes. I wait for sleep to take me. It doesn’t. Darkness does.", "action_results": []}, {"action": "Wait for the Bleeding", "result": "I lie back. I focus on my breathing. I breathe in. I breathe out. I force my lungs to obey my will. I need to cough, but it won’t do any good.\n\n\nMy tears trickle into my mouth. They’re salty. I should’ve stayed. Then, my father would be alive. Is my mother even alive?\n\n\nI look over to her. She is lying on the ground. Her wound doesn’t appear to be a gunshot. Instead, it looks like somebody bashed her head. I think she’ll live.\n\n\nI hear my brother. He’s too young to do anything. Maybe he and my mother will be supported by our town. Maybe, he’ll heal emotionally one day.\n\n\nI gaze at my father. He was only trying to protect us by checking on the sound, but instead he and I are dead. I wish he is still alive. He deserves to live.\n\n\nI close my eyes. I’m so tired. I finally fall into rest.", "action_results": []}]}, {"action": "Comply", "result": "I sit down in a chair.\n\n\n“I’m Morty,” says the man with the revolver, “Don’t any of you move or make a sound. That way, he won’t get hurt.” He motions outside.\n\n\nI sit still. I cannot move. Tears fall down my cheeks.\n\n\nThe door’s handle moves again. My father comes inside. He’s looking down and stomps his feet.\n\n\nI think somebody threw a rock, but-.” My father stops speaking when he sees the other men. Morty is holding the revolver to my mother’s head.\n\n“Drop it slowly,” demands Morty.\n\n\nMy father looks at us. Without taking away his gaze, he lowers his rifle to the ground.\n\n\n“Sit down with your folks,” says another intruder. He picks up the rifle. “I’m Jacob. That’s Huxley. He’s Morty. Where’s your firewood?”\n\n“We still have some in here,” my father responds, “It’s in that box.” He points to it. They throw more firewood on our dwindling fire.\n\n“Can your woman cook up something warm?” asks Morty.\n\n“Of course,” she states. She stands up and moves into the kitchen. Huxly follows her.\n\n\nJacob moves to the fire he takes off his gloves. His hands have ice crystals on them. They’re pale. He tries to push off the ice and snow off of his beard and clothes. He outstretches his arms and basks in the amazing heat. He looks younger than my father. I suppose his parents are dead by now.\n\n\nMorty appears to be faring better than Jacob. His orange hair is not covered in ice now is his skin as pale. He’s awfully thin. I think Huxly is thinner.\n\n\n“Will you have any visitors any time soon?” questions Morty.\n\n“We always check on our neighbors in case this happens. I’d suspect they’d come tomorrow or the day after.”\n\n“How many people are in the town?”\n\n“Oh, many. They’re all armed like I was. We don’t take prisoners, but we don’t track people who haven’t hurt anybody.”\n\n“I get it. Well, you better understand that we don’t want trouble either. There’s a large group of the crazies coming this way. We’ll only stay until morning.”\n\n“Just don’t hurt my wife or kids.”\n\n“Just don’t force me… What’s your name?”\n\n“I’m Richard.”\n\n“What about the rest of you?”\n\n“That’s Claire and Amos. My wife’s Ladonna.”\n\n“It smells like she can cook good.”\n\n“She does.”\n\n\nWe all sit in silence again. My mother steps out of the kitchen with a pot. She hooks it over the fire and sits down at the table.\n\n\n“Sorry about hurting you,” says Huxley. His face is still bleeding from my mother. She doesn’t say anything in reply.\n\n\nTime passes by at a snail’s speed. I pray that the pot will heat up soon. I don’t know how long their manners will last.\n\n\nMy mother goes over to the pot. I think it’s soup. She stirs the soup and steam rises from the top. She goes back into the kitchen and comes out with spoons and bowls. She picks up the pot and pours it out for the men. They grab the spoons and bowls and devour their sustenance.\n\n\nThe rifle is sitting on the floor. The revolver is in Morty’s britches. I could grab the rifle. No, it is too far away. I could run outside to look for help. No, I’ll freeze. It’s too long until I can find town…", "action_results": [{"action": "Run Outside", "result": "I push down my chair and push open the door. I don’t hear any gunshots behind me. I run through the snow. If I run fast enough, maybe I’ll make it.\n\n\nI run down the road in my nightgown. The snow is up to my ankles. I trip and fall. My legs feel bruised, but I stand back up. The wind is cold. I shiver.\n\n\nI remember autumn when the fields produce their bounty. It is a time of joy before this time of depression. I wish it was warmer. I always enjoyed fishing and letting my feet dangle in the cool waters.\n\n\nI turn around to check if I have a pursuer. I do not, but there is a trail of blood coming from my feet. I run harder. Running makes more heat.\n\n\nHave the intruders killed my family? Did I endanger them? It doesn’t matter. I have to save them. They could die without my help. Why did they even find our house? This doesn’t make sense.\n\n\nSlowly, the coldness that grips my body transitions into warmth, but it is a bad warmth. It is like being burnt by the sun. Something is wrong with my skin. It’s too cold.\n\n\nI run faster. Tears drop down from my eyes. My nose is like a waterfall. My hands look red. I feel so tired.\n\n\nThere was once a bird that sang at my window. It was many years ago, but I remember her fondly. She just sat there and chirped away. I would lie in bed hiding the sun with my covers, but I would always stand when I heard her. I had to see her. I had to know the provider of my joy.\n\n\nI fall again. My arm bleeds. There’s a deep red line running down. I limp forwards. I must go forwards. It has to be soon. It has to be just beyond my sight.", "action_results": [{"action": "Lune", "result": "I can see the village. It is so close. I fall to the ground. I try to stand, but I fall again. I use my arms to pulls myself through the snow. It is so close. I have to reach it. I edge my way towards a home.\n\n\nI crawl up the front porch. At the foot of the door, I bang on the wood. I scream for help. Old Man Roberts opens the door.\n\n\n“Dear God, get inside,” he says. He picks me up and lays me by the fire. He takes off my soaked gown and lays a blanket on me. I feel so warm, yet I am so cold.\n\n\nThrough my teeth, I stammer, “Fa-fam-ly.” I do not know if he heard me. Darkness overtakes me. It’s a warm shade of black, and I am not quite sure if its sleep or death which embraced me.", "action_results": []}]}, {"action": "Do Nothing", "result": "I sit. That’s all I do. What else is there to do?\n\n\nI watch the men as they eat. I do not make eye contact with them, and I’d rather be invisible. The soup drips from their mouths and into their beards. Jacob’s skin still looks pale while Huxley can’t seem to eat fast enough to satisfy his flesh.\n\n\nMy mother is a statue. My brother sobs without a sound. My father is slouched. We’re powerless.\n\n\nThe three intruders fill their bowls again. Morty drops his bowl and mutters a word I do not understand. He doesn’t clean up the mess. Instead, he refills his bowl.\n\n\n“You got a rope?” asks Jacob.\n\n“Excuse me?” replies my father. He glances at my mother.\n\n“You got a rope? You know, a good one?”\n\n“No.”\n\n“Stop lying. I want to get some shut eye. You and your wife need to be… well, restrained. It’s all logical.”\n\n“It’s in the barn.” The other two men stop eating.\n\n“I may be hungry, but I ain’t that stupid. You got bed sheets. We’ll use those. Girl, go get yours.”\n\n\nThey are going to tie my parents? Will they do anything else?\n\n\n“Girl,” says Jacob.\n\n“Y-Yes,” my eyes open wide.\n\n“Get your bed sheets.”\n\n“Yes mister.”\n\n\nI stand up. I glance at my parents, and my father nods at me. I walk to the ladder without any haste. I look over my shoulder twice. These men are insane. It is not a good idea to sleep in a house of people who you just invaded…\n\n\nI climb to the top of the ladder. There is my bed. I used to look forward to sleep in it. The mattress was my key to hours of rest. Now, the sheets are a method of misery and humiliation. I take them off. There’s a thick one made of wool and two thin ones. I lean over the side and drop them on the floor. I cringe as the sheets fall into the spilt soup.\n\n\nHuxley takes a thin sheet. He walks behind my father who doesn’t look at the brute. My father places his arms behind the chair, and the man ties the sheet onto the chair. I’m pretty sure it was a poorly made knot. Jacob does the same to my mother. My brother still cries.\n\n\nI slink down to my family. Jacob sits in one of our chairs and closes his eyes. Huxley has the rifle, and Morty has the revolver.\n\n\nTime moves by at an alarmingly slow rate. My parents occasionally shift in their seat. Jacob sleeps. Morty and Huxley warm themselves by the fire. Even my brother leans his head against the table to sleep. I do nothing.\n\n\nIs it even possible to do nothing? Nothing cannot be anything, so does one have to do something to actually do it? Am I partaking in the act of remaining motionless? Am I refraining from doing? More importantly, why I am so bored when my life is in danger? This is supposed to be a serious situation, yet I almost wish my father would mention our checkers board to them.\n\n\n“What do y’all do for fun around here?” I am brought from my daydream. “Is all you do work, eat, and sleep?” continues Morty. My parents do not answer him. He might become angry if nobody answers him.\n\n“We, we do many things, mister. We have checkers. We talk to our neighbors or play outside. I tell stories.”\n\n“Can you read?”\n\n“No.”\n\n“So you give oral ones to them?”\n\n“Yes.”\n\n“Can you give one to me?”\n\n“Um… sure.” What should I say?", "action_results": [{"action": "Tell a Story", "result": "I say, \"Um... Well, there once was a castle that sat on top of the hill. It is still there, and you can still stand under it in awe. It took the riches of one queen over her entire lifetime to build it. The finest craftsmen, the greatest masons, and the most gifted artists of the kingdom all converged into a single place for decades.\n\n\n“Its walls were decorated on the outside with the white marble from the western mines. Its highest point almost could reach heaven. The drawbridge was made of the thickest cedar from the old Tyre kingdom to the South. That is just what the people outside could see. They were mostly stuck in city that surrounds the grand castle. Though, the city had running water and an underground sewer system that had never been seen before.\n\n\n“Inside the walls, oh, it is hard to describe. Silver ran through the seams of the stones. Tapestries detailing history and folklore drape from every wall. Those walls stretched higher than even the old churches. Their ceiling was curved, and I never learned of how they accomplished that. There were windows looking out that the visitor could use. They were very long and so thin. Each hall had doors which led to stables, great halls, servant’s quarters, royal quarters… They even had a bakery. It was its own town.\n\n\n“My first memory was in the halls. I was lost and crying. I felt trapped, for nobody was around me. It was only me. I’ve been told that a guard brought me back, but it was those walls that I remember. When I ran my hand across their magnificence, they felt cool. I would secretly lean against the walls during the summer. When I would pull my body off the walls, there was a small patch of sweat left behind.\n\n\n“The people were happy living under the rule of the queen. There were no wars, for there was peace with the surrounding lands. The navy was beyond compare that was docked in the port. In the morning, I stood in awe gazing at the sun as it rose through the sails.\n\n\n“The queen had two children. One was a boy, and the other was a girl. The girl stayed inside most of the hours, but the boy played outside. They were as loved as the queen, but the boy was adored by all. He took the name Daivat the Magnificent. He grew up in the ways of the warrior and the diplomat. His fame grew powerful as his body matured.\n\n\n“One fateful year, the queen became ill. She laid in bed for days with her daughter attending her every need. She died on a moonless night with her children around her. The queen ceased to be, but a King was thus born.\n\n\n“Everything was fine.”\n\n\n“Stop,” demands Morty, “Your story sucks.”\n\n\nWill he come after me? No, he turns back to the fire. I am fine. My heart is racing. My body is sweating. I’d rather be bored now.\n\n\n“Damn,” hisses Huxley, “Did you hear that?”\n\n“What?” asks Morty. Huxley kicks Jacob. He moans.\n\n“They’re here,” whispers Huxley. “They must’ve followed the smoke trail like we did.”\n\nJacob asks, “The crazies?” Huxly nods. “Should we put out the fire?”\n\n“It won’t matter,” laments Morty.\n\n\nI look at my parents as the men continue talking. My mother shrugs her shoulders. What if there are crazies outside? I could maybe untie my parents without them noticing me. What if there aren’t any of them out there? If I untied my parents, then the men could be scared enough to shoot us.\n\n\nI ignore the men’s chatter and strain for any sound from outside. The popping of the fire and their words drown all other sounds. If there are crazies, then I would have no idea. They go for door, or at least the smarter ones do. Is the door even locked? No, it isn’t. These intruders are dump beyond redemption. Should I lock the door, or should I free my parents? If I do nothing, then they’ll shoot us. They aren’t stable enough. The men are starving and suffering from frostbite. They are like crazies with a partial mind.", "action_results": [{"action": "Untie my Parents", "result": "I stand up and move behind my father. I look around as if nothing is amiss, but my hands attempt to unravel the knots. They haven’t noticed me, but they do look afraid.\n\n\n“Girl, get back in that chair,” says Jacob. I nod and do so immediately. My father’s arms fidget. I hope I untied enough of them.\n\n\nI hear a thump. A gun is shot. I duck under the table. They are trying to kill us. They spotted me.\n\n\nI hear screaming. It’s one of the intruders. Cold air is blowing in. Someone catches on fire. My father is out of his seat. There’s growling. I hear gurgling and gasping for air.\n\n\n“Please!” yells Morty. Something rips, spatters, falls to the ground.\n\n\nSomebody grabs my legs. I kick and crawl away. It lets go. Moving bodies are everywhere. I run through the chaos. I have to get outside. I can warn the town.\n\n\nArms grab me. I scream from their grip. I kick and twist. The arms slam me into a wall. My head rings and throbs. I see the intruders. They’re all dead. One arm is in the fire. A spine is on the ground. My mother is screaming. It’s coming from outside. Where’s Father? Where’s my brother?\n\n\nI am dragged outside. The winter air bites at my skin.\n\n\nThere are men. They’re everywhere. Their muscles bulge. Their eyes are black. Drool leaks from their mouths. I can feel the drool dripping on my neck and down my back.\n\n\nI hear grunts. I see five of them. One is bleeding from a gunshot. They head inside. I see one more lingering in here. Tears cloud my vision.\n\n\nI am pushed to the ground. I see the outline of one come to me. He towers over my form. They weren’t supposed to be in groups.\n\n\n“Girl,” it growls. It is more animal than beast now. Why am I alive? My mother screams again.\n\n\nIt grabs my chin forcing me to look up. The others are all watching and feasting on the intruders. This one is taller. I am yanked up. He looks excited.\n\n\n“Do it,” he demands.\n\n\nI am now in summer. This is summer. Nothing is wrong. I am fishing. Fishing is so peaceful.\n\n\nMy line is being tugged at. I pull back on my rod. I see the line move back and forth in the water, so I jump to my feet. I raise my pole and snatch the fish before it could free itself.\n\n\nThe fish squirms in my hand. The slime is cool and sticky, so I set it onto the earth. It tries to flop to the life-giving water, but I smash its head in with a rock. It squirms no more. I toss it into a pile of other fish.\n\n\nIt is helpful that nobody comes out here. The skies are peaceful like the waters below. The only ripples of my world are the ones caused by me. Then again, there are countless other places to fish with bounty since this is my special place. Nobody comes into my special place.\n\n\nI shove my last piece of worm into the hook. The metal pierces through its intestines which pains the still living creature. Blood seeps out. It makes a plop when the hook and worm hit the water. I sit back on the ground and lean against the tree again.\n\n\nI yawn. The shade is relaxing. It’s so hot, so any break from the heat is something I enjoy. My line is tugged at again. I stand while keeping the rod steady to not frighten the fish. I wait for another tug. I stare with all the focus that I can muster. It has to move soon.\n\n\nNothing happens. I pull out the line from the water and into my hand. I examine the worm. There’s no evidence of any creature’s bite marks though it is still pierced. I shake my head and lower the worm into the depths again.\n\n\nI close my eyes and wait for sleep’s embrace.\n\n\nMy eyes open again, yet I do not know what waked me. I pull my hook out of the water and notice that the worm is gone. I set my pole down and pick up my net. I toss it into the pool of water. I pull out the few remaining fish. I carry the net over to the stream and release the fish back into their old home, for they deserve to make it back.\n\n\nI pick up my pole and the few fish I caught. Instead of walking home, I stare into the distance. The sun is touching the eastern mountains. Its red bleeds into the valley below filling the untouched lands with its rays. Birds chirp far above my head. I smile at their music, for it is an innocent song. I breathe in the fresh air and sigh.\n\n\nI walk back home on a game trail. My prints now cover what were once the tracks of animals. They don’t use this one that often anymore, for they still fear mankind and rightfully so.\n\n\nI set my fish down inside my home. Mother and Father are out in the fields sowing seeds for the fall harvest. My brother is with them helping their labors. I waive at my family from inside our home. They see me from the window and wave back.\n\n\nEverything is fine.", "action_results": [{"action": "Awake into Reality", "result": "I shiver. My breathe turns into a mist. My body aches. Bruises are everywhere.\n\n\nHeavy breathing comes from the kitchen. I’m inside my home. Except for a crazy’s corpse next to me, there’s nobody in here. The corpse is burnt, and flesh is rotting from the bone. The flesh falls off. The door is open. It’s bright outside. That one must’ve not left. I hope he suffered as he saw the sun.\n\n\nThere’s a trail of blood on the floor. Pieces of… I can’t tell. They’re pieces of people. It’s all in a line, several lines. All of which go to the kitchen from where the breathing emanates. The breathing is labored. The revolver is next to me, and I do not know if it has anything inside.\n\n\nI reach and grab the gun. My savior has three bullets, yet I hope to use only one. I sit up, and the floor creaks. A crash comes from the kitchen. I stand. It cannot reach me, for I am in the light. I could run and find help. Where is my family? My mother’s screaming no longer pierces the tranquility while I see no evidence of my father or brother’s demise.\n\n\nIt growls. The creature knows I am here. Rage swells inside me, for they took from me what I deserve. I deserve the innocence that I no longer have.\n\n\nI drop the gun and fall on my hands and knees. I heave until the meager contests of my stomach poor onto the floor. I continue to heave though there is nothing left, and my insides scream in protest.\n\n\nI cry. My tears fall into my vomit. I try to push the bile from my hands, though the stench is even more unbearable.\n\n\n“Damn you!” I shout. “Damn all of you and all of your kind!” I pick up a chair and throw it at the kitchen. It does not reach. I grab whatever is small and hurl it to the dark room. The beast grunts, but I do not see its form.\n\n\n“Come out, come out. Face me.” I slam my hands on the table. “Sniveling bastard, come out here!”\n\n\nThe beast does not emerge, so I take hold of the revolver again. I stand in front of the kitchen door.\n\n\nIs this a good idea?", "action_results": [{"action": "Leave", "result": "I open a trunk by the fireplace and pull out some clothes. It is, was my mother’s. I put them on, for I would freeze if not. I put on my shoes and put the revolver in my pocket. The clothes are loose, so I wrap a belt around myself.\n\n\nI open the curtain to shed more light into the living room. The beast will be trapped. The people of Lune will come and kill it.\n\n\nThe ground is covered in bare prints that go in all directions. I walk to the back of the house hoping to find something, or maybe my mother’s footprints could be leading away from this hellhole. I turn the corner and see what is back here.\n\n\nI lean against the house. My head feels dizzy. I retch again.\n\n\nHer clothes are ribbons. Her body no longer looks human. Bones covered with tissue and flesh without form are strewn about the ground.\n\n\nI want to cry. I want to feel despair, but I cannot. I cannot feel, for anguish has taken emotion out of my soul. I simply stare at what is left of her corpse. Maybe she was killed immediately and only her body was desecrated.\n\n\nI walk away. Down the street I go. I used to play here, for other children and I would run. Indians would battle Cowboys, or later the sane would battle crazies. Now, I flee a crazy in a trot.\n\n\nI can hear nothing. No birds sing, and no wind blows. Only the crunching of my footsteps on the snow reverberates through this lifeless desert.\n\n\nPrints, I see a pair of footprints in the snow. They’re small, much too small to be a crazy. I run along the path of the prints. It is a miracle they’re still here.\n\n\nThey weave along the path. It trends rightwards only to stumble back. Is there still goodness left in this world? If so, then I must find life.\n\n\nI stop running. There’s a mound of snow surrounded by the prints.\n\n\n“Amos?” I call. There is no reply. I walk to the mound. It’s a shelter. Inside, lays his body. I crawl to him. “Amos?”\n\n“I’m cold,” he whimpers. I smile.\n\n“Let’s go.”\n\n“I’m too cold.”\n\n“Then I’ll carry you. Get on my back.”\n\n\nI leave holding his legs. He says nothing else, but I can hear his breathing. His body is cold, and I dare not check for frostbite. Though, there must be.\n\n\nI continue to walk down the path.", "action_results": [{"action": "Lune", "result": "I see Lune.\n\n\nThe moment I do, I scream, “Help!” Townspeople rush out. They’re ragged and tired, yet they’re so much more alive than I. As the villagers reach me, I am bombarded with words.\n\n\n“Is your brother okay?” “Are you hurt?” “Is this a joke?” “Where’s your parents?” All their questions swirl together.\n\n\n“My brother is dying from the cold. Help him,” I demand.\n\n“I’ve got a fire,” says a lady. I hand Amos to her.\n\n\n“Why happened to him?” asks another villager.\n\n“People invaded my house. Then, crazies killed them. My mother was… I was… Is my father here?”\n\n“No, I am so sorry for what happened dear,” a woman laments. “Come with me. You need to go inside.”\n\n“There’s one left in my kitchen. There’s blood everywhere. Have the men kill it.”\n\n\nA man, he commonly led the other men, barks orders. Guns are brought. The men run down the path, and some are on horseback. The women force me to go inside. They take me to the house with my brother. He’s by a fire. He’ll live. That’s nice.\n\n\nI think the women know what happened. At least, I think they do. They try to give me a blanket, feed me food, or place me next to a fire. I refuse each time.\n\n\n“What can we do for you?”\n\n“Let me hear silence. Tend to my brother. Never let him see my house again.”\n\n\nThey nod. They merge with the swarm around my brother. Children are looking through the windows. The bastards don’t know what I’ve seen and felt, yet they view me as an attraction or something to entertain them. Don’t they?\n\n\nI reach my hand in my pocket. I feel the gun and rub my fingers up and down the barrel.\n\n\nI have done my duty. My brother is safe. There is no more work to do on the farm, for there is no farm… not anymore at least.\n\n\nI don’t see anything to do in my future. I’ll probably become an old maid now. My brother, he’s young. Maybe he’ll forget about all that has happened. I won’t. He won’t if I’m around.\n\n\nI grip the gun tight. Perhaps this still has one more use. I shake my head, and I finally sit down.\n\n\nI close my eyes.", "action_results": []}]}, {"action": "Enter", "result": "I take the gun in my hand. I march into the kitchen. I do not see it. The room is so dark.\n\n\nThe pots are thrown in all directions. The table is smashed, and its shards look like icicles. Human remains are half gnawed, though I can barely make out the face of Jacob. Blood, crap, and urine are on the floor and walls.\n\n\nI turn around. It is between the door and me, but it does not move to attack. It is still wearing clothes.\n\n\n“Father?” I ask. It gives no reply. “Father is that you?”\n\n\nIt moans and limps away from the door. One of his legs decomposes, for a ray of light shone from the doorway to his leg.\n\n\n“Can you understand me? Did you hurt me as well?”\n\nIt stops walking at a dark corner.\n\n“Why aren’t you attacking?”\n\n\nMy eyes adjust to the light. Though the face is deformed, it still looks like the man it used to be. I can see my father’s face. The face looks sad and pained.\n\n\nI swallow. Is he still alive in their watching helplessly? Is he dead?\n\n\n“I’m sorry,” I say. I pull the trigger. I am pushed backwards and slip in the blood. I fall into the floor, and my head is slammed into a pot.\n\n\nIt wails. It wails in pain like an animal.\n\n\nI stand and steady my feet. I pull the trigger again. The bullet goes through its head. Blood and goo splatter on the wall. I fire one last time.\n\n\nI leave the room.\n\n\nMy bare feet are bleeding from splinters, covered in crap, and soaked in blood. I use what’s left of my nightgown to clean them.\n\n\nI climb up the ladder to the loft, and put on some of my clothes and my belt. I want to lie in bed, but I cannot forget my family. My mother or brother may still be alive. I take my coat and head outside.\n\n\nI feel as though I have been punched in the stomach. I’m disgusted. I wish to rip out my heart, for I have killed my father. I lean against the house. The world rotates around my head, so I sit in the snow.\n\n\nI’m so dizzy; I’m so horrible. I am a murderer.\n\n\nI wanted to kill my father. The crazies deserve to die, but my father did not. I… I don’t know what to think. I’m too tired.\n\n\nI walk. I stumble forward to Lune. I stop, for they would kill me. Yes, that would be my punishment for killing my father. No, that doesn’t make any sense.\n\n\nWhat am I going to do?", "action_results": [{"action": "To Lune", "result": "I go to town, for they may pity me. I wobble down the road drifting both right and left. I look at my feet to know that I am walking, for I can hear nothing. A sharp ringing won’t escape my ears.\n\n\nWhat will happen when I reach town? Will they hang me, or will they shoot me? Maybe I can say that I found my father already shot. Yes, I could do that. I can say everything else truthfully, so I will live.\n\n\nThe world is covered in white, but I can see a splotch of black in the distance. It is not Lune.\n\n\nAs I near, its movements become apparent. I call out for help, and it stops. I rush to it, but I slip in the snow. I push myself back to my feet and continue running. It is my brother.\n\n\n“Claire,” he says. His teeth chatter.\n\nI kneel next to him and ask, “Are you okay?”\n\n“Yes, Pa saved me. Where’s he? Where’s Ma?”\n\n“I don’t know.”\n\nHe says something too quietly for me to hear.\n\n“Can you say that again? My hearing isn’t working well.”\n\n“Can you help me get to Lune?”\n\n“Yes, how are you alive?”\n\n“I made a shelter. It got too cold.”\n\n\nHe climbs on my back, and I pick him up. My legs ache. My entire body is sore, dirty, and tarnished.\n\n\n“Are you crying, Sis?”\n\n“No.”\n\n“You are.”\n\n“Save your strength.”\n\n\nThose intruders, they killed my father. They caused me to be attacked. They caused my brother to freeze and my mother to disappear. If it wasn’t for them, we’d have had the door locked and our fire no longer burning. The crazies would’ve passed by or failed to get inside. Instead, they came. At least they died.\n\n\nI take step after step. I want to sit and give my legs a rest. I want to close my eyes and sleep away my sorrow. No, the weight that presses on my back must reach Lune. My brother deserves to live, for he did nothing wrong. Yes, he’s annoying, but I love him.\n\n\nThere it is. Lune is just a speck, but it will only become closer now.\n\n\n“We should call for help,” I tell my brother.\n\n\nHis screams pierce my ears. My screams echo his. We yell, “Help.” Help is something I wish we had a day earlier. No, we were too far from them.\n\n\nMen and women rush to us. I let my legs buckle. I crash to the snow. It’s alright now. My brother is safe, and he will survive. That is all I want now… Well, my mother is missing.\n\n\n“Tell them that mother is missing.”\n\n“Okay.”\n\n“Never let them tell you anything about our Father.”\n\n“Okay.”\n\n\nWe are surrounded. Hands grasps at us. Mouths say words that I do not understand. My brother says something to them, but I cannot discern them either. It’s like the world is outside and I’m stepping back into a cave. Darkness creeps into my vision, and sounds are hard to hear. I feel cold.\n\n\nI close my eyes. I smile.\n\n\nIt’s time to rest. I don’t particularly care if I wake up.", "action_results": []}, {"action": "To Nowhere", "result": "I stagger into the forest. I go in no direction. I take a left and a right then a left and walk forwards. I trip over a root.\n\n\nI stand and walk again. I have to get away from everything. Everything is wrong.\n\n\nI see footprints. They are my own, but the impressions are in front of me. I turn around, and they’re behind me as well.\n\n\nI sit down. I am lost.\n\n\nI look up. Trees circle around me. I can hear nothing, for ringing drowns out any other sound.\n\n\nI shiver, for I am cold. I am so cold, yet I do not wish to be warm. I wish to sleep and never wake up. That is how I must escape. I look at a tree again. Yes, this can be my savior.\n\n\nI take off some of my clothes and tie them together. I wrap it around my body and climb up a tree. Its trunk is thick and its branches are long, so it should suffice.\n\n\nI reach a thick branch that has none below. I tie my rope around the wood. I take off my belt and tie the other end of the rope around it. I pull the belt around my neck to where I can hardly breathe.\n\n\nI look over the edge. I take a step.", "action_results": []}]}]}]}, {"action": "Lock the Door", "result": "I rush to the door.\n\n\n“Stop!” yells Morty. I do not pay heed. I pick up the wood and lay it in the two slots. The door is locked.\n\n\nI am yanked back. “Get away from there,” Jacob hisses. I am pushed down. The other two men tip over my parents, and they lie on the ground as well. I can see Jacob’s sweat on his brow. He sees me staring at him. He puts his finger to his lips.\n\n\nThe floor outside creaks. Huxley covers my brother’s mouth. The floor again creaks only to be followed by another. A voice rumbles from the other side of the wall. It’s harsh and without life. Another voice responds with a grunt. The front door is pushed. The lock does not budge. We will be fine. We will be. The lock will hold. It will.\n\n\nMorty unties my father. My father unties my mother. The door will hold.\n\n\nI jump. The wall has been slapped. It is slapped again. The voices become louder. The voices gain in number. I tremble.\n\n\nThe window is bare of all but glass and a curtain. I’ve never heard of glass being broke. Have the crazies killed all who have seen it?\n\n\nI close my eyes. I close them tight enough to hurt my face.\n\n\nBanging, creaking, shrieking, yelling, pushing, roaring, tapping, moaning, breathing. It’s all so much. I don’t want to be here. I want to run. I have to. No, I mustn’t. I’m caged, trapped. There’s no way out. No quarter is spared to me, for they rape, kill, and cannibalize.\n\n\nThe door is pushed again. I hear a crack from the wood. There’s no gust of wind, so the door must still be closed. When will light come up the horizon? When will light drive away my peril?\n\n\nI close my eyes tighter. I focus on my breathing. I inhale and exhale in my lifelong ritual. In and out. It’s simple. I do it without thinking most of the time, but now is not the case.\n\n\nIs that what I hear? It’s nothing. I open my eyes. Jacob is smiling. I pray for the sound of footsteps leaving in the snow, but I hear none. No, I hear nothing. Is there still something?", "action_results": [{"action": "In the Morning", "result": "I yawn. The fire is out. The three intruders are standing and moving. It was their footsteps that woke me. Light peeks through the curtains. I stand.\n\n\n“They’re gone,” my father says. I nod. There’s no joy in my heart, but there is relief.\n\n“Here’s this,” mumbles Morty. He hands my father the two guns. My father takes the guns from his hands and sets them on the ground.\n\n\nThey each say “Goodbye.” None of us shake their hands. I hold my hand up in a motionless wave. They leave our home one by one. Through the door, I see the entire ground, and it’s trampled by footprints as far as my eye can see. Red snow is at the edge of the forest. The door closes.\n\n\nMy mother moves into the kitchen carrying the empty pot of soup. My father sits in a chair. My brother is on his lap with his face buried in my father’s chest.\n\n\n“Will they be gone forever?” I ask.\n\n“The men, yes,” my father replies, “I cannot say the same for the crazies. The tracks are too many for one or even a dozen. Claire, we’re only alive because they never realized we were inside. If they were in any way smart, we’d be dead or worse.”\n\n“Will we leave for safer places?”\n\n“To where?”\n\n“Will I leave?”\n\n“To whom?”\n\n“Am I going to die soon, Father?”\n\n“I don’t think so.”\n\n“What are we going to do?”\n\n“We’ll head to Lune. There’s more people, good people.”\n\n“What does Mother think?”\n\n“She agrees.”\n\n\nI walk to the curtains and pull them open. The white snow makes my eyes squint. The scars of evil are left behind in the once virgin winter. I cross my arms, for I am cold. I don’t want the world to be this way. I want it to be nicer, but it isn’t nice. No, instead it is foul and rotten. I wish there are maggots to consume the rot.\n\n\nI close the curtains. I climb up my ladder. I take off my nightgown and put on some clothes for today. I come down and head into the kitchen. I take a bucket, a sponge, and some of my mother’s water. I kneel where Morty dropped his soup. I clean his mess. ", "action_results": []}]}]}]}]}]}]}