{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=13274", "context": "", "first_story_block": "Sorry if you don't enjoy this game. This is my second game and first time using the advanced editor. Enjoy :)", "action_results": [{"action": "The First Page", "result": " \n\nPart One\n\n\n\n\nYou wake up in a dark room. You are lying on the cold, concrete floor and the outside light is shining on your face. You let out a loud groan and stand up. You take in your surroundings. What the fuck? You realize you are standing in the middle of a dark prison cell. You pace around the room, rubbing your head in anger. You start to panic.\n\n\nHow the hell did I get in here?\n\n\nYou walk over to the bars and start shouting for someone. Noone answers. You kick your bed and curse under your breath. You can't seem to recall any information of your past. You don't seem to remember anything. You can't even remember your name. You sit down on your bed and decide it's time to do something.\n\n\n ", "action_results": [{"action": "Examine the toilet", "result": "You walk over to the toilet and check around the outside. You see nothing of interest.", "action_results": [{"action": "Check behind the toilet", "result": "You look behind the toilet and see a flashlight. This could some in use.", "action_results": [null, null]}, {"action": "Check inside the toilet", "result": "You bend down and plunge your arm deep inside the toilet. You feel something plastic but you can't seem to pick it up, it's too slippery.", "action_results": [null]}, null]}, {"action": "Examine the bed", "result": "You walk over to the bed and examine the outside. Nothing but the dirty sheets.", "action_results": [{"action": "Check under the bed", "result": "You look under the bed and see something long. It looks like a crowbar. That could be of use.", "action_results": [null, null]}, null]}, {"action": "Examine the door", "result": " \n\n\n\nYou walk over to the prison bars and get a good grip. You pull but the door's don't budge.", "action_results": [null]}]}]}