{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=9770", "context": "", "first_story_block": "\"Whew...\" you sigh heavily as you walk through the door, undoing your tie as you walk in. You have just came to your suburban home from an especially exhausting day at work, and instead of retiring to bed immediately, you decide to sit on the couch and watch some TV. Your house is a 2 story house in a very populated development.\n\n\"Hopefully a new episode of House is on, I want some entertainment!\" you mumble under your breath.\n\nYou turn on the TV and the news is on. \"Typical of my wife to leave the news on..\" The newscaster is reporting on a local case of the rabies, where the ailed person attacked another member of his neighborhood. The neighborhood in mention is the next one over from yours.\n\n\"That's strange... I've never heard of a case of the rabies being televised before..\" you state. The newscaster goes on to explain that there was also another case of the rabies in another neighboring town.\n\n\"This is so strange\" you think to yourself. You shake it off, change into your pajamas and go to bed. It's just rabies. Maybe a rabid dog got loose somewhere? Maybe it's just a coincidence? Oh well, you block it out of your mind as just a way for the news to attract some attention to itself, and go to bed.", "action_results": [{"action": "The Next Morning", "result": "The next morning you wake up from a heavy sleep. You sit up and are in awe at the sight around you. Your room is in tatters, everything is destroyed. \"What the hell happened here?!\" You exclaim. After looking around your room, you hear a shuffling from downstairs. You then realize that your wife is missing. You think about going downstairs to check the sound out.", "action_results": [{"action": "You choose to go downstairs to check out the commotion", "result": "You get up from bed to see what the commotion is about. As you walk down the stairs, you hear the shambling and shuffling get louder.\n\n\"What the hell is going on...?\"\n\nYou also hear a strong moan coming from the hallway. You reach the bottom of the steps, and notice your wife, bloodied with tattered clothes, and bite marks upon her neck and arms. She snaps her hear in your direction looking directly at you. She then lets out a guttural roar. She starts shambling in your direction.", "action_results": [{"action": "Make your way to the kitchen! Fast!", "result": "You decide to run to the kitchen in hopes of finding a weapon. Unfortunately, the kitchen is right beyond your zombified wife! You notice that there is a small table with a brass lamp next to you.", "action_results": [{"action": "Lamp + Zombie's head = Success!", "result": "You pick up the lamp and whack the zombie over the head as hard as possible, knocking the zombie onto the ground. You step over her and grab your biggest knife from the kitchen. You run over to your wife and thrust the knife through her skull. \"Jesus christ... what is this thing?!\" you scream. You decide to head upstairs for your handgun. You go upstairs and grab the handgun, and head downstairs to the basement. You grab extra ammo, some first aid items, and a flashlight. You obviously grab a backpack for all your supplies. You also notice a large machete, but worry if it will be too heavy for your travels.", "action_results": [{"action": "Big knives = good", "result": "\"I'll probably need this\" you say confidently. You grab the Machete and put it in your backpack with the handle sticking out of the top for easy access. You put on the backpack and realize the weight difference is almost nonexistent. You walk outside to the garage for your car keys. Once inside the garage however, you realize that you also have your trusty bike.", "action_results": [{"action": "Grab the car keys", "result": "You decide the best course of action would be to take the car. Mobile protection, right? You quickly open the car door and hop inside. You slam the door shut and start the engine, alerting the horde of zombies in the neighborhood. They shamble to the car, pounding on it, trying to get to their mobile meal. You hurriedly put the car into reverse, running over a couple of zombies in the process. During all of the commotion, a zombie manages to climb on top of your car and onto the windshield. You swerve to get him off, but to no avail.", "action_results": [{"action": "(If you have the handgun) Shoot it in the head!", "result": "You pull out your handgun quickly and shoot the zombie in it's head, freeing your vision. You narrowly avoid a telephone pole, and travel down the street. You notice your tank is running on empty. You overhear on the local radio that the government is setting up an extraction point nearby. You drive to the exit of the development to find that your car has run out of gas. You see zombie are fixing on your position. You notice a thick patch of brush to your left side.", "action_results": [{"action": "Make a run for it out of the development!", "result": "You get out of the car to make a run for it. You think you'd be faster than a bunch of rotting corpses anyway. You leap out of the car, running for your life, but there are so many zombies that you begin to doubt your plan. You get closer and closer to the main highway, but as you reach it, you see a pile-up of crashed cars on both sides. Flaming zombies shamble towards you from both of the pile-ups. You panic, looking every direction to find an escape route, but find nothing. The zombies hone in on you and devour you whole.", "action_results": []}, {"action": "(If you have the machete) Hack through the brush", "result": "You quickly whip out your machete and head towards the brush. You slice and dice your way through the brush to a secluded spot. You rest for the moment, thinking you are safe' when you realize that you've made a path for the zombies, too! The zombies shamble slowly towards you, spelling imminent doom for you. The close in on your position and you do your best to fight them off. One eventually grabs hold of your arm and pulls you in. The zombies quickly have taste of their jungle-snack!", "action_results": []}]}, {"action": "Keep attempting to swerve (If you do not have the handgun)", "result": "You twist and turn the steering wheel, attempting to throw the zombie off of the car. You car is becoming harder and harder to control. After a couple more swerves, you manage to get the zombie off of the car. Now you're able to see, and realize you're 2 feet from a telephone pole.... You have no time to turn your car away from the telephone pole, and crash into it, killing yourself in the process.", "action_results": []}]}, {"action": "Hop on the bike", "result": "You think the bike would be a more practical idea. You quickly hop onto the bike and race down the street. Many zombies notice you, and shamble after you. Ay oncoming zombies you dodge, having increased maneuverability due to riding a bike. You ride your bike down the street and notice at the end of the road, a house boarded up. You see gun barrels pointing out of holes in the wooden planks. It seems like the house is well protected.", "action_results": [{"action": "Go to the house and knock on the door", "result": "You decide that talking to the survivors is your best bet at surviving. You bike up to the house and knock on the door. You hear someone walking down the stairs from the inside. \"WHO THE HELL'S THERE?! GO AWAY!\" a voice from the inside yells. \"It's okay! I'm a survivor!\" you say firmly back. \"How do we know you aren't infected?! Or bitten?!\" The voice yells back. \"Would you like to check?\" you say back. The door opens, and a burley man with a rifle stands in the doorway. \"Come with me\" he beckons. You walk with him up the stairs. He introduces you to all of the survivors. \"Now that we've allowed you to live, give us your supplies\" the burley man demands.", "action_results": [{"action": "Hand over your supplies", "result": "\"Here, just take them. If they can benefit you all as well\" you say to the survivors. \"Thank you. My name's Rick. Nice to have you aboard.\" the burley man states. THese are our comrades.\nRick points to 3 other people\nAliena, the medic, Derrick, the sharp-shooter, and \"Flamengo,\" an agent of sorts.\n\"Flamengo\" is dressed in a black suit with black sunglasses covering his face. Flamengo pulls you aside for a second while the other 3 pick off zombies.\n\"Hey, come walk with me for a second.\"", "action_results": [{"action": "Talk with Flamengo", "result": "\"I've got a proposition for you kid.\" Flamengo says. \"I'm a government agent sent to scout for an evac pad. I ended up getting stuck with these goons.\" Flamengo says, aggravated. \"We need to dtich these guys, and you look like a smart fella, I know where the government evac pad is.\"\n\n\"Go on...\" you say attentively.\n\n\"I can get us there, but we don't have the supplies. We need to steal em' from these idiots, what do you say?\" Flamengo asks.", "action_results": [{"action": "Government agent? Evac pad knowledge? Weapons? Sign me up!", "result": "You agree to Flamengo's plan and ask him what the first course of action is. \"Take the supplies, then we'll jet. Don't take what we don't need. You hear me?\" Flamengo says. \"Yeah, I get you.\" You reply. \"Take this bag\" Flamengo says, as he hands you the bag. He points to the storage room, and tells you to get the supplies from there. You walk into the supply room. Upon entering you gab all sorts of needed supplies. Ammo, med-kits, and food. You spot a double-barreled shotgun. The shotgun seems very heavy, but it'll give you the support you might need to fight off masses of zombies.", "action_results": [{"action": "Take the shotgun", "result": "You decide to take the shotgun. Blowing zombie's brains out, heck yes! You pack the shotgun in your bag. You realize it is quite heavy. YOu hear a argument brewing outside in the main room, followed by gunshots. You walk out of the room to see everyone but Flamengo dead. \"C'mon\" he says. \"Hopefully you packed correctly.\" You both walk downstairs and out of the house. \"Cmon! Hurry up!\" Flamengo yells. You find yourself struggling to keep up because of the shotgun. \"HURRY. UP!\" Flamengo yells at you loudly, attracting more zombies. Out of nowhere, a zombie grabs your bag. You struggle to keep it, but more come from behind. They grab you and make you into a mid-day snack!", "action_results": []}, {"action": "Screw it, leave the shotgun", "result": "You think the shotgun will slow you down, besides, you have Flamengo! You hear an argument taking place outside of the room you are in, followed by gunshots. You walk out of the room to see everyone dead except Flamengo. \"C'mon\" he says \"let's go!\" The both of you walk out of the house and make a run for it. Flamengo is shooting zombies left and right with amazing accuracy. You're glad you went with him! \"The extraction point is this way, keep up the pace.\" Flamengo says calmly. You both escape the zombie horde to see armored SWAT trucks with a fully equipped SWAT tram. They take you in and kindly greet Flamengo.\n\nCongratulations! You Survived!", "action_results": []}]}, {"action": "Blow Flamengo off", "result": "\"I can't do that to these guys\" you say. \"They just saved my life.\"\n\"Correction, fool. One did. And if you won't join me, someone else will. You'll regret this.\" Flamengo says angrily. Flamengo walks out of the room angrily, and you hear talking from outside of the room. You walk back into the house's main room to see an argument brewing between Rick and Flamengo.\n\n\"I just heard your conversation back there, you pig!\" Rick states angrily.\n\"You have no idea who you're messing with, idiot! I work with the government!\" Flamengo fires back.\nRick grabs Flamengo and shoves him to the ground.\n\"C'mon, man! Help me out here! He's gonna kill us all!\" Rick screams at you.", "action_results": [{"action": "Help Rick!", "result": "You decide to help hold Flamengo down. Rick pulls out his pistol and shoots Flamengo in the head. \"Damn traitors.\" Rick says under his breath, \"C'mon, we got zombies to kill.\"\n\"A massive horde's a-comin!\" Derrick states. \"Help us out, dude!\" Rick exclaims. He hands you some ammo. You quickly take a position from the window and pick off as many zombies as possible. The horde just keeps coming. All of a sudden, an armored SWAT truck pulls up to the house, and clears away as many zombies as they can. They storm through the house. \"C'mon! Get in the truck! We're here to save you!\" The SWAT member states. They escort you to the truck, and you drive away safely.\n\nCongratulations! You Survived!", "action_results": []}, {"action": "Keep the peace", "result": "\"Don't hurt him!\" you scram. \"We need all the help we can get!\" Rick shoots you a nasty look. \"... you have a point, I guess.\" Rick replies. Rick gets off of Flamengo.\n\n\"Thank you, Rick.\" Flamengo says. He then pulls out his pistol and shoots you in the head. \"Lousy, good-for-nothing idiot...\"", "action_results": []}]}]}]}, {"action": "\"No way! They're mine! GTFO!\"", "result": "\"NO way! Screw that!\" you say defiantly. \"Fine, have it your way, punk!\" The burley man says. The burley man picks you up by the collar of your shirt, and throws you out of the house and locks the door behind him. You see the survivors' guns retreating from their gun holes. Waves of zombies fix on your position, and devour you whole!", "action_results": []}]}, {"action": "Keep on biking by", "result": "You think avoiding the survivors would be your best bet. They could be a bunch of gun-crazy goons away! You continue to ride your bike down the street, dodging more zombies. You turn down the street to see the exit of the development, but a massive horde of zombies is in the way!", "action_results": [{"action": "They're slow, they won't be able to catch me", "result": "You shift your bike into high gear and make a break for it. \"Time to shine\" you say to yourself. You charge head-first into the zombie group. You kick some out of your way, and kick some over with your speed, but eventually one pulls you off of your bike. You kick and punch at the surrounding zombies, but to no avail. They grab you and sink their rotting teeth into your flesh.", "action_results": []}, null]}]}]}, {"action": "That'll be too heavy, no use weighing myself down", "result": "You think the weight difference would be too great, so you keep the machete at home. YOu then run back upstairs to your front door and open it. You notice zombies are everywhere. In the streets, attacking people, in cars. It's insane! You see your car in the driveway, and think that would be the best means of escape. You run to the garage to get your keys, when you notice your bike sitting in the garage as well.", "action_results": [null, null]}]}, {"action": "Juke the zombie out, and run past it", "result": "You decide to attempt to juke the oncoming zombie. Her shuffling becomes a fast limp towards you. As you try to squeeze by her, she grabs your arm and sinks her teeth into it. You scream in pain, but manage to get her off. You run to the kitchen and grab your biggest knife. You run up to the zombie and shove the knife through it's head. The zombie shuffles forward, almost touching you, and then falls over onto the floor, dead. You run back to the kitchen and bandage your gashed arm. You then remember your handgun underneath your bed upstairs.", "action_results": [{"action": "Go upstairs to get your handgun", "result": "You feel yourself becoming light-headed and dizzy. You pick up the handgun and decide to turn on the TV for any advice or insight into what's going on. You see a newscaster reporting from your neighborhood. \"...If you become bitten by an infected persons, please do not go near anyone living. The virus is transmuted via bites, and if you are bitten, you will become infected. I repeat, if you are bitten, you will become infected!\" You stare, wide-eyed at the screen. \"Wh-what?\" you stutter. You look at your bandaged arm, and then at your handgun. Back to your arm, and then back at the handgun. You raise the fun to your head, but pass out into the floor. The virus has taken a hold of you...", "action_results": []}]}]}, {"action": "Screw this! I'm going outside!", "result": "You decide it would be a better idea to just avoid your zombified wife all together. You turn around and open your front door. You make your way outside and hear your wife pounding away on the door behind you. You notice the streets are filled with zombies. There are also people trying to stay alive. You quickly notice your car, and you run into the garage to get your keys. In the garage you remember you also have your bike.", "action_results": [null, null]}]}, {"action": "You choose to stay in bed and turn on the TV", "result": "You disregard the noise, as it just could be the TV downstairs. You pick up the remote and turn on the TV. To your surprise and horror, you see the news on, with a newscaster reporting from the street of your neighborhood. Behind this reporter, are zombies. Many of them, attacking all of the scrambling, living people crossing their path. You are awestruck. The newscaster is talking into a microphone.\n\n\"If anyone is watching this, I warn you, our area has been taken over by bloodthirsty zombies! If you are still trapped within your homes, please arm yourselves. This is not a test. This is not a joke. Border up your windows and doors. Make sure you're safe. If you come face-to-face with one of these beasts, the ONLY way to destroy them is by destroying the brain, or severing the head. I repeat, the only way to destroy the zombies is by destroying the brain, or severing the head. Again, please, this is not a joke!\"\n\nThe newscaster then quickly turns around to find a zombie upon him. The zombie lunges at the newscaster, grabbing him and biting his neck. The newscaster screams in agony and falls to the ground. The cameraman panics, and drops the camera on the ground. The camera falls to the ground. You can still see the newscaster being feasted upon by now 5 zombies.\n\n\"OH MY GOD!\" you scream. \"I have to get out of here!\"\n\nYou quickly get out of bed and change into your normal clothes. You then search under your bed for your handgun, and quickly pocket it. You then head downstairs\n\nAt the bottom of the steps, you see your bloodied wife, in tattered clothes with bite marks on her neck and arms. She quickly turns her head at you and shuffles towards you.", "action_results": [{"action": "Fire! Kill it! Shoot it! Shoot the zombie in the head!", "result": "You steady your aim and fire you handgun. The bullet goes directly into your (now zombified) wife's skull. The (now dead) zombie falls to the ground. You sigh heavily and place the gun in your pocket. You run to the basement to grab some ammo and a backpack to carry things. After packing basic health supplies, extra ammo, and a flashlight, you notice a nice machete. You like the idea of having a backup weapon, but fear that your equipment will be too heavy.", "action_results": [null, null]}, null]}]}]}