{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=13454", "context": "", "first_story_block": "It seemed as if the countryside never ended. The longer the car drove along the old asphalt road, the more you began to wonder if your father was going to make you live like Laura Ingalls. The idea of moving to a small hick town was hardly your idea of 'a good childhood' as your mother put it. Rolling your eyes you crank up the volume on your ipod, drowning out the sound of yours father's old disco music playing in the car's CD player.\n\n\nFor some reason, your parents acted as if they didn't understand why you were upset about the move. You snorted in annoyance, realizing just how self absorbed they really were. They had yanked you out of the high school you had been planning to graduate from next year, away from all your friends, away from that boy you had just managed to get to notice you... everything!\n\n\nFuck my life, you think to yourself. \n\n\nYour little sister sits in her booster seat next to you, happily playing with her gameboy. She had cried when she had had to say goodbye to her friends, but she was only four. All she had to do was eat glue with some kid in her new kindergarten class and they would be BFFs.  You, on the otherhand, had to start from scratch and in the middle of the fucking school year!", "action_results": [{"action": "Bitch at your parents", "result": "Yanking one of the earbuds off your head, you lean to the side to get a view of your parents. Your father yawns and continues driving and your mother scowls out the window. It pisses you off. If they are going to be miserable, then why can't they be miserable at home?!\n\n\n\"Where are we moving again?\" You said, but what you meant was 'fuck you, fuck you, and fuck you!'\n\n\n\"Daphne.\"\n\n\n\"What, like the whore chick from Scooby Doo?\" You almost spit and your mom whirls around with a glare that nearly froze your blood.\n\n\n\"What's a whore?\" Your little sister inquires, not even looking up from her gameboy.\n\n\n\"Wren don't say that! It's a bad word!\" Your mom shrieks, making your ears ring.\n\n\n\"Ooooh, Lydia said a bad word, Lydia said a bad word!\" Wren sing songed.\n\n\n\"Shut up Wren!\"\n\n\n\"Lydia Eleanor Snow!\"\n\n\nOh joy, mommy dearest used your full name. Well shit, now you're in trouble.", "action_results": [{"action": "Daphne", "result": "\"There it is! Daphne!\" Your dad exclaims half heartedly. \n\n\n\"Yay, yay, Daphne!!!\" Wren bounces up and down in her car seat.\n\n\nFinally! You can't wait to stretch your legs as you crane your head in an attempt to see your new home. If there was a modern day Newberry like in Andy Griffith, Daphne was it. You kept waiting for Aunt Bee to waddle down the sidewalk. There were people walking along the sidewalk, going in and out of shops. At least there seemed to be an interesting in town area. But, it was no shopping mall.\n\n\nIf there were people your own age in this place, they were all in school. Everyone dressed as if it was still the 90's. On the plus side, you would look like Malibu Barbie compared to your class mates, but on the negative the guys probably didn't look much better. The town eventually ended into a suburban area, then continued down a gravel road.\n\n\nReally? A gravel road?\n\n\nThe sign said Flower Street. Toto, we're not in Kansas anymore... We're in hicktown. \n\n\n ", "action_results": [{"action": "Pull into the driveway", "result": "Your dad pulls the SUV into the driveway of an old ranch styled house. It was painted a pale blue, but the paint was chipping down and the previous white paint showed through. It had a big screened in porch and a brick carport. The lawn was thick and green and beautiful dogwood trees grew freely around the house, blooming with their flowers.\n\n\nOk you had to admit, it looked like some movie star's country get away. It felt a little glamorous to look around at all the old georgian and ranch styled houses which dotted the road, never too close or far from each other. It was different from the cookie cutter house you had grew up in on a cul-de-sac. \n\n\nNext door was white washed fence, enclosing several fat horses. Upon seeing the furry creatures, Wren screamed in delight. Secretly, the little girl inside you squealed too. Even if they had pot-bellies, their long manes and gentle eyes were just like you had seen in books and movies. But, you had never seen a horse in person before.\n\n\nThe car door opened and Wren was running straight for the horses. As she climbed the fence and sat on the top rail, several of the animals came trotting towards her. They probably wanted an apple or something. \n\n\nYou walked up onto the porch and opened the screen door. It screeched in protest, begging for some WD40 on its rusty hinges. Well, there would be no sneaking out through there after bedtime. The porch was big with a swing hanging off to the side. Big bay windows were next to the glass door. Reaching for the nob, you are disappointed to find it locked.", "action_results": [null, null]}]}]}, {"action": "Bitch about it to your friends", "result": "You whip out your cell phone and begin to furious tap away at the keypad. The letters just won't pop up fast enough and before long you are blowing up your friends phone with a flurry of ranting text messages. Your thumb almost starts to cramp, but you keep on pressing buttons furiously. After all, you have to send the last one before your friend replies and messes up your famous last words.\n\n\nOMG, I cannot believe this shit!\n\n\nWe are moving to bum fuck eqypt!\n\n\nAnd Chris had just started talking to me!\n\n\nWhere the hell is Daphne anyway?!!\n\n\nWe have been driving for like ever!\n\n\nAnd I haven't even seen another car\n\n\nMy dad won't turn off his disco shit and\n\n\nmom keeps looking out the window like a wiped puppy\n\n\nHow is school without me?\n\n\nIs fucking Mansleigh hitting on Chris with me gone?\n\n\nFucking bitch was always such a whore.\n\n\n~~<3Lydia<3~~\n\n\nYou hit send and wait impatiently for your friend, Ivy, to reply. Of course it takes awhile, her being in class and all. But, still you want to know what's going on now that you're gone. What's the saying? When the cats away, the mice will play?\n\n\nBeep!\n\n\nDamn girl... Your life sucks :(\n\n\nBut, hey maybe there will be hot boys\n\n\nat your new school? Those bumkin girls\n\n\nwon't have shit on you! You're way hot!\n\n\nLMAO Mansleigh? Where do you come up with that?\n\n\nBut, Ya! Ansleigh totally tried to hit on Chris at lunch\n\n\nBut, he was like \"oh shit\" the whole time.\n\n\nGotta go! Third period teach is a Biotch!\n\n\nIvy<3<3<3", "action_results": [{"action": "You flip your phone shut", "result": "Stupid Ansleigh, the two of you have been at each others throats since middle school! Everytime you got a new outfit, she would copy it! New hair cut? Oh snap, look who just got a new do herself? She was always one step behind, but told everyone that you copied her. What a stuck up bitch?! One time she had even started a rumor that you had had sex with Eric Noles! Freaking four eyes Eric Noles! The chess club president. The king of nerd! EW!\n\n\n\"Are we almost there, mom?\" You ask, pausing your ipod for a moment.\n\n\n\"Uhh, I think so. Maybe thirty minutes?\"\n\n\n\"That's what you said a hour ago!\"\n\n\n\"Oh just listen to Justin Bieber or whatever it is you kids listen to these days.\"\n\n\n\"Oh. My. God.\" Note to self, disown mother.\n\n\n\"Justin Bieber is so cute! I'm gonna marry him when I grow up!\" Wren exclaimed, grinning over at you.\n\n\n\"Ew, Wren! He'll be, like, forty!\"\n\n\nYour little sister just stuck her tongue out. \n\n\nPlease, please, please, please, please let this stupid town be close!\n\n\n ", "action_results": [null]}]}, {"action": "Game Mechanics(info)", "result": "This game has a lot of hidden objects, secrets, and other things to uncover. What you choose to look for, and how much you find, will determine the ending. Keep in mind, just because you found the ending doesn't mean you found all the secrets ;)\n\n\nMechanics:\n\n\nThe Diary-You will find a diary. There are only a few pages where you must read to move on. However there are hidden chances throughout the game to read it and it may or may not give you hints about what to do next.\n\n\nTime-The time variable is what will make it more difficult to find the items. You can only explore your home or in town in one go. Each time you click \"Time goes by\" it will subtract 5 from your time variable which begins at 100.\n\n\nLocations and objects-And some of the locations therein may house a hidden location which you must then figure out how to get into. These locations will hold major evidence, but may take multiple visits to unlock. Not only that, but some objects may be more than they first seem to be. \n\n\n ", "action_results": [{"action": "Previous Page", "result": "It seemed as if the countryside never ended. The longer the car drove along the old asphalt road, the more you began to wonder if your father was going to make you live like Laura Ingalls. The idea of moving to a small hick town was hardly your idea of 'a good childhood' as your mother put it. Rolling your eyes you crank up the volume on your ipod, drowning out the sound of yours father's old disco music playing in the car's CD player.\n\n\nFor some reason, your parents acted as if they didn't understand why you were upset about the move. You snorted in annoyance, realizing just how self absorbed they really were. They had yanked you out of the high school you had been planning to graduate from next year, away from all your friends, away from that boy you had just managed to get to notice you... everything!\n\n\nFuck my life, you think to yourself. \n\n\nYour little sister sits in her booster seat next to you, happily playing with her gameboy. She had cried when she had had to say goodbye to her friends, but she was only four. All she had to do was eat glue with some kid in her new kindergarten class and they would be BFFs.  You, on the otherhand, had to start from scratch and in the middle of the fucking school year!", "action_results": [null, null, null]}]}]}