{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=4139", "context": "", "first_story_block": "Welcome to Die Zombie! Die! Pt II. You don't have to input the code from the end of the first game, it just said that to make you play it. This story is a lot better than the first installment, as I have used player feedback to improve it, hopefully making it more enjoyable than the first installment.\n\nEnjoy, and tell me what I could do to make it better... nicely please.", "action_results": [{"action": "Begin", "result": "Lt Martin Ojel's Memorial Penetentary for the Criminally Insane. This is where you live at the moment. As far as you're concerned, you're not insane.\n\nCell No. 26. That's the name of your high security prison cell. But don't worry, jail life isn't that bad after the first 6 months.\n\nYou've been on your best behaviour.\n\nYou haven't tried to escape. This is probably because you are in the middle of the desert and there is nowhere to go. Even if there was somewhere you could go to, there are guards everywhere, and eight sniper towers around the compound. But today's your lucky day. The warden's decided that because of your good behaviour, you are allowed to have a TV in your cell. Isn't that great? You've probably got some TV storylines you'd like to catch up on.", "action_results": [{"action": "Turn on the TV.", "result": "Hmmm... not much good shows on at the moment. Maybe there's something on the news.", "action_results": [{"action": "Watch the news.", "result": "There is something on the news alright. There are people running. And there are people chasing them. But you can tell that these aren't just people. Not even people with leprosy going around and asking for money.\n\nThey are zombies.", "action_results": [{"action": "Zzzzz.....", "result": "You don't exactly sleep well that night. All you can think about is the huge army of zombies spreading around the country. Soon they would take over.\n\nThe next day,you don't really want to get out of bed. It's not a very comfortable bed. But then again neither is going outside. All the people in this nuthouse are either ranting drug addicts or psychopathic murderers. You could maybe watch the TV though.", "action_results": [{"action": "Gather your strength and go outside.", "result": "Outside you see all the inmates on two seperate sides a fence running down the middle of the yard. On one side all the inmates in straight jackets walk around clumsily, occasionally shouting insane stuff like 'down with rice crispies! They're EVIILLL!!!' and 'the apocalypse is coming, the time of purification is at hand.'                                                        You've gotta agree with that guy on the apocalypse part, but whether or not it will bring purification is another issue altogether.\n\nSuddenly some freak guy comes up to you and asks you if you're 'that guy that saw the zombies come out of the ground.'", "action_results": [{"action": "You say yes.", "result": "The guy smiles. \"Really? Great! I'm in here for paranormal illusions too. I was flying my jet bomber over a base in the Middle East and got abducted by an alien space craft. Then I went back there and bombed it, in case they did it again. Then I got sent here for attacking an 'unarmed' American research centre. But guess what? I've got a way to get out of here.", "action_results": [{"action": "Keep listening...", "result": "Taylor tells you that the warden is executing an evacuation tomorrow, as there are reports of infected zombie freaks coming towards our area.  All staff, personel and prisoners are being evacuated in buses. All we have to do is try and get off somehow. Without getting killed, of course.\n\nAfter a few minutes the warden appears at the top of a close building. She announces that the evacuation will take place at 11 am tomorrow.\n\nIt's 9 am now. you have 26 hours to prepare.", "action_results": [{"action": "Preparations", "result": "Tell Taylor what you think they should prepare first.", "action_results": [{"action": "Food", "result": "Taylor tells you that he just got off kitchen duty and he's got plenty of food.", "action_results": [null, null, {"action": "Weapons", "result": "Taylor asks you what you've got in your cell. You tell him that you've got a toothbrush, a TV, a plastic cup and... well... that's about it. Taylor says he can make some weapons from them. Not very good weapons but still weapons none the less. Here's what he gets: an electrical cord from your TV, a SHARPENED toothbrush and a cup (not much of a weapon at all really, but you still take it)", "action_results": [null, null, null, {"action": "Water.", "result": "Taylor tells you he's been keeping all his juice bottles from the last few weeks and he has filled them with lots of water to carry with you.", "action_results": [{"action": "Maps", "result": "Taylor tells you that he's stolen two maps, one of the area outside and one of the jail compound.", "action_results": [null, null, null, {"action": "Okay, that should be about it.", "result": "Okay, you and Taylor seem to have just about everything. You go to sleep and try not to dream too much about what bad things could possibly happen tomorrow.", "action_results": [{"action": "Zzzzz", "result": "The next day one of the guards gives a role call. You and Taylor both answer your names. Then they start rounding you onto the buses\n.\n\nYou ask quietly ask Taylor why you are both handcuffed and haven't really started to escape yet.\n\n\"Don't worry,\" Taylor tells you. \"I know what I'm doing.\"", "action_results": [{"action": "You try to run away", "result": "You try to run away, but a guard hits you back with his gun. It's awfully hard to run when your hands and feet are handcuffed together. You better just go on the bus, and hope Taylor knows what he's doing.", "action_results": [{"action": "Get on the bus", "result": "You get on the bus. You and Taylor are seated at the front, making it very hard to talk about escape without attracting the attention of the guard at the front. About five minutes after the bus starts driving away, Taylor gets a weird look on his face, like he's constipated or something. You look down and see that the chains on his feet have broken.\n\nIn one swift motion, Taylor stands up, goes to the driver and pull his handcuffs around his throat, pulls him off the chair and lies on the floor of the bus with the driver on top of his body, unconscious. The guard is obviously unable to shoot, or he might kill the driver. Wait a sec, if the driver's on the floor, then...", "action_results": [{"action": "Uh-oh...", "result": "The prison bus zooms off the road and flies into a convieniently located ditch. The armed guard, being the only one standing up, flies into a window and is knocked out cold. Taylor stands up, holding the keys he took from the driver's pocket. He somehow manuevers them into his handcuffs and unlocks them. Then he lets you free.\n\nWell, now what? You should probably take care of the guard first.", "action_results": [{"action": "Go look at the guard", "result": "You look at the guard. What should you do with him? Throw him off the bus, tie him up, or take some of his stuff?", "action_results": [{"action": "Throw him off the bus.", "result": "You throw the guard off the bus. Now to take care of the driver.", "action_results": [{"action": "Click on your shotgun to kill him (don't click here though)", "result": "I SAID DON'T click here! Click the gun!", "action_results": [null]}, {"action": "Throw the driver off the bus", "result": "You throw the driver off the bus.\n\n\"Now,\" says Taylor, \"what about the prisoners?\"", "action_results": [{"action": "Free them, and kick em off the bus.", "result": "You free them, then kick them off the bus. Taylor gives them a map for the nearest bus stop.\n\n\"Well,\" says Taylor, \"thats about everything. Let's go.\"", "action_results": [null]}, {"action": "Kick em off the bus.", "result": "Wow, you're really mean.\n\n\"Okay,\" says Taylor, \"let's go.\"", "action_results": [{"action": "Drive away the bus.", "result": "You and Taylor drive away the bus.", "action_results": [{"action": "I need to pee...", "result": "As you and Taylor drive away, you start to get that uncomfortable feeling that you need to pee. There's a gas station nearby, but unless you have a change of clothes, you'd be better off going outside in the bushes.\n\nSo, change your clothes and go in, or pee in the bushes? Unless of course you've got a cup with you?", "action_results": [{"action": "Okay, I'll go in the bushes.", "result": "Ooohh..... bad choice. Since you are in the middle of the desert, a poisonous desert snake strikes out from it's shady bush hiding place and bites you in the- well, if you're a guy... then yeah, it bites you there, but the point is that it bites you and you die.", "action_results": []}]}]}]}, {"action": "See if any can help you", "result": "One prisoner steps forward. He says his name is Jason.                                                                                                         \"It's okay,\" says Taylor, \"I know this guy. He comes from the cell next to mine. We can trust him.\"                                  You knod. If Taylor trusts him he should be okay. Besides, you like his name. Jason gets the other prisoners off, wishes them luck and gives them a map.", "action_results": [{"action": "\"Okay Taylor let's go.\"", "result": "You, Taylor, and Jason drive away the bus.", "action_results": [{"action": "Hey guys, I need to pee.", "result": "You tell Taylor and Jason that you gotta pee. There's a gas station coming up, and Taylor says that he's gotta pee too, but unless you have a change of clothes, you'll have to go in the bushes.", "action_results": [null]}]}]}]}]}, {"action": "Tie him up with the driver", "result": "You tie him up to the driver. You can keep them as hostages for now.", "action_results": [null, null, {"action": "Now what about the prisoners?", "result": "What about the prisoners?", "action_results": [{"action": "Free the prisoners and kick them off the bus", "result": "You free the prisoners and kick them off the bus. Taylor gives them a map so they don't get lost in the desert.", "action_results": [null]}, null, null]}]}, {"action": "Shoot him!", "result": "You're a hardcore criminal aren't you? Go on, use your shotgun then.", "action_results": [{"action": "Take his gun (and any other stuff he may have) THEN shoot him.", "result": "Here's what you find.", "action_results": [null, null, null]}]}, null]}]}]}]}, null]}]}]}, null, null, null]}, null, null, null]}, null, null, null]}, null, null, null]}]}]}, {"action": "You tell the little punk that he should mind his own business.", "result": "You tell the little punk that he should mind his own business.\n\nSuddenly his eyes go all weird and he bares his teeth.                                                                                                           The scrawny little dude picks you up by the throat. \"What did you say to me?!\"\n\nYeah, punk what'd you say?", "action_results": [null, {"action": "\"HA! I'm not afraid of you! Take your best shot!\"", "result": "The guy does take his best shot. It hurts. A lot. You wake up in the infirmary two days later.\n\nWell, you probably don't understand, but that little guy was your one chance in this story of escaping prison. You don't necessarily lose (although you lose a few teeth), but you don't really win either. Maybe you should play through this game again and see if you can get a better ending.", "action_results": [{"action": "Try again.", "result": "Welcome to Die Zombie! Die! Pt II. You don't have to input the code from the end of the first game, it just said that to make you play it. This story is a lot better than the first installment, as I have used player feedback to improve it, hopefully making it more enjoyable than the first installment.\n\nEnjoy, and tell me what I could do to make it better... nicely please.", "action_results": [null]}]}]}, {"action": "You completely ignore him altogether. This is a place for the 'criminally insane,' remember?", "result": "Hey, look dude, give the guy a break. You've been deemed as criminally insane too. Who knows, maybe the little guy will actually have something useful to say.", "action_results": [null]}]}, {"action": "Watch the television.", "result": "On the TV there's two people talking in a news room. One girl and one guy.\n\nThe girl: There are numerous reports of more brutal attacks in the East section of the country. Citizens have been given breath masks and told to evacuate immediately.  Armed forces have come in to eliminate the threat, and set up decontamination facillities in case of any threat of civillian infection.\n\nAfter a bit  of LIVE camera footage(which is very short, probably due to the fact that the unfortunate camera man gets his head whacked off after twenty seconds), the guy starts talking.\n\nGuy:..it is now believed that the infection is spread to victims after being bitten by an infected person, or even just being scratched. If someone you know has been bitten or scratched by an infected person, isolate the vicim and stay away.\n\nYou hear staff calling over the loudspeakers that all inmates are to go outside.", "action_results": [null]}]}]}]}]}]}