{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=56514", "context": "", "first_story_block": "They came at night, through the streets of all the cities, worldwide. The world population dropped 40% the first few nights, before the humans figured it out. They were Hunters, and they prowled the earth at night. As the sun rose, they would scurry off to what whatever hole in the ground they occupied. Heaven forbid you came across one, or your death would soon follow.\n\n\nThey weren't hunting for food, though. It took even longer for the humans to learn this. Their true motive wasn't clear, but one thing was: they were spreading. A man would go outside after dark, just to pee or investigate a noise. Then, you'd hear the clicking, the rustling of leaves on trees and bushes, and the man would be taken, scooped right up off the ground. Seemingly vanished, the man would return, several nights later, to the very door of his home. But he would be different.\n\n\nYour neighborhood banded together. Lights were put up around the neighborhood edges. The Hunters didn't like the light too much, and it was easier to see their dark bodies against the light. Old Christmas lights, oil lamps, even flashlights were used to watch the woods carefully for movement. Families stayed in their homes, and those who were old enough to defend would watch over the elderly and kids. You were in charge of a group of girls, two houses over. Their mother was taken in the beginning, before humans learned.\n\n\nLife went on as normal during the day. School and jobs functioned, society was alive and well. You went to the store to buy food for your family, as well as the girls. You maintained your job as a truck driver, transporting packages between warehouses and pickup locations. The only difference was that sometimes, people would stop showing up. A teacher wouldn't come to class, a regular customer to a restaurant would stop coming, and everyone just knew.\n\n\nThe Hunters seemed to only want humans. All attempts to bait them with dead meat and food failed, and all the animals were unharmed, despite having nowhere to hide at night. They only wanted people for some reason. Whenever they took someone, the person would come back later, in a new form.\n\n\nYou saw it firsthand. One night, you were in the kitchen, doing the previous day's chores. You couldn't sleep because you were on guard duty. You saw movement out of the corner of your eye, through a window. You looked up to see a figure walking down the neighborhood's entry road. It was far too small to be a Hunter, and as it stepped into the light, you realized it was Franklin Wright, owner of the house across from yours, taken just two days ago.\n\n\nHe slowly made his way over to his house, and you just watched. At first, he looked normal. You thought for a moment that he had actually survived, and was coming back home. You ran over to your front door and cracked it open. Frank heard it and turned around. \n\n\nFrank stared at you with empty, glazed eyes. His pupils were so dilated that you could hardly tell his eyes weren't completely black. His face was dead, his expression grim. His lower jaw hung uselessly below his head, so his mouth was hanging open. Once the shock of seeing his face so dead dissipated, you were overcome with an instinct to close the door.\n\n\nFrank lowered down on all fours, like a dog. He used his feet to launch himself forward, galloping toward your house. You slammed the door shut and locked it, leaning against it with all your weight, praying that he wouldn't bust right through it. You heard Frank's hands slapping against the asphalt as he barreled towards your door, then a sickening thud as he slammed headfirst into it. \n\n\nThe sound was like a melon being smashed with a hammer. You were almost afraid to open the door. Eventually, you just went upstairs and looked down from the guest bedroom window. Frank's headless body was lying motionless on your welcome mat. The remains of his head were splattered on the door, and the ground surrounding his body. You could make out a caved-in skull still attached to Frank's neck.\n\n\nThe noise attracted the attention of your neighbors. Your phone immediately blew up with calls from everyone, wondering what the noise was. You told everyone to stay inside, and relayed what you had just seen as lightly as you could, leaving out the more gruesome details. After everyone understood what happened, they were much more careful. Several families boarded their windows, afraid the taken would come back to plow through the weak points. \n\n\nAs time went on, it happened less. Less people were taken, and so less people came back to haunt the living. You didn't know what happened to those who came back, or why they did. From your experience with Frank, you didn't want to know. It was important to stay up to date on the Hunters and how they hunted, but you didn't want to lose your humanity for the sake of staying alive.\n\n\nEventually, the Hunters became dissatisfied. The humans had understood their patterns and now barely any viable hosts were easily taken. Nobody was outside anymore, they were all hidden in their concrete fortresses. So, one night (coincidentally another night where you were awake and on guard duty), the Hunters tried something new.\n\n\nYou were reading a book, you don't remember which one. Most of the details are blurred, but you remember this: you had a feeling of comfort and safety in that house, reading that book, a feeling of comfort you would never get back. \n\n\nYou heard a scream pierce the air, and recognized it immediately as one of the girls you were watching. You leapt up, and raced for the front door. As you stepped outside, your stomach dropped into your shoes. One of the Hunters had thrown itself into the front window of the girls' house. Before you could think about it, you started sprinting for the window. \n\n\nYou jumped inside to see the youngest girl, Elizabeth, crying under a table. There was broken glass everywhere, but she didn't look hurt. You couldn't worry about her yet, as there were two more girls and a monster in the house.\n\n\nYou ran upstairs, yelling the girls' names. You heard a scream from the downstairs bathroom, and nearly fell down the stairs trying to get there. Your heart was pounding, you were sweating, and between the monster's growls and the girls' crying and screaming, it was a rush and a blur. You bounded into the bathroom, just in time to see a Hunter looming over one of the girls.\n\n\nYou'd never seen one before. You didn't see the one that took Frank, and they mostly stayed away from the neighborhood. Sure, you heard stories from people who had seen them, but this was worse than anything you could have imagined. The beast was tall and lanky, with arms and legs like wiry hoses that connected to a clump of flesh. On that clump of flesh sat a large head, with a jaw that opened wide, revealing several rows of teeth. It was black as coal, save for the deep red of its claws, three at the end of each appendage.\n\n\nIn the face of death, all you could do was stop and stare. It opened its mouth and howled. You had heard howls before, but only from a distance. Up close, it was loud, piercing, and painful. You stumbled backwards, and the monster shot forward. You were held by your arms in its claws as it sprinted for the front window. You fought like bloody hell to escape, but the Hunter only tightened its grip. It jumped through the front window and ran for the trees, with you in tow.\n\n\nAt this point, you were still very much awake. You could hear the others yelling for you, but they couldn't do anything. You felt tree branches graze you as the Hunter practically flew over the ground, running away from the neighborhood. Eventually, it was satisfied with its location. Somewhere in the darkness, in the coldest, most dead part of the night, it dropped you on the ground and delivered a bite to your neck. In any normal circumstances, you would have died. The Hunter's teeth severed multiple arteries and tore a mouthful of flesh from your neck.\n\n\nBut these weren't normal circumstances. The Hunter bounded off, leaving you on the ground. Your face was twisted with pain, and you were unable to move. Blood poured from your neck until there was nothing left in you. After a few minutes of agony, you faded out, assuming you were dying. But when you woke up, the pain was gone. You couldn't feel your neck anymore. You moved your arm to try to pick yourself up, only to find that you couldn't feel that, either. \n\n\nYou were light as a feather and couldn't feel a thing. For a split second, you were in a state of total bliss. Then, you were snapped back into the world by a new pain, somehow worse than the neck wound. It was a pain in your stomach, a hunger unlike anything you'd felt before. You knew immediately what you hungered for. You needed blood to fill your body again. You needed human blood to save yourself.\n\n\nYou were strangely aware of everything in motion around you, as if your senses were heightened. You were painfully aware of the pit in your stomach. You tried to remain sane and keep your thoughts under your control, but soon a very primal impulse took over, telling you one thing:\n\n\nFind food.", "action_results": [{"action": "Hunger", "result": "You smacked your lips and clicked your tongue. Your mouth was bone dry. You looked around for something to eat, but there was nothing. You stepped forward, and your foot landed in a puddle of your own blood. You looked down to find that the ground where you fell had collected a small reservoir of blood.\n\n\nSuddenly, your instinct brought you to your knees. You scooped up some of your own blood with both hands and poured it into your mouth. The taste was bitter and metallic, but you liked it. You scooped more blood into your mouth, and drank until there was nothing left. The ground was bone-dry, and you searched around for any more blood, and found nothing. Your blood did little to satisfy you, and you jumped to the next possible source: other people. You didn't know how long you were unconscious, but it was still dark out, so you could  hunt.\n\n\nAs you slowly began to move forward, your joints felt tired and achy, like you'd just finished running a marathon. You felt heavy, as though you were struggling to support the weight of your own body. As you shambled in the direction of your home, your primal urges died out, and common sense came back. You at least had control over your thoughts again.\n\n\nYou'd switched sides. You realized that. Rather than protecting your family and living a human life, your purpose was now to eat until you were full, which you had a feeling wouldn't happen for awhile. The pit in your stomach was large and painful, and you doubted that if you ate everyone in the neighborhood that it would satisfy you.\n\n\nSuddenly, another thought struck you: the Hunters didn't eat their prey. Presumably, you were the product of whatever they wanted, and you hadn't been eaten. So why were you hungry? You slowly began to realize how little you understood the creatures that plagued the earth. They couldn't just be here to wipe humans off the planet, otherwise they wouldn't be so respectful of the houses and boundaries that humans built. If the Hunters wanted to, they could easily tear through the houses' walls and take whatever they wanted.\n\n\nThen, another thought emerged: you just witnessed a Hunter jump through a window, something you'd never heard of. Were they learning? The thought sent chills up your spine, but thinking made you hungry. It was harder to produce coherent thoughts now, and they came slowly, one at a time.\n\n\nBefore long, you ended up at the edge of your neighborhood. You gazed out at the rows of houses still illuminated by all kinds of lights. Your eyes began to widen and you tensed up at the knowledge of nearby food. But then, another thought permeated your consciousness. You weren't sure you wanted this. Every instinct told you to go out and eat your friends and family, the ones you were just protecting not too long ago. You fought the feeling and tried to maintain rational thought. \n\n\nAnother thought floated to the surface of your brain: you could protect them. You could use your new state to keep them safe. If you survived having a piece of your neck ripped out, you could survive against invading Hunters. If only you could find another way to sustain yourself, you wouldn't fall victim to whatever the Hunter did to you. You wouldn't become a mindless killer like the rest. You would just have to fight the onset of madness.\n\n\nA woman stepped out of her house, onto the road. Immediately, you dropped to your hands and knees. As much as you wanted to be a hero, you were hungry. An unsuspecting meal sat right in front of you. You'd have no problem overpowering her.", "action_results": [{"action": "Be A Hero", "result": "You bit your lip as hard as you could, and stood up. You wouldn't succumb to the beasts and their wishes. You could live a life of control, even if it meant pain. You were born a human, and you intended to live out your life as one. You stepped forward into the light. You opened your mouth to speak, but a long groan came out instead.\n\n\nThe woman turned to see you, and her face went white. She ran back into the house screaming bloody murder. You covered your own mouth with your hand, forgetting that you were still a monster on the outside. You needed to communicate that you weren't going to hurt anyone, and fast.\n\n\nYou approached the house slowly, hands raised in surrender, trying to think of ways to look friendly. As you came towards the front door, you caught a glimpse of yourself in the windshield of the family's car. Your face was pale, your eyes blank. There were bags under your eyes, and your cheeks were covered in wrinkles. The most noticeable feature, however, was the gaping hole in your neck from the bite. Your spine was exposed, and blood vessels hung like dead worms from your head.\n\n\nYou started to shamble away, and heard the front door burst open. The woman's husband came out wielding a snow shovel. He pointed it threateningly at you, and began to march forward. You put your hands up, palms out in surrender, hoping the man would notice. Just as he loomed close, he froze. \n\n\nSlowly and carefully, he leaned in. He was scanning your face with his eyes. You tried to force a smile, but it probably didn't look that way. The man took on a more curious tone, and asked you a few questions. You couldn't respond much further than head shakes, but you cooperated as much as you could. The man eventually stepped back in shock, and dropped the snow shovel. He was understanding you. You breathed a sigh of relief.\n\n\nSuddenly, a gunshot pierced the silence. You were immediately plunged into a world of darkness as your lifeless body toppled over. The man with the snow shovel stepped back again, this time in horror. He looked over to see the source of the bullet. It was a woman who lived next door, and who apparently had a handgun. She disconnected your spinal cord in one shot, loosening your head from your shoulders. ", "action_results": [{"action": "Reset Game", "result": "They came at night, through the streets of all the cities, worldwide. The world population dropped 40% the first few nights, before the humans figured it out. They were Hunters, and they prowled the earth at night. As the sun rose, they would scurry off to what whatever hole in the ground they occupied. Heaven forbid you came across one, or your death would soon follow.\n\n\nThey weren't hunting for food, though. It took even longer for the humans to learn this. Their true motive wasn't clear, but one thing was: they were spreading. A man would go outside after dark, just to pee or investigate a noise. Then, you'd hear the clicking, the rustling of leaves on trees and bushes, and the man would be taken, scooped right up off the ground. Seemingly vanished, the man would return, several nights later, to the very door of his home. But he would be different.\n\n\nYour neighborhood banded together. Lights were put up around the neighborhood edges. The Hunters didn't like the light too much, and it was easier to see their dark bodies against the light. Old Christmas lights, oil lamps, even flashlights were used to watch the woods carefully for movement. Families stayed in their homes, and those who were old enough to defend would watch over the elderly and kids. You were in charge of a group of girls, two houses over. Their mother was taken in the beginning, before humans learned.\n\n\nLife went on as normal during the day. School and jobs functioned, society was alive and well. You went to the store to buy food for your family, as well as the girls. You maintained your job as a truck driver, transporting packages between warehouses and pickup locations. The only difference was that sometimes, people would stop showing up. A teacher wouldn't come to class, a regular customer to a restaurant would stop coming, and everyone just knew.\n\n\nThe Hunters seemed to only want humans. All attempts to bait them with dead meat and food failed, and all the animals were unharmed, despite having nowhere to hide at night. They only wanted people for some reason. Whenever they took someone, the person would come back later, in a new form.\n\n\nYou saw it firsthand. One night, you were in the kitchen, doing the previous day's chores. You couldn't sleep because you were on guard duty. You saw movement out of the corner of your eye, through a window. You looked up to see a figure walking down the neighborhood's entry road. It was far too small to be a Hunter, and as it stepped into the light, you realized it was Franklin Wright, owner of the house across from yours, taken just two days ago.\n\n\nHe slowly made his way over to his house, and you just watched. At first, he looked normal. You thought for a moment that he had actually survived, and was coming back home. You ran over to your front door and cracked it open. Frank heard it and turned around. \n\n\nFrank stared at you with empty, glazed eyes. His pupils were so dilated that you could hardly tell his eyes weren't completely black. His face was dead, his expression grim. His lower jaw hung uselessly below his head, so his mouth was hanging open. Once the shock of seeing his face so dead dissipated, you were overcome with an instinct to close the door.\n\n\nFrank lowered down on all fours, like a dog. He used his feet to launch himself forward, galloping toward your house. You slammed the door shut and locked it, leaning against it with all your weight, praying that he wouldn't bust right through it. You heard Frank's hands slapping against the asphalt as he barreled towards your door, then a sickening thud as he slammed headfirst into it. \n\n\nThe sound was like a melon being smashed with a hammer. You were almost afraid to open the door. Eventually, you just went upstairs and looked down from the guest bedroom window. Frank's headless body was lying motionless on your welcome mat. The remains of his head were splattered on the door, and the ground surrounding his body. You could make out a caved-in skull still attached to Frank's neck.\n\n\nThe noise attracted the attention of your neighbors. Your phone immediately blew up with calls from everyone, wondering what the noise was. You told everyone to stay inside, and relayed what you had just seen as lightly as you could, leaving out the more gruesome details. After everyone understood what happened, they were much more careful. Several families boarded their windows, afraid the taken would come back to plow through the weak points. \n\n\nAs time went on, it happened less. Less people were taken, and so less people came back to haunt the living. You didn't know what happened to those who came back, or why they did. From your experience with Frank, you didn't want to know. It was important to stay up to date on the Hunters and how they hunted, but you didn't want to lose your humanity for the sake of staying alive.\n\n\nEventually, the Hunters became dissatisfied. The humans had understood their patterns and now barely any viable hosts were easily taken. Nobody was outside anymore, they were all hidden in their concrete fortresses. So, one night (coincidentally another night where you were awake and on guard duty), the Hunters tried something new.\n\n\nYou were reading a book, you don't remember which one. Most of the details are blurred, but you remember this: you had a feeling of comfort and safety in that house, reading that book, a feeling of comfort you would never get back. \n\n\nYou heard a scream pierce the air, and recognized it immediately as one of the girls you were watching. You leapt up, and raced for the front door. As you stepped outside, your stomach dropped into your shoes. One of the Hunters had thrown itself into the front window of the girls' house. Before you could think about it, you started sprinting for the window. \n\n\nYou jumped inside to see the youngest girl, Elizabeth, crying under a table. There was broken glass everywhere, but she didn't look hurt. You couldn't worry about her yet, as there were two more girls and a monster in the house.\n\n\nYou ran upstairs, yelling the girls' names. You heard a scream from the downstairs bathroom, and nearly fell down the stairs trying to get there. Your heart was pounding, you were sweating, and between the monster's growls and the girls' crying and screaming, it was a rush and a blur. You bounded into the bathroom, just in time to see a Hunter looming over one of the girls.\n\n\nYou'd never seen one before. You didn't see the one that took Frank, and they mostly stayed away from the neighborhood. Sure, you heard stories from people who had seen them, but this was worse than anything you could have imagined. The beast was tall and lanky, with arms and legs like wiry hoses that connected to a clump of flesh. On that clump of flesh sat a large head, with a jaw that opened wide, revealing several rows of teeth. It was black as coal, save for the deep red of its claws, three at the end of each appendage.\n\n\nIn the face of death, all you could do was stop and stare. It opened its mouth and howled. You had heard howls before, but only from a distance. Up close, it was loud, piercing, and painful. You stumbled backwards, and the monster shot forward. You were held by your arms in its claws as it sprinted for the front window. You fought like bloody hell to escape, but the Hunter only tightened its grip. It jumped through the front window and ran for the trees, with you in tow.\n\n\nAt this point, you were still very much awake. You could hear the others yelling for you, but they couldn't do anything. You felt tree branches graze you as the Hunter practically flew over the ground, running away from the neighborhood. Eventually, it was satisfied with its location. Somewhere in the darkness, in the coldest, most dead part of the night, it dropped you on the ground and delivered a bite to your neck. In any normal circumstances, you would have died. The Hunter's teeth severed multiple arteries and tore a mouthful of flesh from your neck.\n\n\nBut these weren't normal circumstances. The Hunter bounded off, leaving you on the ground. Your face was twisted with pain, and you were unable to move. Blood poured from your neck until there was nothing left in you. After a few minutes of agony, you faded out, assuming you were dying. But when you woke up, the pain was gone. You couldn't feel your neck anymore. You moved your arm to try to pick yourself up, only to find that you couldn't feel that, either. \n\n\nYou were light as a feather and couldn't feel a thing. For a split second, you were in a state of total bliss. Then, you were snapped back into the world by a new pain, somehow worse than the neck wound. It was a pain in your stomach, a hunger unlike anything you'd felt before. You knew immediately what you hungered for. You needed blood to fill your body again. You needed human blood to save yourself.\n\n\nYou were strangely aware of everything in motion around you, as if your senses were heightened. You were painfully aware of the pit in your stomach. You tried to remain sane and keep your thoughts under your control, but soon a very primal impulse took over, telling you one thing:\n\n\nFind food.", "action_results": [null]}]}, {"action": "Feed Yourself", "result": "As much as you loved your family, you weren't like them anymore. You were hungry. You promised yourself you would at least try to fight it off later, but for now, you needed blood. The increasing promise of food made you salivate, and brought some feeling back to your body. You felt stronger now.\n\n\nYou sprung to your feet and ran for the woman. It wasn't until you almost had her that you realized you had no idea how to drink blood. The thought was slow to emerge, slower than your impulses. You seized her and threw her over your shoulder, and turned to bolt for the woods. As you took off, you could hear the woman's husband behind you, calling for help.\n\n\nYou ignored the cries and ran into the woods, deeper into the darkness. Eventually, your energy started to drain. You dropped the woman and held her to the ground. You studied her, looking for an optimum spot to draw blood. You settled on her neck, and bit down hard. Your teeth were still dull and flat, so it took some effort to tear the skin. Once you passed the muscle tissue, blood began to spurt from the wound.\n\n\nYou drank as much as you could. The woman flailed and struggled at first, and then slowly relaxed. Within a few minutes, there was nothing left. You wiped your mouth on your sleeve, satisfied. You weren't full, far from it, but this first official meal had helped tremendously. You studied the woman's lifeless body, wondering if it would come back to life like you did. \n\n\nIt didn't take long for your rational thought to come back over the rush of the hunt, and the full weight of what you just did crashed onto you. You knew this woman. You knew her husband, her kid, and you just killed her. As you searched your mind for hate and guilt, you were surprised to find almost none. You understood what you'd done, but you didn't care. You looked at your own hands, now stained with blood, and wondered if you could even consider being human any longer.\n\n\nYou sat in the darkness for awhile, before hunger made you rise again. Your quiet, timid voice of reason was being drowned out by your instinct to hunt, but the reason was still there. You had to eat, but you couldn't bring yourself to kill again. Could you?", "action_results": [{"action": "Of Course", "result": "Just a short time ago, you were human, just like the woman you just drank the blood of. And yet, you felt no sorrow or guilt. You looked at your hands again, and at the woman's body. Perhaps it was the natural order. You had failed as a human. The Hunter took you, and made you into a monster. Perhaps that was how it was supposed to be. It was the natural order of things. Your job before was to fight the Hunters, but now? Food. Food was your only constant thought, your only focus. The sun was still nowhere in sight, and your neighborhood was a stone's throw away.\n\n\nLeaving your humanity on the ground next to the woman's body, you walked back to your neighborhood. Surprisingly, nobody had gone after the woman. When you got to the treeline and looked in on the neighborhood, you could see that more guards had been posted, with guns. Through a window in the house of the woman you ate, you can see her husband crying, being consoled by your wife.\n\n\nYour wife.\n\n\nThe edges of your vision blurred with anger. It was natural this time, a natural transition into hunting mode. You sprinted up to the house and flung yourself through the window. You didn't know whether you wanted to attack the man or your wife, but you didn't have to make the choice. Your wife left the room quickly, while the man stumbled over, caught off guard by your entrance. You beat the man to the door and slammed it shut.\n\n\nThe man's eyes, puffy and wet with tears, were now bulged open. He was quaking in fear. You swiftly pushed him over, ripped his throat open, and began to drink. The man put up more fight than the woman, but was still as powerful as a beached tuna fish. You drank his blood until there was nothing left in him, and then wiped your mouth on your sleeve again. You left his body in the room and jumped back out the window. Once outside, you could see that the remaining guards were just entering the house through its front door.\n\n\nYou disappeared into the woods, much stronger now. With every meal you felt more in control, stronger than before. While you doubted you could keep coming back to your own neighborhood without being caught and killed, you still needed more food. The immense amount of blood you had just consumed felt like nothing more than a single graham cracker, whetting your appetite. You needed another feeding ground, so you set off, away from your neighborhood.\n\n\nPretty soon, sunlight began to flood the air, illuminating the world around you. You hadn't been thinking about the sun at all since your second kill, and for a brief moment you worried it would kill you. After a few seconds, nothing happened. You weren't sure what you were expecting, but the sunlight seemed to have no effect on you at all. It made you slightly curious as to why the Hunters hid during the day, but the thought quickly died. You didn't care. You were hungry.\n\n\nAs the sun grew higher in the sky, you kept traveling through the woods for a long time, even passing a road at one point. You were focused entirely on finding more humans, so your pupils dilated when you heard voices. You raced to the origin of the sound to find that it was a neighborhood. Its inhabitants were just waking up, apparently checking to see if anyone had been taken. \n\n\nThey were standing in a group, a huge mass of humans, all talking to each other. They were unfocused, thinking they were safe since the sun was up. You licked your lips and lowered yourself among the brush to hide. Your hunger was fierce now, but even in your primal state you knew you couldn't just start tearing through the mob. There were too many people, and you didn't want to get killed.\n\n\nYou sat and waited for awhile. The humans finished their meeting and split up, returning to their homes. They were all getting ready for their normal days, kids getting dressed for school and adults dressing for work. It was strange watching the humans perform the very same dull routines you had once been a part of, but you were free now. It was almost amusing, seeing them monotonously prepare for the day. \n\n\nIt was entertaining, sure, but your appetite only grew. You became impatient, wishing one of them would come outside to water their plants or something, or leave their kids alone inside. The humans dawdled, hugging each other and saying goodbye. You mocked them from inside your head, urging them to give you an opening.", "action_results": [{"action": "Wait Your Turn", "result": "Your impulse was practically pulling you towards the nearest window, but you fought the feeling back. You needed to wait for the right moment, to avoid being interrupted during your feast. You sat in the brush and counted the number of windows on the nearby houses.\n\n\nMercifully, the family of the nearest house went their separate ways, with the children presumably walking to school, and the man getting in his car and driving off to work. A lone woman remained in the house, folding laundry. Your mouth began to water as you crept over to the outer wall of the house. You sat underneath a window, hidden from the human's view.\n\n\nPretty soon, the human came outside carrying garden supplies. She began to fill a watering can from a hose mounted on the side of the house. Her back was turned to you, and she was on her hands and knees. You swiftly crossed the backyard and grabbed her by the throat, tearing it open with your fingernails. She could barely scream before you had emptied her of blood.\n\n\nYour arms and legs were tingling from the kill. You knew that you needed to take every life from this neighborhood before you could even think about going anywhere else. Although you needed it to live, you had developed a drug-like tolerance to murder, and this was only....your second kill? Third? It didn't matter. Your searches for empathy or any feeling at all towards your victims kept coming up empty, so you stopped looking.\n\n\nYou moved to the next house, where a human was sitting outside on his front porch, alone. You stayed behind a row of bushes lining the front yard, then vaulted over the railing and sunk your teeth into the man's neck. Once again, you were too quick for him to make a peep. You drank him dry, and entered the house through the unlocked front door.\n\n\nWhen you stepped inside, another human approached you, expecting that her husband had just come back. Upon seeing you, she screamed and ran back into the kitchen. The noise alerted the humans outside, and they came running to the woman's aid. They saw the dead man, they saw you, the horrid creature you had become, and it fueled their anger.\n\n\nReacting quickly to protect your own life, you bounded up the stairs. You blindly darted down hallways and into rooms. Eventually, you found a walk-in closet. You stepped inside and closed the door after you, hiding among the racks of coats. You could hear commotion from downstairs as the humans came running to find you. Of course, they failed. They searched around the house and outside, and found no trace of you. \n\n\nYou were eager to kill the woman downstairs, and so urged the other humans to leave so you could have your meal. You could hear them downstairs, apologizing to the woman and grieving. You were tuning them out when a piece of conversation caught your ear. It was one human vocalizing confusion over how you had hunted during the day. The humans had known daytime to be safe. Now, they were unsure, and as frightened as ever.\n\n\nThe humans agreed to meet up and talk about it later. Then, one by one, they left the house. You could hear the sounds of the woman crying softly to herself. You sighed in relief, and made your way out of the closet. You raced downstairs to find the woman still in the kitchen. There was no thrill element in killing this time, just a very calculated bite to the throat, and you drank her blood.\n\n\nAfter that was done, your hunger seemed to be growing. You were no longer in control of yourself, your lust for blood was. You opened the front door and looked outside to see if anybody was nearby. Suddenly, a fierce and powerful pain erupted across your face and arm, causing you to pull back into the house. The burn was intense, and you struggled not to cry out and reveal your location. You looked at the front door in bewilderment, wondering what had just happened.\n\n\nAfter a few minutes, the sharp pain subsided into dull agony, and you were able to move again. You slowly opened the door, trying to see what had caused the pain. You had initially thought it was a spray of some kind, like mace, but the true culprit became clear when sunlight fell on your face and the burning was reignited. You stepped back inside, this time knowing to close the door.\n\n\nThey stayed inside because the sun burned. That was why. The realization came after the pain had vanished once more, and you knew you were in trouble. You couldn't leave the house or you'd likely be burned alive. That meant if another group of humans came in, you'd have to hide until they left. But, more importantly, you couldn't eat anymore unless lone humans came into the house. You were stuck. There was nothing more to do about the situation but wait until nightfall.", "action_results": [{"action": "Darkness", "result": "The humans left the house alone for the remainder of the day, allowing you to remain undisturbed, hiding in an upstairs room. The wait for the sun to set was agonizingly slow, and when the sunlight finally disappeared, you were all too eager to leave the house out the back door, ready to hunt again.\n\n\nThe humans had already barricaded themselves in their houses. Doors were locked, windows were barricaded, and lights coming from upstairs windows told you that they were still awake, watching for signs of danger. You stayed away from the streetlights, waiting from the darkness for a chance to feed. At some point, someone would have to come outside or slip up somehow, and you were ready for it.\n\n\nYour hunger became worse as the night dragged on, fueled by previous kills and lusting for more blood. There weren't any humans in sight, but there were still lights on in the houses, keeping you at bay. You would have to get creative. Approaching the next inhabited house, you circled the building looking for entry points. The humans seemed to have learned quickly, as every grate and window was sealed perfectly. You could hear voices by pressing your ear against the house's walls, the humans milling uselessly around inside, denying you the right to feed.\n\n\nSuddenly, a noise from behind caused you to turn around and face the trees behind you. Your eyes scanned the dark woods for threats, but you couldn't see anything. You stared for another few seconds, until a large outline began to appear right in front of you. A Hunter had found the neighborhood. It silently approached the the back of the house, and you immediately moved to aid it. \n\n\nYou could almost tell the Hunter's intentions, like you were reading its mind. You were undoubtedly linked to them somehow, and the connection just kept growing stronger. You could read it perfectly; the Hunter intended to forcefully enter the home through a window, and was searching for a weak barricade. \n\n\nThe Hunter moved slowly, swaying back and forth like a lone flower in a breeze. Then, it suddenly snapped into action, having made a selection. You could see the Hunter's attack before it happened, and bounded for the weak window. The Hunter's claws tore the glass and boards like paper, leaving a gaping hole in the wall for you to climb through. The Hunter followed closely after, slipping its slender body through the gap.\n\n\nOnce inside, you could tell the humans were on the second floor, as furniture had been piled up on the stairs. You hardly considered three chairs an obstacle, and climbed over them quickly. The Hunter followed you slowly, almost as if it was letting you take the lead. It loomed closely behind you as you raced up the stairs. Once at the top, you were able to hear the humans making noise in one of the rooms.\n\n\nYou beat the Hunter into the room and attacked the nearest human, which happened to be a young woman. She barely resisted at all, and you easily overpowered her. A bigger human wielding some sort of sharp blade stepped forward to stab you, but the Hunter picked the human up before he could do anything. You drank the blood of the woman while the Hunter carried the other human downstairs and outside.\n\n\nAfter the hunt's adrenaline wore off, you realized you and the Hunter had worked together in a sort of weird way. You could both sense each other's next move and act accordingly, and you were able to take down a couple by working together. You couldn't remember ever seeing this as a human, but that didn't matter. The Hunters were evolving, and with it you gained new abilities and an even stronger thirst for blood.\n\n\nYou could feel the Hunter bounding away with the terrified human in its jaws. The Hunter's simplistic mind was focused on the anticipation of a fresh kill, and you got to watch it play out from inside the house. Eventually, the connection faded as the Hunter moved further away. It was satisfied with its hunt, but you weren't. There were still live bodies in the neighborhood.\n\n\nEventually, you realized you needed to get out of the house before the other humans showed up. You ran down the stairs and escaped out the window in time to see a group forming on the front porch. You disappeared into the woods and waited for the excitement to die down. It took about an hour for the mob to disperse, but nobody went back into their homes. Instead, they stayed on the roads, holding their weapons defensively.\n\n\nThey were getting smarter. You wouldn't be able to steamroll this neighborhood like you hoped. You needed a plan... or backup. You closed your eyes and tried to focus your mind on getting the attention of anything nearby. It didn't seem to work. You opened your eyes again and studied the mob, looking for a stray or a weak point you could use to attack again.\n\n\nSuddenly, a loud crashing noise caused the whole mob of humans to turn in your direction. They saw you, and began to advance. Fear shot through your body, and you panicked. You ran back into the house you had just attacked, hiding behind a wall. In the moment it took you to realize what had made the crashing sound, the Hunter had already burst through the trees.\n\n\nIt worked. The Hunter heard your call, and was now effortlessly slashing at the horde of humans. You came back outside, and your senses were overwhelmed at the smell of blood soaking the road and grass. You picked up the bodies the Hunter left in its wake and drank what was left of them. After the rest of the humans had run for the hills, five were dead. You drank their blood and left them out on the road.\n\n\nYou weren't sure if you needed to dismiss the Hunter or something, but it didn't wait for you. It had done its job. It bounded off into the woods, and you wondered if it was the same one that helped you attack the house. You turned back towards the neighborhood and saw the ocean of gore that covered the road. It brought you joy to see this many dead humans, and even more joy when you realized the others were running off into the woods alone, barely armed. They wouldn't last long.\n\n\nAt some point during that night, the cogs of rational thought stopped moving in your brain. You didn't hesitate to kill anymore, and there was no humanity left in you at all. You joined the increasing army of humans turned to slaves, hunting for the Hunters. Within months, the increasing intellect and problem-solving of the Hunters allowed them to kill half the earth's population.\n\n\nThe best part was that you played a very important role. Taken humans began to attack in groups, flushing out groups of humans into the waiting jaws of the Hunters. Soon, the last bastions of humanity were committing mass suicides to avoid being reanimated. The Hunters' job was done, the planet had been repurposed. As humanity disappeared from the face of the earth, you and your undead brothers and sisters wandered empty streets.\n\n\nThe good news was that you had done well. Days on end of relentlessly chasing humans had proven entertaining and fruitful. The bad news was, it was too effective. No humans meant no human blood, and you began to starve. Animal blood was a sorry substitute for the real thing, and soon you ran out of energy. You stopped short and collapsed on the ground. Whatever was left of your former self was gone, this time for good.\n\n\nEXTINCTION ENDING", "action_results": [null]}]}, {"action": "Hunt Now", "result": "After another few seconds watching the humans sit there in their homes, you couldn't wait any longer. You gave control to your hunger, and your hunger sent you barreling towards the house at top speed. You flew through the window and into a kitchen, where a human was halfway through making a salad.\n\n\nThe human screamed in fear, but the sound was dull to you. The thought of food was your drive now. You tore her throat open, and began to drink from the steam of blood that sprayed onto the floor. Moments later, your meal was disturbed by another human entering the kitchen. Summoned by the screams of your latest victim, this human had brought a small knife along.\n\n\nYou immediately rose, facing the human. He defensively held up his folding knife, gripping it with both hands. He looked terrified of you. Your hunger deemed him not a threat, so you stepped forward and slapped the knife from his hand, before incapacitating him and dropping him on the ground. You wanted to finish the kill you'd started first.\n\n\nAfter you were satisfied, you stood, facing the front door. From what you knew, there were two other humans, probably children, in the house. They wouldn't be a danger and likely didn't hold enough blood to be worth the hunt,, so you disregarded them. You made your way to the front door and looked out the window. The area was still teeming with humans, blissfully unaware that two had died. You watched from the safety of the house, waiting for another opening to kill.\n\n\nYour focus was so solely on the window and the humans on the outside, so much so that you didn't notice the human child watching you from the top of the stairs. He had an aluminum baseball bat gripped tightly in his hands. He crept down the stairs, as intently focused on you as you were on the window.\n\n\nYou had never had trouble hunting, because your opponent was always right in front of you. No human had ever so much as grazed you, making it easy to kill. You had gotten overconfident, not knowing how it felt to take a hit. When the human child raised the bat over his head and brought it down directly on the back of your skull, nothing could have prepared you for the violent waves of pain that invaded your body. Your face went forward into the glass, shattering the window.\n\n\nThe human child's swing was painful, sure, but it came nowhere near crippling you. You fought the dizziness off and struck the small human off his feet. The baseball bat skittered away, leaving your next victim helpless. You got off the floor and stood to your full height again, towering over the frightened child. You approached him slowly, relishing in the fear you caused.\n\n\nSadly, not even a baseball bat was enough for you to learn your lesson. Your focus was solely on the human child, and not on the crowd of humans that had been alerted to the sound of a broken window. Your focus was not on the human holding the hunting rifle, not on the human with her handgun pointed directly at your throat, not on the human with the golf club who was silently sneaking up on you from behind, but on the weak human child. Of course, the weak human child was no longer afraid, because there was no threat anymore. ", "action_results": [null]}]}, {"action": "Of Course Not", "result": "As you stared down at the lifeless body of the woman you had just murdered, you sensed a moral switch being flipped somewhere inside you. As desperate as you were to keep feeding, you knew that if you kept killing humans, you would only help the Hunters. The doubt you previously had about them wanting to rid the earth of humans was fading. So, you made an executive decision: no more killing, for as long as you could. If it came down to survival, you would seek out lonely, suicidal humans. No more harm to anyone, if you could help it.\n\n\nYou couldn't really put the body in a better place, so you left it behind and started off in the opposite direction of your neighborhood. The sun was starting to peek over the horizon, reminding you that the Hunters usually hid from the sun. It was another mystery, since you weren't sure if the sun harmed them, or they just didn't like the light, but you didn't want to stick around to see if you would start melting. You picked up the pace to a light jog, your weightless limbs floating through the air like paper.\n\n\nEventually, you came upon a road. You didn't recognize it, and there were no buildings in sight. On the bright side, there weren't any cars on the road, so you were safe from human eyes. You considered following the road to see where it lead, but there was no telling what it would be, and stumbling onto a group of humans in your current state would definitely turn out bad for someone, most likely the humans. You decided to cross the road and keep moving in your current direction.\n\n\nThe sun was now higher in the sky, bathing you in light. You couldn't feel the warmth of the sun anymore, a painful reminder of what you'd lost of your humanity. But, your skin wasn't peeling like old paint, and you weren't turned to dust, so at the very least you could keep searching for somewhere to stay. You kept pondering why the Hunters would avoid sunlight, and eventually chalked it up to darkness being easier to hide and sneak around in. Being in the woods with no human activity in sight, you didn't quite have to worry.\n\n\nFinally, your journey ended at another neighborhood. You stopped well before you were close enough for anyone to see. Not that anyone was around. The sun was up, but still low, so not many people had woken up for the day, and those who had were still in their houses, perhaps afraid of stragglers. You watched from the woods for awhile, trying to think of a way to get through the neighborhood without being seen.\n\n\nAs you sat there, people started coming out of their houses. The first one was a man with a bell. He shook it in the air, letting it ring loudly. He announced that it was safe once again, and a few other people emerged from their houses. It was interesting to see how other communities dealt with safety in action, but the sight of all those humans made you hungry, not to mention the fact that they thought it was safe. You would have no trouble charging up, taking out the man with the bell...\n\n\nNo. You refused, and dismissed the thought away. You couldn't waste valuable brainpower on thoughts like that. You looked away from the group of humans, who were now performing a sort of roll call, checking to see if anyone was taken. Your wandering eyes settled on a cellar door in the ground, a few feet away from the back door of the nearest house. You considered climbing down there to hide from the sun and wait until night, but it was risky. There was no telling what was down there, or if the humans frequented their cellar. You could sit and wait to see, but you didn't want to spend too much time exposed.\n\n\nYour slow wit was still mulling over the pros and cons when a flicker of movement brought you back to the group of humans. They were all looking directly at you. You tensed up and crouched down, waiting for a cry or for them to charge at you. They only stood there, watching you. you couldn't tell if they could even see you, as there was no discernible expressions on any faces. The group stayed together, and watched you.\n\n\nYou sat unmoving for another few minutes. The group had seemingly dismissed you as an oddly-shaped plant, because they were splitting off and heading back to their homes. It was safe to go back to the cellar, if you dared. There was also a tingling feeling that the humans weren't staring at you for no reason. Perhaps they had seen you, and were just ignoring you?But that would be stupid. Surely they knew how dangerous you were, a beast knowing only hunger and violence. You began to entertain the idea of revealing yourself in the open, just to see how'd they'd react. You watched the inhabitants of one of the houses pile into a car and drive off, and looked at the cellar door a final time.", "action_results": [{"action": "Reveal Yourself", "result": "The humans had mostly scattered from the road. Only a few remained, still deep in discussion. Keeping your eyes firmly locked on them, you slowly stood up out of the brush, very obviously visible. Almost immediately, the human facing you froze, making eye contact with you. The other humans turned, saw you, and began to split up.\n\n\nThe humans began to yell commands at anyone who would listen, causing commotion. Slightly fearful, you hunched over. A group of them collected on the sidewalk several yards in front of you, armed with all manner of weapons. They stared you down defensively, apparently waiting for you make a move. You immediately regretted your decision, but there was no turning back now. You raised your hands up above your head, keeping eye contact with the mob.\n\n\nFor a few moments, nobody made a move. Then one of the humans, wielding a handgun, slowly stepped forward. The barrel of the gun was trained on your chest. The human stared coldly at you, inching forward little by little. You could sense that he was going to shoot you, and your cloudy mind raced to find way to indicate that you were still good.\n\n\nAs the human kept moving forward, you instinctively stepped backward. The human stopped abruptly, and so did you. One of the humans further back in the group yelled at him, asking what he was waiting for, to hurry up and shoot you. You stared into the human's eyes, and shook your head. The human's eyes widened, and he tilted his gun so that it was pointed at the ground.\n\n\nAn argument erupted among the humans over whether to shoot you. The words were hard to follow, but nobody was aiming anything at you, so you didn't move, trying not to provoke anyone. Finally, the same human who had pointed his gun at you approached, unarmed. As moved closer to you, he slowed down and hesitated. The other humans in the group were trying to call him back, but didn't dare get close to you.\n\n\nYour mouth began to water, and you tensed up. The element of danger was gone, and there was a human standing right there, defenseless. Your stomach howled like a thunderstorm as you tried to suppress the urge to pounce. The human continued to get closer. The pain in your gut got worse and worse, until you couldn't handle it anymore. You stepped back and put your hands out in front of you, trying to warn the human to stay back.\n\n\nThe movement was small and quick, but it was more than enough. A gunshot rang out, and an invisible force threw you backwards. You could see the large bullet hole through your left shoulder, and feel the tatters of your shirt brushing your skin where the bullet tore through. The approaching human leapt back.\n\n\nYou faltered, but didn't feel much pain from the impact. After you regained your balance, you looked over at the mob. The shooter was a short, fat woman clutching a shotgun in her hands. She kept the gun pointed at you. She told you to go away, and called you a monster. You stepped back again, and the human shook her gun at you.\n\n\nYou stood motionless, and so did the humans. Again, nobody dared move. You felt something sinking in your chest, as if your very organs were sliding down onto your stomach. Suddenly, you stumbled forward as the pain in your stomach became a white-hot piercing feeling. You fell forward, and another shot flew through you.\n\n\nYou landed on your back, and quickly looked for where the bullet struck you. You saw a large hole in your left knee. Your leg was folded on itself, with bits of bone were visible. You looked up at the human with the shotgun, who was now approaching you. Fearing for your life, you scrambled to get up, only to find that with your new bullet wound, it was near impossible. You couldn't right yourself, and eventually gave up, rolling onto your back.\n\n\nThe woman placed the shotgun barrel on your forehead, with her finger wrapped around the trigger. As a last-ditch effort to save yourself, you slapped the shotgun out of the way. The woman pulled the trigger again, but too late. The bullet blasted the ground next to you, showering the side of your face with dirt. Angry, the woman tossed the gun aside, and resorted to more violent means.\n\n\nShe brought her foot up and stomped on your neck, crushing your esophagus. Not that you needed it. The woman stomped again and again on your face and neck, eventually cracking and breaking your jawbone. You couldn't feel any pain, but it was far too late to get up. Eventually, your skull gave way and your brain was crushed, putting you out of it.\n\n\n ", "action_results": [null]}, {"action": "Hide In The Cellar", "result": "You glanced out at the road one last time, just to make sure nobody was watching. For the most part, you were in the clear. The residents of the cellar house were all inside, and there weren't any windows overlooking the backyard, where the cellar was. You shifted your weight to your legs, and began crawling over to the cellar doors, taking great care to stay behind the brush.\n\n\nYou made your way over to the cellar doors, a few feet away from the house and a few inches above the ground. The doors were unlocked, and swung open easily. Behind the doors was a cement staircase, leading down to a small room. Taking care to quietly close the door behind you, you crept down the stairs. \n\n\nWhen you reached the bottom, you found that the room was full of food. The walls were lined with metal shelves stacked high with jars of fruit, each with a tape label. There were peaches, apples, pears, and cantaloupe, enough to feed a family for a long time. You wondered why the humans had left the food down there. Considering the new circumstances of the world, you would have probably taken the food upstairs to prevent someone from stealing it.\n\n\nAs you scanned the shelves, your eyes connected the food with the pain in your stomach, making you hungry. You knew that peaches were no substitute for human blood, and it was almost torture to sit and stare at the walls of useless food. As you stood in the cellar, a thought bubbled to the surface, and you decided that it wouldn't hurt to at least try the food, just to see.\n\n\nYou grabbed a jar of peaches and tried to unscrew the lid, only to find that it was sealed. You looked around for a can opener or some implement to open the jar with, but there was nothing. At this point, you were convinced that you needed the peach juice to keep going. The hunger pangs were unbearable now that you were holding food in your hand. It didn't matter that it was people food.\n\n\nIn a moment of weakness, you slammed the lid of the peach jar against one of the metal shelves. The top half of the jar shattered, leaving you with glass and peach slime on the floor, and a half full glass of juice and peach bits. You immediately threw your head back and guzzled the peach juice mixed with broken glass. The bits of glass didn't hurt of course, but the taste wasn't superb.\n\n\nThe peach juice did little to tame the fire in your stomach, but it wasn't bad. You emptied the glass into your mouth, and the sweet peaches only made you crave more. Maybe if you ate everything, every jar of peaches, every jar of cinnamon apples, it could at least stall you. You grabbed another jar and, more conscious of the noise factor, tried to quietly tap it against the cement stairs, until the lid popped off. This jar opened cleanly, allowing you to chug the contents of the jar unhindered.\n\n\nAfter three more jars of peaches, your hunger was diminished just a little bit. It was still painful, but you could feel an effect. The incentive of finally taming your hunger, even for a little bit, made you empty an entire shelf of peach jars. The rest of the world melted away as you fell into a rhythm. Grab a peach jar, crack the top, clear the glass if it was necessary, and slurp down the peaches. \n\n\nSoon, you were surrounded by shattered peach jars, an entire shelf was empty, and you still weren't full. Satisfying yourself now seemed like an unattainable goal. You could get started, but never come close, let alone rid yourself of the hunger. You decided to save the rest of the food for later. As you stepped away from the shelves, you became aware of your situation again. You were lucky nobody had walked in on you, otherwise you'd have gotten killed.\n\n\nYou debated leaving the cellar and going back to traveling, but a trove of food like this was hard to pass by. You had no means to carry the jars with you, and you weren't about to break into a house in search of a bag. You climbed the cement stairs again and propped the door open with one hand. You saw the sun, high in the sky. It was about midday.\n\n\nThen your skin started to burn. It was an itchy, burning pain that made you recoil. The cellar door slammed shut as you stepped back and looked at your arms. Your pale, faded skin was now a dull red, as though you'd gotten a sunburn. You looked up at the cellar doors. The sun. You couldn't go out in the sun anymore. \n\n\nYou were trapped in the cellar until nightfall, so you sat among the glass jars, trying to think of a way to pass the time. You scooped some peach bits off the ground and rubbed them on your skin to see if it would help, but it only seemed to make the pain worse. You had to fan your arm with your hand, stopping every so often to switch to the other one. As you sat and fanned your arms and stared at the wall, you had another thought.\n\n\nA few hours ago, you were walking in the sunlight like it was nothing. Just then, a few seconds in the sun had burned you badly. You were starting to change, losing touch with your humanity. The Hunters and the taken probably did get fried by the sun, which was why they disappeared during the day. You were turning into one of them. You'd had your day of grace. Now it was starting.\n\n\nYou were angry, mostly at yourself. Your memory of being human was fuzzy, but you knew this: it was your fault you had been taken and bitten by that Hunter. You let it happen. Now you were going to turn into a soulless husk, just like the forgotten wanderers who roamed the streets at night.\n\n\nYou lay down on the floor among the broken glass, waiting until it was dark enough for you to emerge from the cellar. It felt like you spent days in the cellar, checking the doors every so often, only to find that it was still hot and sunny. When the sun finally set and it was safe to go outside again, you exited the cellar slowly, still careful not to alert any humans to your presence.\n\n\nAs soon as you got a safe distance away from the house, you broke into a run. You didn't know where you were going or why. Maybe you hoped you would stumble upon an answer, a way to go back. Maybe you were trying to run from the hunger in your stomach. Maybe you were just going insane. You ran, and ran, and kept running, until you ran into a Hunter.\n\n\nYou stopped short, just a few feet away from it. It was the same color as the night, its blurry outline hard to spot. It was long and slender, just like the one that attacked you. You hid in the brush and watched it, still fearful it would attack you, which was silly. You were part of its team. You and the Hunter were one and the same. Its long, slow stride was almost rhythmic. It raised a long, leathery leg and cleared a few feet in one stride, slowly moving forward. It almost seemed docile.\n\n\nEventually, after watching it saunter around for awhile, you rose up from your hiding place and called to it. You weren't sure if you were expecting a response, but you didn't get one. The Hunter turned its deformed head in your direction, and, for a brief moment, you held eye contact. Then, the Hunter deemed you unworthy of wasting energy on, and turned away. You watched it move away from you.\n\n\nA few moments passed, and you realized you were following it. You felt drawn to the creature, as though it was a friend you had known for a long time. It took long strides, passing quickly and quietly through the woods, and you just walked behind it, crunching leaves and snapping twigs. Some faint echo in your head warned you that this was a bad thing, that your instinct was to follow the creature, and that you had to fight it. The thought was quickly snuffed.\n\n\nYou lost track of how long you were following the creature, but you were suddenly lifted back into semi-consciousness when the creature stopped. it lowered itself and took on a defensive posture. You looked up, past the creature, to find that it had led you to an apartment building. The forest you stood in was encroaching on the apartment's back wall, the perfect cover to break into the building.\n\n\nThe Hunter began to move forward. The motion would have been terrifying, watching it crawl across the ground with alarming speed and in total silence, but you weren't afraid. You went to follow it like a lost puppy. The Hunter crawled all the way up to the back door of the apartment building. Slightly more aware, you noticed the windows had been boarded up. The door, however, was still free of obstructions. The humans trusted that the hinges could survive an impact.\n\n\nYou knew the metal door would stand no chance. The Hunter would tear through it and find the nearest human to take away. Suddenly, at this turning point, the small voice in your brain became very loud, telling you to stop the Hunter. You were right behind it after all, and it didn't seem to care about you. You didn't know if you'd be able to turn the beast away, or injure it to the point that it couldn't hurt anyone, but it was worth a try, right?", "action_results": [{"action": "Grab the Creature's Hind Leg", "result": "At that moment, the drive to keep fighting the Hunter's domination of the human race was reignited inside you, if only briefly. You grabbed the creature's right leg with both hands, as tightly as you could, and pulled backwards. The Hunter didn't expect it, and it slid backwards. It tried to create traction by hooking its claws to the concrete ground in front of the door, but this only created a horrible scratching noise.\n\n\nThe creature howled in anger and kicked you in the chest, sending you flying backwards. You landed in the brush a few feet away, but your work had been done. The sound of the Hunter's claws on the concrete  had woken up the apartment's inhabitants. Flashlight beams shone from the windows above, illuminating the Hunter. It howled, and fled as quickly as it could, once again paying no attention to you.\n\n\nA human emerged from the back door with a flashlight, and scanned the woods. You were already down and lying in a pile of leaves, and apparently the human didn't see you. Once the human decided it was safe, the flashlight beam disappeared, as did all the others. The door was locked, and you could hear scuffling sounds as something big and heavy was pushed against the door.\n\n\nWhen it was safe again, you rose, and patted your chest. The kick didn't break any bones, and you were still upright. After you knew you were safe, a new emotion took hold of you, one you didn't know still existed: pride. You saved people. You saved an entire building of people from the jaws of a wicked beast. \n\n\nThe feeling of happiness didn't last long, but the thought didn't leave your brain. You looked up at the apartment building, then at the woods where the Hunter had fled. You decided to stay by the apartment building, just in case something else came in the night. You searched around for a place to hide from the sun when it rose, and eventually came to rest in the building next door to the apartment.\n\n\nIt looked abandoned, and there certainly weren't any people inside, so you stayed in, and explored. From what you could gather, the building used to be something along the lines of a nursing home, but it was stripped bare. No posters or photos, not very much furniture remained. You were curious about what happened, but the thought didn't survive long.\n\n\nYou idly watched the apartment building from a window in the nursing home until you saw another figure approaching. Too small to be a Hunter, you knew immediately it was another taken. Another former human. You left the nursing home, and looked up at the sky. Sunlight couldn't have been more than a few hours away.\n\n\nThe pale-faced ex-human approached the apartment's boarded-up front window and began to push against the glass. You could only stare at the thing as it awkwardly tested the glass, trying to find a hole or weak point. You called out to the thing quietly. It ignored you and kept leaning against the glass. You wondered if would be best to leave the thing be, until a spiderweb crack appeared on the window.\n\n\nThe glass was thick and secured by wooden boards, but the thing was eventually going to get in. Several emotions fought for control of your next move. Part of you wanted to save the apartment again. Make a noise and alert them. Another part of you wanted to stay neutral. Stopping the Hunter was different, because a Hunter had killed you, and you held a grudge. A Hunter was a massive, gangly beast. This was just another person, like you. ", "action_results": [{"action": "Alert The Humans", "result": "You watched the taken human push against the window again, slowly deepening the crack in the glass. You knew what had to be done, even though you didn't like it. You roared out, a primal roar from deep in your hungry gut. Then you disappeared back into the nursing home. Immediately, faces appeared in the apartment's window's looking for the source of the noise. They quickly found the intruder, and dispatched someone to kill it. You sat away from the window, refusing to watch the taken human die. \n\n\nYou kept careful watch over the apartment for the rest of the night, although you probably didn't need to. The humans were much more alert after two attacks, and guarded the damaged window heavily until sunlight dominated the world again. They went back inside, knowing it was safe. You didn't have the forethought to find somewhere else to go before sunrise, so you were trapped in the nursing home. You didn't mind, though. It was a large building.\n\n\nYou wandered through the nursing home, now illuminated with sunlight, careful to avoid the streams of light coming from the windows. The place was relatively small, and the rooms that previously held patients were now stripped bare, save for a few random drains and pipes. The main thought that occupied your brain was curiosity as to why the place was so empty. Abandoned buildings were understandable, even if that was a bit much. Maybe keeping the elderly alive now was too costly. But removing every piece of furniture? It seemed excessive.\n\n\nYou pushed opened the wooden doors to every room, scanning the empty floor, not entirely sure what you were looking for, if anything. You certainly weren't expecting to find a frantic message scrawled on the floor of one the rooms. You passed it before because it was dark, but now you could see faint scratchings in the floor, done by some sharp tool. You had to step into the room and lean down to read it. It said, 'chlorine kills the demons.'\n\n\nA chill ran down your spine. From the looks of the message, whoever had written it was in a hurry, as if something was pursuing them. The message was clear, and yet you didn't understand it. 'Chlorine kills the demons'. It couldn't be that simple. It made no sense. The Hunters had wandered the earth for months now, and not once had they come in contact with chlorine? Even on accident? For that matter, who found out that was their weakness, and how?\n\n\nThe revelation was a sensory overload for you. Your faint whisper of an existence, wondering what on earth you would do with your rotting corpse, suddenly had the tools to dismantle the creatures. Well, that was an exaggeration. But this new potential weapon could prove useful. You wanted to try it first, just to confirm it worked, before trying to save a town full of people with a bucket of chemicals.\n\n\nWhen hearing chlorine, your first thought was swimming pools. Most domestic pools were full of chlorine. Would pushing a Hunter into a pool make it melt? The idea seemed foreign and impossible, and at the same time worth a shot. The next most common chlorine source would be soaps and disinfectant. You'd need a hardware store.\n\n\nAs you carefully approached a window to check how long it was until sundown, you found your animalistic urge to hunt being awakened. The fruit jars weren't holding up anymore, and you were hungry. Your stomach growled at the knowledge of a building full of food just next door, but you distracted yourself by deciding how to find and transport chlorine. The sun hovered just barely over the horizon, it couldn't have been more than an hour until sundown.\n\n\nYour vacant mind churning with new knowledge, you sat under the window and watched the light until it disappeared, and the world wore a cloak of darkness. You found yourself moving at alarming speed, leaving the nursing home behind and bounding down the road. You searched signs and buildings, hoping you would see an ad for a Home Depot, or something similar.\n\n\nThe first source you came across was a neighborhood with a large swimming pool near the entrance. It seemed abandoned, with all the houses' front doors wide open. At first your brain tingled with confusion, but the feeling quickly turned to horror when you noticed that all the windows were shattered, and the road was soaked in crimson.\n\n\nThe trails all lead to a forested area west of the neighborhood. You followed the blood trails as best you could, although you couldn't tell if hunger or fear was driving you. You hoped that the humans had just fled the neighborhood, but with each passing step that possibility shrank. Finally, you came upon the sight you knew you would have to face -- a messy pile of human bodies, all with severe bite marks on the bodies. \n\n\nJust as your initial wave of shock subsided, a new crashed into you as you realized how many Hunters would have to be involved with this attack. Was each human attacked by one Hunter, or did a few Hunters make forward and back trips? The former implied that the Hunters were becoming pack animals, a thought too terrifying to keep feeding. \n\n\nAs your fear and shock disappeared, your hunger was the next to take control, and you dropped to your knees over the nearest corpse, sucking the remaining blood from the tissue like a slice of orange. The humans lost blood fast, but you still got more than a full meal of blood from the corpses. You weren't proud of what you did, but it was a temporary solution that stopped you from harming the living. After you drank, you started back towards the neighborhood to retrieve the pool water.\n\n\nYou arrived back at the neighborhood in time to see another Hunter standing in the middle of the road by itself. It seemed almost dormant, and eerily calm. It was looking at the road, and apart from the slight movement of its arms due to breathing, it was still as a statue. You approached slowly, not wanting to wake it up. You slowly made your way towards it until you were standing right in front of it. It paid no attention to you. \n\n\nThe swimming pool wasn't too far away. You had to go up the road a bit further and make a right turn, and there was the pool of death. The only obstacle was moving the behemoth over to it. You were slightly afraid to just push it or grab its skeletal hand, so you tried making a noise. You clapped, and the creature raised its head. It saw you, and leaned in to examine you. Upon realizing you were already dead, it brushed you aside and began to mill in place.\n\n\nYou knew there weren't many options, so you fought your fear response and took the monster by its elongated wrist. It didn't take much notice. You slowly began to march in the direction of the pool, with the Hunter in tow. It clearly didn't want to follow you, but you pulled on its arm until it spun around, and began to walk in your direction. You guided it in the direction of the pool, and it wasn't until you were halfway there that you realized the humor in your situation. You were like a small child dragging its mother through the toy store. \n\n\nEventually, you were at the pool's edge. The Hunter didn't seem too afraid of the water, and had stopped resisting you. You sat there, holding the hand of a murderous beast, on the edge of a recreational swimming pool. Drawing in a breath, you pulled the monster in the direction of the water. It pulled back, and used its claws to latch onto the ground.\n\n\nThis was going to be difficult. You released the monster's hand and went behind it. You pushed firmly on its back, forcing it forward. It stopped just short and let out a short howl as if to protest. You pushed its legs one final time and sent it careening into the water. Immediately on impact, you heard a horrible hissing noise, like grease on a stove. It was a sizzle, accompanied by pained screams from the Hunter. It scrambled to escape the pool like a dog out of a bathtub, and eventually pulled itself out of the water.\n\n\nThe Hunter's skin was falling off its frame in large chunks. The creature was literally melting before you, its organic matter crumbling. The Hunter staggered forward, then collapsed into a heap of biomass. Seeing its bare skull and bones was a little unsettling, but you couldn't care less. It had worked. The chlorine in the pool water was lethal.\n\n\n ", "action_results": [{"action": "A New Weapon", "result": "There was a small building next to the pool labeled 'maintenance'. The door was closed but not locked, so you could easily get in. There was only one room inside, and it consisted of multiple shelves stacked with all manner of pool-cleaning supplies. You read some of the bottles, looking for chlorine as an ingredient, but didn't find much. You figured you could still use the soap containers to store pool water, so you took them anyway, along with a metal bucket in the back corner.\n\n\nYou emptied the bottles of soap, took all the containers outside, and filled them with pool water. When you were done, you had thirteen bottles and one bucket of Hunter poison. The job had taken a long time, but it was still hours before the sun would rise again. You had time to test the effectiveness of your arsenal. The only issue was transport. Water was heavy, and so was a big metal bucket. You needed a way to carry the bottles with you.\n\n\nWithout proper materials, the best you could do was a makeshift bag made from the pool net. You made a mental note to find a duffel bag soon, and packed as many bottles as would fit in the net, minus the bucket. You left it behind because it had no top, and would probably be more hindering than helpful. You took the net bag and left the neighborhood, keeping a safe distance away from the pile of Hunter bones.\n\n\nWith no clear destination in mind, you started off in a new direction. You had never actually seen a Hunter during the day, and didn't know where they hid, or if they had homes. The closest you could get was to find a group of humans, where a Hunter was likely to attack. Neighborhoods were your best bet, and you were in a residential area, so the odds were hopefully in your favor.\n\n\nYou passed two more neighborhoods, both of them secure. There were humans in the houses, and the streets were safely lit. No sign of any Hunters. You sighed. Of course it would be difficult now. They were everywhere when you didn't want to see them, but seeking one out was apparently impossible. You kept walking down the side of the road, intently watching the darkness for moving silhouettes.\n\n\nAnother few hours passed, and the moon was sinking lower into the sky. You feared you'd have to wait another day before searching again. You were ready to admit defeat and start searching for a hiding place when you heard a scream, followed shortly by a grating scratching noise coming from the road ahead. You tensed up and started sprinting down the road towards the noise.\n\n\nA young, female human was sitting in the driver's seat of a car parked on the side of the road, near the entrance to another neighborhood. At first, the car seemed to be violently shaking for no reason, but then you saw the faint outline of a Hunter sitting on the car's roof. The human screamed, and the Hunter dragged its claws across the windshield, repeating the grating noise you heard. This was a perfect opportunity.\n\n\nYou dropped the net bag and grabbed the first bottle you could find. It was a decent size, probably enough to at least scare away the Hunter. You ran for the car, praying the Hunter wouldn't tear the car in half before you got there. As you got closer, the human saw you through the windshield. Her eyes widened, but she was speechless. You made eye contact with her and held a finger to your lips, instructing her to stay silent.\n\n\nThe Hunter was pulling at the passenger side door now, trying to rip it off.  You feverishly screwed the cap off the bottle of pool water and moved in closer. You could see the Hunter perfectly now, its jaw slick with saliva. The human watched in confusion as you dumped the bottle of water onto the Hunter's arm.\n\n\nThe water made contact with the Hunter's skin and immediately created a loud sizzling noise. The Hunter roared, and swung its arm down at the car. The window shattered, and the human screamed again. The Hunter adjusted itself and reached a claw down into the car. You quickly started splashing the water onto the Hunter's face and arm, burning it badly. \n\n\nThe Hunter was enraged now. It yanked its arm back out of the car, and you could see tears and bubbles in the skin. The Hunter swung a claw at you, pushing you backwards and knocking the bottle out of your hands. It screeched again, and launched off the roof of the car into the woods. You righted yourself and watched the creature disappear into the night. Picking the bottle up off the ground, you inspected it for damage. Unfortunately, it seemed the Hunter had slashed it in half.\n\n\nThe human girl was in shock, unable to move. She stared at you with her mouth open, not knowing how to react. You stepped forward to address her, but she cowered back into her seat. You caught a glimpse of yourself in the rearview mirror, a pair of cloudy, sunken eyes looking back at you. Your skin was bone-white, and your jaw was clearly visible underneath, a painful reminder of the difference between you and the human in front of you.\n\n\nDeciding there was no way to communicate with her safely, you turned back to pick up your net of chlorine water. You'd lost a bottle, but there was enough left that you could keep going. The pool you had collected from was miles away now, and you wished you had taken more. There was no telling when the next source would pop up.\n\n\nYou heard the car door open behind you, and the human stepped out.  She was watching you intently, but the fear was gone from her eyes. She slowly moved toward the neighborhood, and it occurred to you that no other humans had come to help her, despite her screams. You wondered if she was an outcast, and that was why she slept at the entrance of the neighborhood, rather than inside it.\n\n\nShe moved into the neighborhood, eventually looking away from you to find her way. You stood still and let her leave, until she stopped and turned back around. It was almost as if she was beckoning you to follow. You took an uneasy step forward, and she nodded. You walked slowly towards her, and she turned to continue walking into the neighborhood. You stared to find your footing with more confidence now that you knew she wasn't afraid.\n\n\nShe led you down to the far reaches of the neighborhood, past rows of empty houses. They were all as vacant as the neighborhood that had been attacked, and you wondered if something similar had happened here. The air was quiet, except for the light padding of your feet on the road and the human's ahead of yours. You walked all the way down a road until you reached a lone house bordering the woods. A makeshift fence had been built around the property, sheltering it from the forest. One look and you could tell it wouldn't stop a Hunter at all, but perhaps it was for taken humans. Like you.\n\n\nAnother human opened the front door of the house. Upon seeing you, he ran outside, ready to kill you. The younger human raised her hands to stop him, and explained what had happened. As she told the story, the man watched you with a look of fear, then shock, then remorse, then acceptance. He had deemed you safe.\n\n\nThe young female was the one to invite you inside, the man didn't seem too keen on allowing you in. But, you had saved a life. That was enough. Once inside, you dumped your net of bottles onto a table. The man looked at you in confusion, not understanding. The female didn't make the connection either. You couldn't speak, so you looked around the room to find something to write with.\n\n\nYou found a sharpie in a drawer, and approached the wall. You took off the cap and began drawing a diagram. The man stepped forward to stop you at first, but stepped back when he read what you wrote. You drew a crude picture of a Hunter, then crossed it out. You drew a picture of a bucket, labeled it 'chlorine', and showed it pouring onto the Hunter as best you could. You finished the drawing by aggressively scribbling out the Hunter.\n\n\nThe man stared at what you had drawn for a moment, then looked at you. He held up one of your bottles with a quizzical look. You nodded. He looked at you, then at your drawing, then back at you. He set the bottle down, and gestured for you to follow him. He took you into a basement, where he had a rubber hose hung on a wall.\n\n\n ", "action_results": [{"action": "War", "result": "The two humans lived in the neighborhood alone, their neighbors either leaving or dying. This meant you had everything in the other houses at your disposal. The man had a workshop in his basement, and besides the hose he had tools to build a weapon of sorts, a powerful liquid cannon to attack the Hunters.\n\n\nYour job was to search the neighborhood for more chlorine. You broke into windows and searched shelves, reading fine print and ingredients labels for anything and everything that contained chlorine. You gathered them all on the road in front of the humans' house, totaling over thirty bottles when you finished the first street. \n\n\nSoon, the sun came up. You were safely hidden inside the house, away from all the windows. Your massive collection of chlorine sat on the road, waiting for the next night. Down in the basement, the machine was nearing completion. The man had made some modifications to a power washer and attached the rubber hose to the nozzle. He carried it upstairs and showed it to you. When you saw it, a small fire lit in your eyes.\n\n\nA different kind of hunger fueled you now, a feeling you could only call revenge. You walked by the humans many times, not once feeling the urge to attack. Your focus of hunger and hate was not on any human, but on your killers. The world's killers. The Hunters. You don't remember how long it had been since they were here. You couldn't remember a time before them. What you knew now was that it was over. Once the rest of the world caught on, they could fight back, and this nightmare would be over.\n\n\nYou waited impatiently for the sun to go down, busying yourself by playing with the power washer. It had power settings from 1 to 10, and you could only imagine the effect a rocket of acid would have on a Hunter. You hoped it would kill on impact. That would be ideal. But, if you could at least wound them beyond repair, make them fear humans, it would be enough. \n\n\nFinally, the sun was lowering in the sky. Retribution was near. Once it was safe, you and the man got to work. A new, bigger holding tank had been welded to the power washer, allowing it to hold more liquid. You dumped bottle after bottle of bleaches and soaps into the container, watching them mix into a brown color. For a moment, you worried about creating an explosion by mixing this many ingredients, but evidently you got lucky, because everything went off without a hitch. \n\n\nYou stood in the middle of the road, the rubber hose gripped tightly in your hands. Behind you, the humans stood at the controls, ready to power you with chemicals. The sun had long since disappeared, creating the perfect conditions for a test run. You nodded to the man, and he stood up, and let out a long yell. It echoed over the trees, traveling fast and far. \n\n\nIt didn't take long to hear a response. A faint roar came from not too far away, and you could see trees moving as the Hunter brushed past them. Leaves and twigs crunched under its feet at amazing speeds as it barreled towards you. Finally, the Hunter burst through the treeline just down the road. It saw the humans, and roared loudly, a deafening roar. From all around you, a chorus of roars responded. A slight sense of worry formed in you as you wondered if you had underprepared.\n\n\nThere was no time to think now. The Hunter was galloping towards you. You turned around. The younger human nodded at you, and turned the power washer to setting 5. You turned back just in time to see the Hunter in front of you, ready to strike. You pushed on the nozzle and sent a spray of soap forward. The foamy wave covered the Hunter completely, creating the same sizzling as before. It howled in agony.\n\n\nBehind you, the human turned the power up to 6. The chlorine spray strengthened, pushing the Hunter backwards. Its skin was flaking away quickly, and the was a visible hole in its body where the spray was strongest. You stepped forward as it moved back, and pretty soon the Hunter was no more. Behind you, the human turned off the nozzle.\n\n\nYou stared in awe at the soapy, foamy pile of bone that the Hunter left behind. You set down the hose and walked up to it. You could see the tattered skin stretched over the cracked bones. You picked up a piece of the skin and held it up to the moonlight. It looked like blackened swiss cheese, wrinkled and tattered beyond repair. After a few seconds, the skin began to fall apart, and dropped out of your hand onto the ground.\n\n\nCareful not to touch any chlorine yourself, you picked the hose back up. The humans were smiling, and you realized you were too. The plan was a success. From here, it would only be a matter of spreading the word. You had a pair of humans now who could help. You could unite neighborhoods,, and soon there would be an army of humans, all carrying buckets of chlorine to wipe these monsters off the earth. You basked in the aura of power you felt around you. You were strong now, and the Hunters were weak.\n\n\nSuddenly, a chorus of crashing broke the silence. You could hear several Hunters approaching quickly, screeching and screaming at each other. A look of fear crossed your face, and you looked over at the humans. Instead of fear, they wore expressions of determination and power. The man stepped forward and put a finger on the power setting. You nodded.\n\n\nStepping forward, you gripped the hose tightly. As the first Hunter came rushing into view, you took your aim. Behind you, the man turned the power setting up to 10.\n\n\nREVOLUTION ENDING", "action_results": [null]}]}]}, {"action": "Do Nothing", "result": "You watched from the window as the taken human slowly but surely made progress in breaking the window. It was about halfway through when in stopped short and tensed up. You could see, even from far away, that it had realized there were humans inside. Its urges took the wheel, and it effortlessly shattered the window and tore through the flimsy wooden defenses.\n\n\nYou remained motionless, knowing inside that you held the taken human's existence over that of the apartment's occupants. You could hear noises inside the building as the monster made its way upstairs, and the feeding frenzy began. The taken human emerged a few minutes later, soaked in blood and moving considerably slower.\n\n\nThe memory of elation that came from stopping the Hunter began to fade out as you watched the corpse amble down the road. Your mind was a pool of uncontrollable thought, unsure of which direction to pull you in. After some time, you eventually steered your thought process back to your original goal: you were on the humans' side. Letting the taken human attack the apartment was different. It didn't count. You couldn't stop another creature with just the same goal as you. Your enemy was the Hunters. The thoughtless killers.\n\n\nAs you began to think about an actual game plan for combating the Hunters, a few options became apparent. Bombing the land wouldn't work, as that would most likely kill humans, too. It also wouldn't necessarily kill all the Hunters. Then you realized you didn't know if explosions would hurt Hunters. Did anything hurt them? You'd never seen a dead Hunter, nor an injured one. Either they were scared off, or they killed. \n\n\nThe next option was a military force of some kind to sweep the land and eliminate their hiding places. A militia to hunt the Hunters during the day, when they were weakest. You doubted any official armies were still around, like the police or national guard. That left you with two options: gathering regular townspeople, or going in search of a military base or government building. You could at least find some sort of weapon stash or information to aid you.\n\n\nYou sat and played with the ideas in your head, molding them like clay. Eventually, you decided that gathering a makeshift army was your best shot. That would prove difficult, but not as difficult as wandering the earth, hoping to chance upon a military bunker stocked with guns. Yes, that was your plan. You would search around for a way to form an army, and then you could save the world from the Hunters.", "action_results": [{"action": "You're Lying To Yourself", "result": "The plan would have to work. After all, there weren't many options for you to try. You had been a human at one point, and never had you heard a whisper of trying to hunt the Hunters. It just wasn't worth it back then. But now, knowing the risk, you could at least try to convince someone. Anyone. Someone would listen.\n\n\nYou began to walk away from the apartment building, knowing full well that the sun would be up soon, and that you were actively walking away from the only inhabitable safe space you would see for awhile. You made an assumption that no humans would be willing to take you in, and the chances of two abandoned buildings within walking distance of each other was slim.\n\n\nYour mind was fading, and you repeatedly forgot what you were doing or where you were going, only to remember a few seconds later. You knew you were losing consciousness, that the inevitable pull of darkness would soon overcome you, and you did nothing about it. As long as you could save the world, everything would be fine.\n\n\nYou walked until the sun was beginning to peek over the horizon, and then you moved into the woods for the extra cover. By the time the sun had fully risen, your apathy had left you unprepared. You quickly moved into the back door of a nearby building, which happened to be a restaurant. The back door led to the kitchen, where you stood. \n\n\nThere weren't many places to hide in the kitchen, so you resorted to locking yourself in the walk-in freezer, among boxes of frozen beef patties. The biting cold was little more than a faint tingle on your skin, and there was a small window near the ceiling on the back wall. You sat between two rows of boxes facing the window, patiently waiting for sundown.\n\n\nYou had drifted off at some point, and you were miles away until the sudden noise of the freezer door opening woke you up. You watched a short, fat human wearing white step into the freezer, look around, and then pick up one of the boxes of meat. He inspected it, decided it wasn't useful, and put it back to choose another box. Your brain took several minutes to make the connection that a human was two feet away and unaware of your presence.\n\n\nYour first thought was hunger, to kill the human. You struggled to diminish that thought, and distracted yourself by thinking about your plan. Maybe this human would be understanding, and you could get him to know you weren't going to hurt him. You were running out of time, as the human had found a satisfactory box and was selecting a package of frozen meat out of it. The only thing stopping you from trying to speak was the fear that he would kill you.", "action_results": [{"action": "Get His Attention", "result": "If you really wanted to save people, you had to start somewhere. The human was just about to leave you behind, you needed to act quickly. You stood up and stepped out of your hiding place. The human saw you immediately, and dropped the package of meat in fear. \n\n\nYour intention was to try to communicate with him, but that wasn't what happened. As you opened your mouth, your hunger took control, and you stepped forward and bit the human's neck. Your teeth effortlessly sliced through the human's skin, and you began to suck his blood. The human yelled in shock and tried to push away, but you were too strong. you kept drinking until there was nothing left, and the man was lifeless on the ground.\n\n\nAfter you finished, you looked up to see, through the freezer door's window, a horrified human staring at you with wide eyes. He slammed the freezer door and locked it, trapping you inside. You ran to the door and tried to knock down, but even at full strength you couldn't get it to budge. You watched helplessly through the window as the human scrambled out of the kitchen.\n\n\nThe blinding light coming from the windows of the kitchen told you it was the middle of the day, and you hadn't slept as long as you thought. You were stuck in a room with only one entrance, and there were undoubtedly several humans in the building. A sense of doom began to grip you tightly. Sure enough, a group of humans came back into the kitchen to see you. They all watched in awe at the monster trying to open the freezer door.\n\n\nIt was clear they had no intention of letting you out. All they did was stare at you. This fueled your rage, and you pulled at the handle with all your strength, only to have the handle snap off. You fell backwards, immediately sat up, and looked at the piece of metal in your hand in disbelief. There was definitely no way out now.\n\n\nYou became something of a tourist attraction. Humans came from all over to eat at the restaurant and see one of their evil oppressors locked in a small room. Your rage quickly boiled over, but there was nothing you could do. You screamed and threw boxes of meat and scratched at the walls, only entertaining the humans. \n\n\nAfter a few more days, the cold temperatures started to get to you, and your mobility decreased. Your joints locked up, and your eyes froze in place. It was quite a show for the humans to see you stare at them with wide, bloodshot eyes from the safety of a thick metal door, and all for just five dollars plus purchase of a meal. ", "action_results": [null]}, {"action": "Stay Quiet", "result": "Eventually, your fear won out, and you stayed quiet. The human left the room, taking the package of meat with him. You could see through the window that it was still daytime, so you settled back in to rest.\n\n\nWhen you woke up next, the sun was going down. You stepped out of your hiding place to see that the freezer door was wide open. A human stood in the kitchen, writing something down on a clipboard. His back was turned to you, and he was intently focused on his task. Your instinct to attack reappeared, and this time it was harder to stop it.\n\n\nYou rushed out of the freezer and vaulted over a row of ovens. The human turned just in time to see you grab him by the shirt collar and bite into his neck. He yelled out, but there was nobody to hear him. You drank his blood, and left him on the floor. Your muscles were twitching from the cold of the freezer and the adrenaline rush, so you stepped outside.\n\n\nThe world was vacant again, no humans in sight. You started traveling down the road in the same direction you had been going the night before. As you walked, you thought about the human you had just killed in the restaurant. At first, you dismissed it as another allowance. It had to happen, how were you supposed to save everyone on an empty stomach?\n\n\nSomewhere deep in the recesses of your mind, you knew it wasn't an allowance. You had no intention of saving anyone. You had already killed so many, and there was no way to stop. But, it was something to focus on, so you kept feeding yourself that thought. You were a force for good, you just needed a lead. something you could use to fight. Then you'd get serious about saving people.\n\n\nThe night wore on slowly as you walked down the road. You were in the middle of a city block, there were no people around. Just empty stores and shops. You kept walking, not knowing or caring where you were going. Your last fleeting bits of conscious thought  were spent on where you would find you next meal.\n\n\nJust one more, then you'd get to saving the world.\n\n\nINSANITY ENDING\n\n\n ", "action_results": [null]}]}]}]}, {"action": "Walk Away", "result": "The voice in your head urged you to stop the Hunter, to take action. But your legs didn't move.\n\n\nYou stood there, motionless, as the Hunter lunged forward, obliterating the metal door. You stood there, motionless, as the Hunter practically flew out of sight. You heard it rapidly climb a set of stairs, followed by a chorus of howling from both the Hunter and the humans. You sat in front of the folded metal door and waited. The Hunter emerged an instant later with a frightened young woman in its grip. It shot back into the woods like a firework, disappearing into the night.\n\n\nYou stepped back to hide in the brush as a group of humans came running out the door hole. They were yelling a name, presumably the name of the woman. Of course, their efforts were in vain. The calls became less hopeful and more desperate. When they finally subsided, you came out of your hiding place. You stared at the woods until another thought broke the tension.\n\n\nThe Hunter was probably responsible for your inaction. You didn't know how, but following the Hunter, being in its presence...it was almost like a figure of authority. Who were you to try to move the beast as it pursued a victim? A twisted trust in the Hunters began to take root in your mind. This was the way it was, and would be for as long as humans and Hunters coexisted. Saving one life was a worthless risk, a small breath of air compared to all that was likely happening, all the lives lost around you.\n\n\nSoon, all the thinking about human lives and Hunters reminded you of the hunger in your stomach. You immediately turned towards the empty doorframe in front of you, then turned away, scolding yourself. You had promised yourself you wouldn't go down that path. But then again, what had you just done? By the same logic you just used, one more life wouldn't matter. One more meal to keep your strength up, so you could save the world...\n\n\nOnce you subconsciously gave yourself the green light, it was a small matter. You stepped into the building. A human was just coming off the stairs carrying a bag of garbage. Upon seeing you, he yelped. Ditching the garbage, he made a break for the stairs, not landing a single step before you had him by the shoulder. You killed him and tore his throat open. A fountain of blood soaked your face and clouded your vision, and you lapped it up like a thirsty dog. \n\n\nNobody came to the human's aid. You left his body on the ground, and exited the building. The thrill of the hunt had brought your senses back, and you were more alert. The question now was what to do with yourself. Small things didn't matter, you had decided. You were allowed to kill, only to feed yourself. After all, you needed the strength. The rusted gears of your mind began to slow whir to life once more. If you really did want to stop this, to save what was left of humanity, going around killing Hunters like a discount Batman wasn't going to cut it. You needed a widespread solution.\n\n\nA few options became apparent. Bombing the land wouldn't work, as that would most likely kill humans, too. It also wouldn't necessarily kill all the Hunters. Then you realized you didn't know if explosions would hurt Hunters. Did anything hurt them? You'd never seen a dead Hunter, nor an injured one. Either they were scared off, or they killed. \n\n\nThe next option was a military force of some kind to sweep the land and eliminate their hiding places. A militia to hunt the Hunters during the day, when they were weakest. You doubted any official armies were still around, like the police or national guard. That left you with two options: gathering regular townspeople, or going in search of a military base or government building. You could at least find some sort of weapon stash or information to aid you.\n\n\nYou sat and played with the ideas in your head, molding them like clay. Eventually, you decided that gathering a makeshift army was your best shot. That would prove difficult, but not as difficult as wandering the earth, hoping to chance upon a military bunker stocked with guns. Yes, that was your plan. You would search around for a way to form an army, and then you could save the world.", "action_results": [null]}]}]}]}]}]}