{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=1447", "context": "", "first_story_block": "“Come on Alex, hurry up!”\n\nYou smile at your friend, Sophie, as she struggles with to walk up the cobblestone path with a large bucket and unwieldy mop. She stops and turns back to you, drops the bucket, and puts her hand on her hips. “This is going to be some job,” she frowns, gesturing to the house.\n\nYour eyes sweep over the mansion. At least 20 dark-paned windows stare back at you. At least windows are Sophie’s job, you think. Then sighing, you say to Sophie, “Yeah, I wonder how many square feet of floor I’m going to have to vacuum.” Then you continue to trudge, dragging your favorite vacuum behind you and readjusting the knapsack of cleaning supplies on your shoulder.\n\nYou and Sophie are college students who clean houses for extra money. You got into it after a friend offered you guys $20 to clean his apartment after seeing how spotless the two of you kept yours. It’s been quite lucrative, earning enough money for rent and pocket change, and you pretty much get to pick your hours. Customers are plentiful since you placed a free ad in the college paper. People seem to be calling the house all the time. Housewives that need a helping hand, new graduates needing their place cleaned before they move out, even some pretty crazy after-party cleanups. You name it, you and Sophie have cleaned it. Except maybe this…", "action_results": [{"action": "continue....", "result": "“This has got to be the biggest house we have ever been called to!” Sophie muses. “Did the guy on the phone…say anything about pay?”\n\n“No,” you say. “But I’m gonna let him know that we’re not doing it for under $300. Maybe even more if the inside is as bad as the outside.” You glance disapprovingly at the overgrown walk and abandoned gardens.\n\n“Yeah, I sure as hell hope he doesn’t think we do yard work too…” Sophie mutters.\n\nThe two of you approach the huge double oak paneled doors. Sophie reaches out to use the knocker.. But snaps her hand back….\n\n“Ugh!” she exclaims. Fumbling in her knapsack, she fishes out a Swiffer cloth and removes the layers of cobwebs from the knocker before knocking. The knocker resonates through the porch. “Make that $600, “ she laughs. “I have a bad feeling about this… did we bring enough Swiffers??”\n\nJust then, the door slowly opens. A small face peeks out from the cool darkness. “What do you want?” the pale-faced girl says accusingly.\n\n“We’re the cleaners that were called for, “ Sophie huffs. “This IS 331 Oakmount Drive, right?”\n\n“Yes, oh, yes.” the young woman exclaims breathlessly. “Oh, please do come in. I’m quite sorry.”", "action_results": [{"action": "Go into the house...", "result": "You and Sophie step into the dimly lit foyer. It doesn’t seem to be incredibly filthy, just a lot of dusting needed. In front of you, a carpeted staircase dwindles up into darkness. To your left, through a small lounge, an elegant dining room is visible. To your right, is a room filled with lovely but ancient looking divans. Beautiful Botticelli like paintings can be seen displayed down the hallway to the left of the staircase, and the antique furniture in the foyer is just exquisite. Whoever lives here has great taste.\n\nYou hear Sophie talking and snap back to reality.\n\n“…our own cleaning products. It’s just a matter of personal taste. Now, do you have a list of the tasks that need to be done? We like to go over this, get a tour of the house, and negotiate the fee.”\n\nYou notice the girl, obviously a maid, by her plain uniform, doesn’t really look into Sophie’s face. Gee, she must really have a mean boss or just have social issues.\n\n“Well, “ the girl murmurs, “I don’t have that list but I will go get it for you. Please, have a seat in the sitting room and I’ll be right back.”\n\nShe ushers you into the room to your right. You and Sophie set down your supplies and sit. The maid flutters out of the room, through the opposite direction that you came into this room.\n\n“BRRRR!!” Sophie shivers and then looks at you. “God, can this house be any colder?” she laughs.\n\n“Well, at least we won’t be dying when we get working. Remember the Kappa Delta Gamma frathouse?? That place was like 100 degrees! I think they cranked up the hea….” You are cut off by an ungodly loud moan coming from the stairs!\n\n“What was that?” Sophie whispers. You slowly turn around in your chair and gaze into the foyer, and up the stairs, and see…nothing. It’s just too dark to see from here.\n\nSophie grabs your arm. “Ooo, okay. This is getting a little weird. Maybe we should just split. Mrs. Loupee needs us to clean her house anyway…what do you say?”", "action_results": [{"action": "\"You’re right Sophie. Let’s leave.\"", "result": "“You’re right, Sophie. This is all getting a little too weird. Let’s just leave.” you say.\n\nYou gather your belongings and head into the foyer. You reach for the door handle, and pull, but… nothing! You tug at it again. Letting go of the vacuum, you pull with both hands.\n\n“It won’t budge!” you cry to Sophie. Sophie stares in disbelief, mouth agape, and then starts yanking on the second door handle. You both try pushing as well, but no luck.\n\n“Well, this is great,” Sophie snorts, leaning on the door. “So much for our quiet getaway. I guess we have to find that maid and get her to open the door. But which way did she go?”\n\nIt’s up to you.", "action_results": [{"action": "Look for her through the sitting room.", "result": "You head back into the sitting room, with Sophie right behind you. Crossing the room, you cautiously push open the door on the opposite side. It opens into a large living room. The two of you move slowly into the room and look around. There are several couches surrounding a large coffee table. Upon the table is a glass bowl with wilted roses in it.\n\nSophie eyes the bowl. “Gee, the maid sure isn’t doing her job.”\n\n“Yeah, I’ve been thinking about that, Sophie. If these people have a maid, then why are we here?”\n\nJust then, you hear a noise to your left. You turn sharply and in the doorway is a man. He is very handsome, tall with slicked back black hair. He smiles at the two of you.\n\n“Uh, hi.” Sophie stammers. “We’re, uh, the cleaners that were called. Um, the girl who let us in has been gone for a while so….”\n\n“I’m so sorry. I‘m Mr. Alexander, the owner of the house.” The man’s voice is deep and rich. “Come with me.” He motions for you to follow him through the doorway he is standing by, which appears to lead into a library of some sort.", "action_results": [{"action": "Follow him.", "result": "Sophie shrugs and the two of you follow Mr. Alexander into the study.\n\n“Please sit,” he says, indicating two leather chairs. The two of you sit and he says, “Please wait just a moment,” and leaves the room, closing the door behind him.\n\n“Wow, hunk city!” Sophie exclaims, grinning. “And he’s rich! This is turning out to be pretty interesting!”\n\n“He is pretty cute,” you agree. “But,” you frown, “If I married him I’d be Alex Alexander…”\n\n“Who’s talking about marrying him? I just wanna…” Sophie stops in mid-sentence as you hear a click. Then you hear a scream!\n\nJumping up, you grab the doorknob of the door the man just exited. You rattle it but no use! It is locked. “Not again!” you moan. Your eyes spin around the room. There is another door. You head towards it, but Sophie says, “But we don’t know where it leads! Cute guy or not, I’m ready to get out of here. Maybe there is a key for the locked door somewhere in this room.”\n\nWhat do you do?", "action_results": [{"action": "Search for a key.", "result": "“Well, let’s try the desk.” You go around to the back of the large pine desk and start opening drawers and rummaging through. Sophie does likewise on the left side of the desk.\n\nSuddenly, Sophie grabs your arm. “Hey, look at this!” she exclaims, shoving a picture in your face.\n\nIt is a picture of Mr. Alexander, the man you just met, and a red-headed woman. They are smiling lovingly at each other. “I‘m very sorry for you, Sophie, that he’s married,” you say, “But, we’ve got bigger problems…”\n\nYou point at some paneling to the left of the desk. There is a dark red stain pooling up at the bottom edge.\n\nSophie’s hand flies to her mouth. “Oh, my God! I don’t even want to know…”\n\nYou hear the locked door click again, and both your heads snap towards it. The door opens quickly… and standing in the doorway is Mr. Alexander! He looks incredibly angry! The two of you scream and run for the other door…\n\nYou tumble through the door into a windowed breakfast room. You and Sophie hurriedly stumble through the iron-wrought chairs and your eyes dart around for which way to go. You can see a garden from here, but there are no doors leading outside. There is also a door to your left, and a door to the far right, but it looks like Mr. Alexander might make it there first. What will you do?", "action_results": [{"action": "Go to the left door.", "result": "You grab Sophie's hand and rush through the door to the left. You find yourself in a long, windowed hallway. Making a quick left, the two of you veer back into the Botticelli hallway you saw when you first came in. Sophie pulls you behind the door, and you hear Mr. Alexander rush past, and you see him run to the left, towards the sitting room.\n\nBut you know you are not safe forever. You cautiously edge out from behind the door. You can see the foyer and front door from here. Sophie runs forward optimistically and tries both doors, but no luck, they are still shut tight. You look around the foyer for options. There's the lounge to the right, and the sitting room to the left, but that's where HE went, so it's out. There's also the staircase, looming up into the dark unknown'.\n\nHurry! He might come back anytime!", "action_results": [{"action": "Dash into the lounge.", "result": "You urge Sophie to follow you into the lounge. The two of you huddle in the corner behind the wet bar.\n\n“What is going on?” Sophie hisses to you.\n\n“I don’t know. All I know is, Mr. Alexander isn’t too nice and we’ve gotta get out of here!” you respond.\n\n“No chance this place has a phone, huh?” she asks you.\n\n“Hmm, actually, it probably does. They did call us to come over,” you tell her.\n\n“Man, I wish I’d never taken that call,” she moans.\n\n“No time to worry about what we shouldn’t have done. Let’s just find a working phone and..”\n\nYou stop and pull yourself further into the shadows as you hear someone approach. You peek out from behind the wet bar to see the maid pattering past.\n\nShe could help you find a phone. But then again, she does live here, and she might try to hurt you. You could just follow her and see where you goes, maybe there is a phone there.\n\nWhat do you do?", "action_results": [{"action": "Follow the maid silently.", "result": "As soon as the maid leaves the room, you grab Sophie and the two of you sneak out and softly walk behind her. She walks briskly through the dining room. You watch just from around the edge of the wall until you goes through a swinging door into what you briefly glimpse is a kitchen, and then you follow.\n\nWhen you push the door into the kitchen, you peek in and see that she is nowhere inside. You and Sophie step cautiously into the kitchen and look around. The kitchen is entirely chrome. The door across the way is still swinging, so you assume she went through there.\n\nYou start to follow her, and then you hear her voice in that direction - talking to Mr. Alexander! He sounds very agitated and is questioning her. They seem to be getting closer, so the two of you duck into the nearest door - a pantry.\n\nThe two of you squeeze inside the dark room, pulling the door shut behind you. You hold your breath and hope they just move by you.\n\nSophie squirms next to you and whispers in your ear. “There’s something in here!” she hisses. “I feel something on my leg!”\n\n“Just ignore it,” you whisper back.\n\n“No!” she cries. You feel her hand whiz past your face in the dark and you know what she is doing - reaching for a light switch.\n\nYou just can’t stop her in time.\n\nLight floods the tiny room. And you find what was on Sophie’s legs - hundreds of cockroaches. They fly everywhere in abhorrence of the light, fluttering through the air like a swarm of locusts.\n\n“Eaggghhh!” Sophie screams and tries to bat the insects away from her face.\n\n“Oh shi -” you say as the doorknob turns. Mr. Alexander faces the two of you.\n\nThere’s nowhere to run, so this is…\n\nTHE END", "action_results": []}, {"action": "Stand up and talk to her.", "result": "You rise from behind the wet bar. “Please help us,” you call to the maid. She stops, startled, and turns back to you. She has a frightened look on her face.\n\n“Can you let us out of here?” you ask. “We’d really like to go home, now.”\n\n“No, no, I can’t, “ she murmurs weakly. “The Master would be so angry….”\n\n“Please,” Sophie stands too. “Look, we don’t want anything to do with this place, just let us out and we’ll never bother you again.”\n\n“Um… okay… just follow me.”\n\nOkay, that was a little too easy. Maybe she is trying to trap you.", "action_results": [{"action": "Follow her into the foyer.", "result": "Eh, what have you got to lose? You follow the maid into the foyer. She fumbles in her pockets for something, then pulls out a large key. She reaches out to unlock the door when -\n\nMr. Alexander storms into the room. “Oh, Vera, just what are you doing?” he bellows at her.\n\n“I…I…” She stammers and shakes so badly that she drops the key.\n\n“I told you never to interfere when I am harvesting for Mrs. Alexander! I thought you would obey me, but no! This is the last time you disobey!” And with that he seizes her throat and begins to throttle her.\n\nYou feel pity for her… but you’ve got yourself to look out for.\n\nWhat do you do?", "action_results": [{"action": "She did try to help. Return the favor by trying to fight off Mr. Alexander.", "result": "Luckily, Sophie must have dropped her knapsack in here earlier. You quickly grope through the bag of cleaning supplies. You find what you are looking for, an industrial size can of generic Lysol.\n\nGrabbing Mr. Alexander by the bicep, you spray him in full force in the eyes with the toxic stuff. It does the trick and he roars loudly in pain, stumbling away from Vera.\n\nYou hurriedly stoop and pick up the key, and unlock the door. You, Sophie, and Vera flee out into the very welcome sunshine, running full force down the long hill to your car, parked on the street. The three of you jump in and you start the car as fast as you can.\n\nYou go to the police station, and although they are skeptical at first, they believe you after the units sent to the mansion find dozens of bodies. Apparently the Alexanders were involved in some sort of rituals. No one will ever really know what they were because the Alexanders went to the gas chamber without explaining, and though she had extensive therapy, Vera never could speak about it. A room was found filled with charred books, but no one could make sense of them.\n\nIt doesn’t really matter, does it? You are just glad to be free. And you won’t be cleaning any more mansions for a long time.\n\nTHE END", "action_results": []}, {"action": "Run for your lives up the staircase.", "result": "It’s every man for himself in this crazy place. As long as he’s got her, he can’t get us, you think. You grab Sophie and the two of you flee up the stairs.\n\nAt the top of the stairs, you glance around frantically for where to go. It’s pretty dark up here. You can see a light flowing through the door jamb of the room to your left. Might as well go in….\n\nYou ease your way into the room, which is a very large bathroom, with beautiful if somewhat worn down furnishings.\n\nSuddenly you can hear someone racing up the stairs. “Quick, through here!” You grab Sophie and head for the other doorway in the bathroom.\n\nThe door leads into a very gothic master bedroom. Everything is covered in black and wine colored velvet.\n\n“Uh, oh…” You have made a wrong turn into hell. Seething at you from the corner is presumably Mrs. Alexander. Her red hair flies out like flames as she jumps and you and Sophie, slashing at you with her knife again and again. You and Sophie are too startled to fight back, and you are cut to ribbons.\n\nWell, maybe it’s Karma for leaving Vera to die.\n\nTHE END", "action_results": []}]}, {"action": "Don’t trust her. Run the other way.", "result": "“She’s probably going to lead us right to him,” you mutter to Sophie. “Let’s go the other way.”\n\n“But…” the maid sputters.\n\nYou ignore her and head for the kitchen.\n\nPushing through the door angrily, you tell Sophie, “We can’t trust anyone in this place, I don’t know what I was doing asking her for help. Look, we’re in a kitchen, let’s find knives, and then we’ll…”\n\nYou don’t get a chance to finish that sentence, as instead of you finding a knife, a knife finds you, square in the back. As you bleed to death on the Italian tile floor and watch some red-headed woman butcher your best friend, you wish you had trusted that meek little maid. Maybe you wouldn’t have met -\n\nTHE END", "action_results": []}]}]}, {"action": "Hasten up the staircase.", "result": "You run full speed up the staircase. Running into pitch blackness, you never realize what it is that barrels into you and sends you tumbling back down the stairs, instantly breaking your neck.\n\nToo bad.", "action_results": []}]}, {"action": "Risk it and go to the right door.", "result": "You decide to risk it and run for the door on your right.\n\nYou duck to the right, hurdling over a beige wicker chair - but not quite clearing it. Your foot catches in the armrest and you fall to the ground with a crash.\n\n“Damn! Owww…” you moan your chest hits the floor with a painful THUD.\n\nYou struggle to get to your feet, turning your head just in time to see Sophie fleeing out the left side door - and to feel the cold sting of a hypodermic needle….", "action_results": [{"action": "Black out....", "result": "You come back to consciousness what seems like centuries later in a damp, foul smelling room. Really foul smelling. It’s like the worst thing you’ve ever smelled. You move your body slowly, because you have a massive headache from whatever knocked you out. Groggy and nauseated, you pull yourself up to figure out where you are.\n\nIt seems to be what used to be a bathroom. It’s pretty large for a bathroom. There are two doors, one on each side. You stumble painfully first to one, then the other, but they are both locked.\n\nGod, what is that horrible smell? you think. You stagger across the stained white tile floor as if in a trance to the bathtub. The curtain is pulled around it, but you just can’t resist… you pull it back.\n\n“Jesus Christ!” You lurch back violently, your stomach flipping in your stomach. There what used to be a young woman, who has obviously been gutted and dead for quite some time. You yank back the curtain and tumble back to the other side of the bathroom. As you sink to the floor, your shirt rises up.\n\nLooking down, you see purple markings on your stomach. Horrified, you realize they are the same kind of markings your sister had on her when she had to have her appendix removed. But you’re not in a hospital. Is this what happened to the girl in the tub?\n\nI gotta get out of her, NOW, your brain screams. You go for the door on your right and thrash against it with all of your might. You can hear the door breaking on its hinges, but at the same time you hear a noise at the other door.\n\nDecision time.", "action_results": [{"action": "Hit as hard as you can and get the hell out of this room.", "result": "No time to fool around! You’re getting out of here now. You give the door one last charge and it gives way. You rush through the door and into a bedroom. Gotta get out of here. There is only one door and you run for it. It’s unlocked and you hurdle out into a hallway.", "action_results": [{"action": "Run for the right.", "result": "You run to the right. Unfortunately, right as you turn, the door across the hall opens and you run smack into an insane looking red headed woman in a black bathrobe. She just smiles at you, grabs you by the hair, and stabs you in the back.\n\nOuch. Maybe you should have just stayed put and waited for your “surgery”. At least you might have gotten anesthesia before they cut….\n\nToo late for regrets, this is\n\nTHE END", "action_results": []}, {"action": "Go to the left.", "result": "You run for the left. You see many doorways down the hallway, but you’re not stopping yet. When you see a slightly ajar doorway on your left, you duck in and try to hide.\n\nThis room seems to be a small bedroom. However, it’s filled with all sorts of strange books. There are also symbols drawn on the wall. You hurry and squeeze yourself behind a dilapidated old bed.\n\nYour heart is racing. Are you going to be found? You wait for what seems like forever, but no one comes.\n\nRight by your foot is a large arcane looking text. Curious, you reach out and flip it open. It fall naturally to a page about ancient fertility ceremonies. You read on. It seems in medieval times, queens who could not bear children would make sacrifices of local young women to the fertility gods. It also goes on to say that eating the reproductive organs of these sacrifices would further enhance fertility.\n\nYou shudder with the realization that THIS is what’s going on in this house. Mr. Alexander must really believe this junk will work for his wife.\n\nWell, you are NOT going to be the next sacrifice. You stand yourself up. You look around the room, and see some sort of metal cane leaning up against the door. You grasp it firmly and head out the door. You’re ready to fight back against anyone who thinks they’re gonna cut you up.\n\nYou head out into the hallway. There’s no one there. Walking back the way you came, you notice that the staircase leading down is right nearby. In your haste you must not have seen it before. As you put your hand on the barrister and prepare to head down, you notice the room in front of you is glowing through the door jamb.\n\nYou still don’t know where Sophie is. They might be holding her captive. You could just go down the stairs and bash your way out of the house… but is Sophie going to be okay?", "action_results": [{"action": "Look for Sophie in the glowing room.", "result": "You’re not leaving without your best friend. You carefully push open the door.\n\nYou’re now in a bathroom, which used to be a really deluxe place, but looks kind of ratty now. You realize the glow is actually coming from the next room.\n\nWalking as quietly as you can, you creep through the bathroom, gripping the cane tightly. You slowly open the door…..\n\nThis must be the master bedroom. It’s covered from head to toe in black and wine-colored velvet. The Alexanders must be goth, you think.\n\nYou hear a hiss, and turn your head sharply to the right. It’s the woman from the photograph, but she looks pretty crazy now. She’s also got Sophie by the hair with a butcher knife at her throat! Sophie’s eyes are pleading at you.\n\nWhat do you do?", "action_results": [{"action": "Try to reason with the woman.", "result": "“Look, lady,” you say. “I don’t know what’s going on here, but we don’t want any part. Now just drop the knife, you don’t want to kill anyone, right?”\n\nWrong. With anger burning in her eyes she slits Sophie’s throat. Sophie gurgles and falls to the floor.\n\nOh shit. You messed up. Just then, Mr. Alexander comes in from behind and grabs you, forcing you to drop the cane. While he holds your arms, Mrs. Alexander advances upon you with the knife, still wet with your best friend’s blood.\n\nWell, I guess you’ll be blood sisters now….\n\nTHE END", "action_results": []}, {"action": "Distract her into moving the knife away from Sophie, and go for the attack.", "result": "“Hey lady, I was reading your books, and apparently you’re doing this ritual thing all wrong!” you blurt out at her.\n\nApparently it worked. Mrs. Alexander cocks her head at your angrily, but at the same time her wrist falls and the knife moves away from Sophie’s throat. You charge forward with the cane and smash her full force across the face. Sophie pulls free as the woman falls in a heap on the floor.\n\nYou quickly hug Sophie. “Let’s get out of here!” you cry. The two of you dash through the bathroom and down the stairs. As you hurdle down the stairs, you see the maid standing at the bottom, looking up with a frightened look on her face.\n\n“Let us out of here, NOW!” you scream at her. She nods, shaking violently all the while, and fishes in her pocket for the key. She hands it to you and you unlock the door, and the three of you run to freedom.\n\nMr. and Mrs. Alexander were arrested and charged with over 30 counts of murder. They had been killing and “harvesting” young women for almost a decade. Mrs. Alexander had had several severely deformed children, which were found living in the house, being treated no better than animals. Apparently they were doing the rituals in an attempt to have a perfect child. A DNA test requested by the court showed the reason - they were half-brother and sister.\n\nVera (the maid) is currently doing the round of talk shows. She’ll be on Montel this week. The title of the show is “My life in Hell House.”\n\nYou and Sophie bought a very nice place in another town with the money you got from doing interviews. You’ll never have to clean another house again.\n\n\nAnd that’s a good ending.\n\nTHE END", "action_results": []}]}, {"action": "Head down the stairs. You’ll send help later...", "result": "Sophie is a smart girl, you think. I’m sure she can survive long enough for me to come back with the police. Besides, I’ve gotta look out for myself.\n\nYou rush down the stairs, and run straight into Mr. Alexander. He greets you with a quick twist of his scalpel.\n\nMaybe you shouldn’t have been so selfish.\n\nTHE END", "action_results": []}]}]}, {"action": "Find a weapon and face whoever is at the other door.", "result": "Your eyes sweep the room for a weapon of some sort. The best thing you can find is a plunger behind the toilet. Better than nothing, you think, and grab it.\n\nYou arm yourself with the plunger and prepare to face ….\n\nThe door swings open…\n\n“Sophie!” you cry.\n\nThe two of you hug each other. “I was so worried about you!” she exclaims.\n\n“We’ve gotta get out of here,” you tell her. “There’s another body in here, and I think they plan to do the same to us.”\n\nSophie grabs your wrist and starts pulling you out of the room, and into a bedroom. As the two of you move, she says, “Yeah, I know. I’ve been looking all over this house for you and I overheard Mr. Alexander talking. Apparently they do some sort of weird rituals to get Mrs. Alexander to have a healthy baby. It has to do with eating organs of young women!”\n\nYou shiver as the two of you rush down the hallway. “Oh, yuck!”\n\nJust then, you hear someone on the stairs. You and Sophie rush past the stairs and into a room.\n\nThis is some sort of large bonus room. There are stairs going down into a play area of sorts. There are bunkbeds, toys and other things. It appears to be set up for many children, but you don’t see any. This must have something to do with the rituals.\n\nYou and Sophie rush down the mini staircase and look for a place to hide.\n\nYou scurry behind a bookshelf. Sophie squeezes in next to you.\n\nYou hear footsteps, followed by voices. They get louder and come into earshot.\n\n“I don’t really care, Vera! You find those girls and get them to me!” You wince as you hear Mr. Alexander referring to you and Sophie.\n\nThe reply is too soft for you to hear, but you hear a scuffling noise and Mr. Alexander hisses, “Or, we could just use you…” You hear Vera whimper back something unintelligible.\n\nThe two of them then move away, down the hall. After it has been silent for a few moments, you start to creep out from behind the bookshelf. But as you are feeling your way out, your elbow bumps into a small indentation in the wall. Much to your surprise, the wall opens up into a dark, foul smelling room.\n\nYou stumble back, choking on the smell.\n\nJust then, you hear a small voice coming out of the darkness. “Helloooo…” it calls.\n\nWhat do you do?", "action_results": [{"action": "Answer the voice.", "result": "“Hello?” you tentatively call back. “Who’s there?”\n\nA small figure lurches out slowly from the shadows. You start, but stay where you are. The figure stops just on the edge of the light, so that you cannot see it fully.\n\n“Have you come to help?” the voice asks. You realize now that this is a child. You are filled with pity.\n\n“Yes, yes, we’ve come to help you!” you answer. “Are you hurt?”\n\n“Yes…” the voice answers. “I’ve been hurt a long time….”\n\nAnd with that, the child steps into the light. It is horribly deformed, with large cysts on its face and chest. It does not have much hair and its mouth is malformed, twisted into a painful little bow.\n\nYou gasp and ….", "action_results": [{"action": "Run for the door.", "result": "You are disgusted and you run, stumbling over Sophie, to the door. You run as fast as your legs will take you, hurdling down the hallway. Just as you reach the end, a woman steps out from a doorway. You scream and stop! She has red hair and is wearing a black bathrobe, and she doesn’t look friendly. You guess this from the 10-inch butcher knife she is wielding. Her eyes widen in a maniacal way as she advances. You turn on your heels to run in the opposite direction, but standing right behind you is Mr. Alexander, not looking too friendly himself. He grabs you roughly, pinning your arms behind your back.\n\n“How long are you going to run around this house?” he asks tensely. You feel a sharp sting, and then a prolonged burn. Not again… “Did you ever really think you could get away? It’s our house after all…” His voice drifts off into the darkness as you sink into unconsciousness.\n\nBut this time you never wake up! No chance to escape this time. Guess you died on the operating table. What a pity.\n\nTHE END", "action_results": []}]}]}]}]}, {"action": "Grab a chair and break a window.", "result": "You seize the nearest iron chair and with all your might, hurl it through the window. Glass flies everywhere, and you cover your face and leap through the window. “Augh!” You graze your arms and legs badly, and blood is streaming everywhere.\n\nYou and Sophie run through the garden. Mr. Alexander is not far behind, but all you need to do is get out in the open and scream for help….\n\nYou rush past overgrown hedges, dead tomato plants, and withered roses. You are almost to the edge of the garden….\n\nUnfortunately, what looked like an overgrown border is actually a heavy iron fence covered in ivy. You slam into in with full force. You scrabble to climb over it, but it is too late. Mr. Alexander is right there. He grabs your wrist and spins you around. Sophie huddles in terror next to you.\n\n“Girls, girls! Why all the running? You can never escape me. You two have a little appointment with my wife. She‘s hungry again….”\n\nAs he smiles cruelly into your face, you know this is\n\nTHE END", "action_results": []}]}, {"action": "A door is a door. Try the second one.", "result": "“We’re never gonna find a key,” you hiss at her. “That’s just in books! This is real life, and I don’t care where it leads, as long as it’s outta here!” You grasp the handle and turn it.\n\n“Uh ohh…” Sophie’s voice trails off weakly. “What is it?” you ask impatiently, following her gaze to the ground, where you see.. a dark red substance in a pool by the wall.\n\n“What the…” you wonder and you approach the wall. “Don’t…” Sophie protests feebly. You touch the wall, which to your surprise and amazement, pops open with such force it makes you jump back. And out of the hidden compartment falls a badly mutilated body!\n\n“Urgg… I’m gonna be sick…” Sophie chokes and coughs.\n\n“What the hell is this…??” you wonder out loud.\n\n“Well, I don’t wanna find out. Let’s just get the fuck out of here!” Sophie cries.\n\nJust then, you hear the doorknob of the locked door rattle. You look at each other and then the two of you hurdle through the other door as fast as you can. You rush through a dusty breakfast room and into a hallway.\n\nRushing down the hallway, you can see up ahead that it branches in 3 directions. To the right is a dark corridor. To the left is a relatively well lit hallway. Straight ahead is an open door, through which you can see a piano. Which way do you choose?", "action_results": [{"action": "Down the dark corridor to the right.", "result": "Maybe it’s not the best decision to go into this dark, foreboding chamber; but you don’t have much time to think through your decision. You pull Sophie by the wrist off to the right and hurry down the dark passageway.\n\nThe walls of the passageway are made of dark stones. The air is damp and cool. You hurry several yards before coming upon a heavy wooden door. You quickly twist the iron handle and go through, letting the door close soundlessly behind you.\n\nThe second the door shuts, it is pitch black in the room. You tentatively reach for the door handle, but there is none. The door only opened on the other side, you realize. Your heart sinks into your stomach.\n\n“Oh man, maybe we shouldn’t have come this way…” Sophie whispers to you. You can tell by the tone of her voice that she is very scared.\n\nThe two of you feel your way along the room, moving your hands over the cold, slimy walls.\n\nJust then, you hear someone or something moving to your right.", "action_results": [{"action": "Move quickly to the left.", "result": "You move as fast as you can through the darkness, away from the sound. It’s probably a rat or something worse. Sophie is right behind you as you hurry through the damp dungeon.\n\nYou gasp as your foot catches on a loose stone in the floor. You fall heavily, pitching forward into a deep pit. You hit your head and black out.\n\nWhen you come to, you are still in darkness. Sophie is nowhere to be found. You scramble around the pit, trying to feel for any possibility for escape. There is none.\n\nTHE END", "action_results": []}, {"action": "Investigate the sound.", "result": "You cautiously move towards the source of the sound. “Who’s there?!” you ask sharply.\n\nThe shuffling sound stops abruptly. You hear a soft gasp. “Oh, thank goodness!” the voice says. The person moves closer. A soft green light suddenly illuminates the figure of a girl about 13 years old, who is squeezing the indiglo light of her wrist watch. She is Asian, with wispy black short hair. Her face looks dirty and haggard.\n\n“I’m Erika,” the girl says. “I’ve been in here for 3 days now. I was called here to pet-sit, but I soon learned that was just a trick. Mr. Alexander nearly killed me, but then his wife said something about me being ’unsuitable’, and then he threw me in here.”\n\n“We’re in a similar situation,” you say, and tell Erika about how you and Sophie came to be where you are.\n\n“I don’t know what’s going on here, but it’s something horrible,” Erika says when you are done. “Listen, I think I found a way out. I’ve been pushing some loose bricks, but I’m pretty exhausted from not eating, so I can’t move them anymore.” Just then her stomach growls loudly, and she smiles weakly.\n\nYou and Sophie move to the place she was talking about and start moving bricks. It only takes a few minutes of the two of you lifting to make a big enough hole in the wall. You, Sophie and Erika quickly squeeze through the tunnel. To your relief, it surfaces at a sewer grate out on the road, and the three of you hurry to your car.\n\nYou go to the police, and even though at first they are doubtful, they finally believe your wild story and go to the house to investigate. They find it in blazes. The fire department struggles to subdue the flames. The house is eventually completely destroyed. Search crews later find dozens of burned bodies and human remains, and strange occult paraphernalia.\n\nYou, Sophie and Erika sell the rights to the story and it is quickly made into a horror movie. You never really understand what really was going on in the mansion, but it doesn’t matter. You are now safe, and a millionaire!\n\nTHE END", "action_results": []}]}, {"action": "Off to the left.", "result": "Oh! It's the front hallway. \"Dammit!\" you shout. \"We've already been here!\" You're feeling kind of lucky though, and you rush for the front door and snatch at the knob quickly. To your utter amazement, it opens!\n\nYou and Sophie run out as fast as you can, all the way down the driveway, and jump into your car. You peel out of the driveway.\n\n\nWhen you're a couple miles down the road, your muscles finally relax, and you slump down in the drivers seat with a sigh. \"What just happened back there?\" you ask, casting your glance over at Sophie.\n\n\nYou tense back up when you see the blood soaking the front of her shirt. It's apparently coming from the huge gash across her throat. Paralyzed with fear, you look in your rearview mirror - and all you see is a glimpse of red hair and a flash of silver knife before your own throat is cut.", "action_results": []}, {"action": "Continue straight into the room.", "result": "Uh oh! Too bad you couldn't see the rottweiler sleeping UNDER the piano. Well, you sure got a good look at him when he was ripping your face off.", "action_results": []}]}]}, {"action": "\"I'm sorry, but we'd rather just leave.\"", "result": "“I’m sorry, Mr. Alexander, but we’ve changed our minds.” you say. “We’d really rather not. But the door seems to be locked. Could you please show us the way out?”\n\nMr. Alexander’s brow furrows into a frown. “Really, I think that’s quite unprofessional, ladies. You agreed to help us.”\n\nSophie appears to be embarrassed. “No, of course we’re not unprofessional, Mr. Alexander. We’ll do what we came to do. Now could we see the list of tasks?”\n\nMr. Alexander’s mood sees to have improved. “Yes, of course. Just come with me upstairs.”\n\nYou’ve got doubts, but Sophie is right on his heels as he heads out of the room. So you shrug and follow as well.\n\nThe three of you head up the stairs. At the top, Mr. Alexander motions for you to go through a door. You and Sophie oblige.\n\nBut as soon as you step across the threshold, Mr. Alexander fiercely slams the door.\n\nYou hear the lock click. “Damn!” you cry out. “What the hell is going on?”\n\n“I’m sorry Alex!” Sophie whines. “I’m so stupid! I followed him because I was afraid he would give us a bad rep around town! Now I’ve totally screwed us!!”\n\nYou’re not really worried about your reputation right now. As your eyes adjust to the seamy yellow light of your prison, you realize you’re not alone.\n\nA red-headed woman in a black bathrobe stands menacingly just a few feet away. She holds a large butcher knife, and she starts to approach.\n\n“Oh my God!” Sophie screams and begins to bang on the door.\n\nYou’ve got to do something fast.", "action_results": [{"action": "Try to talk to the woman.", "result": "“Uh, hey, we don’t want any trouble! There must be some mistake!” you splutter.\n\nWell, she doesn’t seem to care if you want trouble or not. She lunges at you with the knife and deeply grazes your shoulder. Blood spurts everywhere. Sophie is screaming at the top of her lungs. The woman soon silences that with a quick slash to her throat.\n\nLooks like talk got you nowhere. Maybe next time you should fight back.\n\nFor now, this is\n\nTHE END", "action_results": []}, {"action": "Look for something to fight her off with.", "result": "You take a quick look around for a weapon. You grab a candle stick from the dresser and hurl it at the woman. It hits her right in the side of the head and she is momentarily stunned.\n\nYou grab Sophie and run for the door on the other side of the room. It’s locked, but you push against it with all your might and it gives way.\n\nYou and Sophie hurdle through the next room, which is a foul smelling bathroom. You flee through that and into another bedroom. You exit through the only door and veer off to the right.\n\nMr. Alexander stops you dead in your tracks, and, well, stops you dead.", "action_results": []}]}]}, {"action": "Look for her through the lounge.", "result": "“Um, let’s go through here.” You motion to the left, through a glossy looking lounge with a wet bar.\n\nSophie follows warily. “Are you sure she went this way?” she asked you, as you tread softly over oriental rugs, and into a lush and tasteful dining room. “I swear I saw her go…”\n\nJust then you hush her. “I hear someone in the next room,” you whisper.\n\n“Why are you whispering?” she whispers back.\n\n“Gosh, I don’t know. I felt kind of weird creeping through this house. Let’s just go ask whoever’s in there if they can unlock the front door.”\n\nYou push through the swinging door. It’s a kitchen, dressed up with chrome everything. It’s not very well lit, and the only light is the pale rays streaming through curtains near the sink. And standing in front of that sink, facing away from you, is a woman. She has her red hair pulled back in a loose ponytail, and she is wearing a black bath robe.\n\n“Excuse me,” you clear your throat. “But we’re the cleaners that were hired, and well, I just remembered I left all my vacuum bags at home, so we really need to be going.”\n\nNothing. The woman is silent. All that can be heard in the room is the soft ping of water dripping into the chrome sink basin.\n\n“Uh, hello…?” Sophie calls. “Excuse me…”\n\nThe woman turns around on you sharply.\n\n“Good god!” You choke out. Sophie grips onto your arm. The woman stares menacingly at you, her face a chilling mask of malevolence and rage. She grasps a large butcher knife in her hands, and is almost smiling in an insane way as she advances upon you.\n\n“What the hell?!?!” You and Sophie tear back out of the kitchen the way you came. As you run through the dining room, Sophie asks, terrified “What is going on?”\n\nYou reply, breathlessly, “I don’t really know” through the lounge you run, and into the foyer. You jerk frantically on the front door, but it’s still locked!! You glance fearfully over your shoulder to see if you have company coming… but surprisingly, there is no one there.\n\nYou look at Sophie. “What should we do? We’re locked in here with some crazy woman!” she sobs.\n\n“Okay, let’s just not panic. We’ll just find a phone, or a sane person, and get the hell out of here,” you tell her.\n\n“What should we do, Alex? Should we…”", "action_results": [{"action": "\"Try going up the stairs?\"", "result": "“We’re going upstairs,” you tell Sophie. “There’s probably a phone in a bedroom upstairs.”\n\nYou head cautiously up the stairs into darkness. Maybe this wasn’t such a good idea. That woman might follow you and corner you. You just try to swallow your fear and keep moving.\n\nYou open the first door you see. It’s a bath room.\n\nYou look at Sophie. “Better keep moving,” she whispers.\n\nThe next door, on the right, is a bedroom of some sorts. You both enter and glance around for a phone. Nothing there. You both exit and go the opposite way down the hall.\n\nThere is a door decorated with pictures of balloons and flowers. “Okay, this looks relatively safe. It’s the tamest thing I’ve seen so far.” You enter and look around.\n\nIt appears to be a children’s bedroom. The two of you search around for a phone. You are looking in a back corner, when you hear a loud moan through the wall. “Huh?” you say. You touch the wall, and to your surprise it opens like a door. You peek inside in the darkness.\n\nThe moan comes again, this time louder. You are startled, but you keep looking inside. As your eyes adjust to the darkness of the crawl space, you see what is moaning. It’s some sort of person, but it is extremely deformed. Its eyes loll at you and it moans again.\n\nSophie stifles a scream. “What is it?” she cries.\n\n“I don’t know, “ you say. But somehow you are brought to pity for this creature. As you slowly step forward, you notice there are at least two similar creatures in the room. They lay on soiled mattresses, moaning in pain. As you look closer, you realize by their small sizes that they are probably children.\n\n“Good God, how can they be keeping these children like this?” you cry out.\n\n“It’s really none of your damn business-” you hear suddenly from the doorway. You whirl around and it is a tall man with dark hair. You recognize his voice as Mr. Alexander, the owner of the house and man who called you for the job.\n\n“What’s going on here?” Sophie cries. “We were chased up here by some lady with a knife. Look, we just want to leave!”\n\n“I’m afraid it won’t be that easy,” Mr. Alexander says grimly. “You see, my wife needs something you have. You see these… creatures? These are our failures. My wife and I deserve to have a normal baby, not these horrible freaks. So, my wife just needs to perform a little ritual on you to harvest your young energy.”\n\nSophie is cowering next to you. What do you do?", "action_results": [{"action": "Fight off the man.", "result": "You fling yourself at the man. There’s no way you’re going down without a fight! You pummel his face.\n\nUnfortunately, Sophie has not joined in this attack. She apparently fled, thinking you’d gone crazy too.\n\nSo, Mr. Alexander quickly overpowers you. Maybe it wasn’t a good idea to throw yourself at someone who’s so much bigger than you….\n\nTHE END", "action_results": []}, {"action": "Look for another exit.", "result": "“Not in this lifetime, buddy!” you shout and run the opposite direction, with Sophie close at your heels.\n\nYou tumble through a door into a game room of sorts. You exit quickly and find yourself running down a long hallway.\n\n“Okay, these people are extremely bad news!” Sophie yells as you run.\n\nThe two of you hurdle around the corner of the hallway, only to find yourself face to face with what must be Mrs. Alexander, the lady in the bathrobe!\n\nShe grins at you, her knife gleaming in the pale hall light.\n\nBut you are too pumped up after all you have seen. You and Sophie charge right past her. She manages to swipe at you with the knife, cutting your arm deeply, but you keep running as fast as you can. The two of you can see the staircase, and you tumble down as fast as you can.\n\nTo your astonishment, the front door is now wide open. The maid is holding it open, staring up at you in surprise, and standing at the door is your friend Jonathan holding a paper bag!\n\n“Hey, I just saw your car and thought I’d bring you some…” he stops in midsentence as he sees the blood gushing from your arm. “What the hell…?”\n\n“No time!” you scream. “Just run!”\n\nYou and Sophie run out the door with Jonathan.\n\nThe three of you drive to the police station, and though they struggle to understand at first, the police go to the mansion. You later hear than in all their years at the force they had never seen such awful things like what were in that house.\n\nYou managed to get out alive, but the memories of those children haunt you. How anyone could treat their children like that, deformed or not, you will never understand. You change your major to pre-med so that you can help children.\n\nTHE END", "action_results": []}]}, {"action": "\"Try going into the sitting room?\"", "result": "“Let’s go back into the sitting room. There’s probably a phone, or the maid might be back,” you tell Sophie.\n\nThe two of you walk into the sitting room. You jump as a roll of thunder rips through the room. Looking to your right out the heavily barred windows, you can see it has started to rain. As clouds move over the house, the room slowly darkens.\n\n“Ooh, I don’t like this,” Sophie shivers.\n\nThe two of you search around for a phone. You can’t find one, so you and Sophie head into the next room.\n\nYou push on the heavy oak swinging door. It moves open with a low groan, and you enter a dim living room. You look over at a low table in the corner, and your eyes fix on the desired object on the desired object - a telephone! You rush over and grab the receiver excitedly. Putting it to your ear, you start to dial - but-\n\n“There’s no dial tone…” you tell Sophie. She looks at you sadly, and tries the phone for herself. “Nothing,” she whimpers.\n\n“Hey, look at this…” you say. There is a small phone book. Filed between the pages are strips of newspaper. You pull one out. It’s a very faded line of “help offered” ads. You read a few which a circled. “Education student seeks part-time nanny position” “We will walk your dog! Call Jane and Katie.”\nYou pull out another strip. It is personal ads. There are three circled. “SWF, 24, pretty n’ plump, seeks soul mate” “SBF, 22, loves red wine and Scrabble” “SWF, 19, N/S, N/D. I love everything. Let’s meet!” You pull out yet another cutting. This is newer. Your eyes scan down, and you recognize the ad that you and Sophie placed. It is circled in magic marker. Sophie, who has been reading along, says “What do these mean?”\n\nYou stand up. “Well, either there’s a lonely guy, who wants a nanny and dog walker, livign here, or something really wrong is going on. I think we sh - “\n\nYou stop and whirl around as you hear the door groaning softly. Through the dusty light of the room, you see a tall, well groomed man with black hair. He is smiling at you, his brows knit, and inquiry on his lips.\n\nSophie stands up hurriedly. “Excuse me - I’m sorry, but we really need to be going and…”\n\nHe approaches, a comforting smile on his face. “I’m very sorry,” he says warmly. “I think you might have run into my wife in the kitchen.” You and Sophie look at each other, remembering the knife-wielding maniac. He continues. “She’s been ill lately. I’m sorry she turned on you with the knife. You surprised her while she was cooking. She’s gone back to bed. I promise you she won’t be a problem.” He smiles again, his white teeth sparkling. “I’m sorry, we haven’t been introduced. I’m Mr. Alexander, the owner of the house. You’re Sophie and Alex, right? Pleased to meet you. Let’s just get you the list of tasks ans you can get started.”\n\nYou bite your lip. His story is kind of plausible, but you’re still troubled.\n\nWhat do you do?", "action_results": [{"action": "Run!", "result": "You see that he left the living room door open. You grab Sophie’s wrist and you run for the door. Mr. Alexander quickly makes his move and grabs the two of you by the collars.\n\n“So, we’re going to play it the hard way, huh?” he hisses into your ear. “Fine. But you’ll wish you cooperated…”\n\nSuddenly he makes a choking noise and lets you go. You make no hesitation, and you dart out the door.\n\nAs you and Sophie hurdle through the sitting room and up the staircase, you ask her, “What just happened? Why did he let us go?”\n\n“I kicked him in the nuts,” Sophie replies.\n\n“Oh,” you say. The two of you look for a hiding place upstairs. You see a room that looks like a children’s playroom, so you hurry in there seeking shelter.\n\nYou decide to hide behind a large bookshelf. But as you are climbing behind it, you bump into the wall. To your surprise, the paneling opens inward into a dark, foul smelling room.\n\n“What is this?” Sophie asks you.\n\n“Something else weird, I suppose…” you choke, gagging on the smell coming from the room.\n\nJust then, a small voice floats out of the darkness. “hello?”\n\nWhat do you do?", "action_results": [null]}]}]}]}, {"action": "\"No, we need this money. We’re staying.\"", "result": "“I know, Sophie, I’m a little freaked out too. But come on, it’s a pretty old house, and old houses make noise sometimes. Besides,” you smile at her, “the huge party we’re going to have with these profits is way gonna be worth it.”\n\nShe smiles back, though a little uneasy. “Well, if you say so. Just, where is that girl? We’ve been waiting forever.”\n\nJust then, the door the girl left from slowly opens….\n\nYou turn sharply and in the doorway is a man. He is very handsome, tall with slicked back black hair. He smiles at the two of you.\n\n“Uh, hi.” Sophie stammers. “We’re, uh, the cleaners that were called. Um, the girl who let us in has been gone for a while so….”\n\n“I’m so sorry. I‘m Mr. Alexander, the owner of the house.” The man’s voice is deep and rich. “Come with me.” He motions for you to follow him through the doorway he is standing by. The two of you follow him into a living room, and through there into a study.", "action_results": [null, null]}]}]}]}