{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=36396", "context": "", "first_story_block": "The letter was hand delivered but you didn't see by whom and it was certainly after the last post would have been delivered.  Checking your pocket watch you notice it's much later than you realised and it is fast approaching midnight; this was something which happened all to often when your head is buried in your studies.  You turn the letter over and you see that it was sealed with a purple wax seal you don't recognise.  The insignia is a large letter G with what looks like a tentacle wrapping itself about the letter.  Your name is written in neat letter across the front, with such precision that you could almost believe it was done with a printing press but the strokes of the fountain pen are detectable enough that this was certainly written by hand.\n\n\nYou don't often receive unexpected correspondence and when you do, it's usually a bill you managed to forget would be due; your head is usually so caught up in your studies that it's easy to forget these day-to-day trivialities.\n\n\nThere's something about this letter which sets you on edge and you can't quite put your finger on why you feel so uneasy about opening it.  You hold it up to one of the candles you have burning by your desk.  You can't tell much more than you could before but it seems like there is a letter inside and perhaps that's the edge of a watermark you can see on the envelope.  You don't think you've ever been sent correspondence in a watermarked envelope before and that uneasy feeling isn't getting any better.\n\n\nWhat do you do with the letter?", "action_results": [{"action": "Open it straight away.", "result": "You take the letter to your desk, your fingers tingling slightly where they touch the paper.  Perhaps you're just being paranoid, it is getting late and it's probably just your imagination anyway.  You break the seal of the letter and what feels like a train hits you in the face and you go flying across the room before everything goes black.\n\n\n......\n\n\nYou can hear a woman's voice saying your name and you gradually realise that it's your mentor.  She's shaking you by the shoulders and sounds different, she sounds scared.  You force one eye open, if only to stop the shaking and she collapses with what looks like relief.  You open both eyes and take in your surroundings.\n\n\nYou're at the far side of the work room as your mentor calls it (the laboratory as you prefer) and you can see your desk over on the other side.  All around you are broken bottles, spilled liquids, squashed boxes and even a shelf lying on the floor, its contents smashed and ruined.  As you become fully conscious again your back tells you that you must have hit that hard and your nose feels like it's twice the size it should be.  You raise a hand to your face to feel the damage and your arm protests with a sharp pain; you look down to see a shard of glass from what was probably a bottle sticking out through the arm of your robes.\n\n\n\"What...\" you mumble groggily, \"what happened?\"\n\n\n\"I was hoping you'd be able to tell me.\" said your mentor, not unkindly but there was a note to her voice which you knew meant that she wasn't happy, and no wonder with the destruction in the laboratory.\n\n\n\"The letter.\" you manage to say, remembering now what had happened.  \"Where's the letter?\"\n\n\n\"Letter?\" asked your mentor.  She looked around and saw the innocuous looking envelope on the stone floor near the desk.  \"I see it.\" she said, \"Is it important?\"\n\n\n\"Did this.\" you manage to say, though every word causes agony in your face.\n\n\n\"Really? A letter managed to do this?\" asked your mentor, suddenly sounding less annoyed and more intrigued.  \"That is most unusual, I wonder what was used.\" she muttered as she made her way across the room to pick up the letter from the floor.\n\n\n\"No!\" you cry, \"Don't touch it!\".  But your mentor already had it in her hands and was turning the envelope over with a look of fascination on her face.\n\n\n\"How interesting.\" she said, now completely absorbed in examining the envelope and seeming to have forgotten about your fragile state entirely.  \"What did you do to trigger the attack?\"\n\n\n\"I just opened it.\" you reply, \"I haven't even seen what's inside yet.\"  You grab a piece of cloth from under the fallen shelf next to you and tie it around your arm as tightly as you can, above where the glass shard is sticking out from your robes.  \"Any chance of a hand here?\" you ask as you contemplate pulling the glass out of your arm and you're not sure you can bring yourself to do it on your own.\n\n\n\"Hmm?\" she responded glancing up at you.  \"Oh yes, of course, I do apologise, this is just so, interesting.\"  She still had hold of the letter as she moved across the room to you.\n\n\n\"Can you just grab this and pull?\" you ask, grimacing already at the thought.\n\n\n\"Is that safe?\" your mentor asks.\n\n\n\"We'll find out.\" you whimper as you screw up your face and brace yourself for the pain.\n\n\n \n\nYour mentor puts a piece of cloth over the glass, plants her foot on the floor, grips the shard of glass and in one swift motion, pulls the glass clean out of your arm.\n\n\nThe pain is sharp and it feels like your whole arm is on fire, but you pull back your robe sleeve and wrap another cloth around the wound and the bleeding soon stops.\n\n\nOnce you've managed to extricate yourself from the furniture and your mentor has got you safely seated into your bed, you ask her for the letter.\n\n\nShe seems reluctant to hand it over to you, professional curiosity you suppose, but she knows she must and she hand the envelope to you, the weight of the wax seal causing the envelope to flap open.\n\n\nAs you open the envelope, you can see that the letter inside is acid green and you take the single piece of paper out of the envelope and open it up and read what it says.\n\n\n\n\n \n\n \n\n \n\n \n\n \n\n \n\nYour heart feels as though it has stopped and your breathing is halted.  Your sister, your baby sister.\n\n\nYour mentor asks \"What does it say?\" when she sees the look on your face and when you don't respond she takes the letter from your fingers as when she reads what it says for herself.  You hear her gasp when she sees it.\n\n\nYour brain starts to come to life again and you look at your mentor and as \"What time is it now?\".  It's only then that you realise that she isn't in her usual daytime attire, in which she would have her pocket watch always attached to her waistcoat.  She was in fact, in a nightgown and you blush and look away politely as the inappropriateness of seeing your mentor so attired strikes you.\n\n\n\"I believe it's around midnight.\" she replies, \"though I confess I don't know exactly.\"\n\n\nYou go to your desk and find the small clock you keep in the corner of it, behind a small stack of books and papers.  It was twenty minutes after midnight, and whomever had delivered this letter knew you had enough time to be able to get Langdown Hall but presumably delivered it so late so as to try to ensure you were alone, or dead if the magical booby trap was anything to go by.\n\n\nDo you go to Langdown Hall?", "action_results": [{"action": "Go to Langdown Hall but insist you go alone.", "result": "You pull up in the taxicab outside the gate to Langdown Hall.  You pay the driver and he leaves with the horses at a trot.  The gates look imposing as you stand there alone in the dark and start to question whether it was wise to follow the instructions of the letter and come alone as you have.\n\n\nYou push the gate to the grounds and it makes an eerie creak as it swings open.  You look around nervously, wondering if you're being watched, wondering if an ambush is laying in wait for you.\n\n\nYou step past the gate and onto the path which leads up to the grand, old stateky home.  The house had been without an occupant for a number of years after the family who owned it died out and the distant relative they left it to wasn't able to pay for its upkeep.  The stone of the building was black with ornate windows and rounded towers at the corners.  Everyone knew the building but there were varying reports of the size of it inside.  Whichever rumour you chose to believe though, the house was indisputably vast and imposing.\n\n\nYou reach the heavy, oaken front door and peer around you.  The sky is clear and the full moon is bright, lighting the grounds surrounding the house well, but also casting deep shadows.  You take a deep breath, grasp the large iron door knocker and slam it into the door three times.  The sound feels deafening in the silence of the night, but no other sound follows as you listen for a sign that someone heard your knocks.\n\n\nYou stand there, waiting for something to happen but nothing does.  Finally, you decided you're going to have to try the door.  You turn the handle and push the door and it opens with an ominous creak.\n\n\n\"Hello?\" you call as you enter the foyer.  Your hand is still on the door handle; having something solid in your hands and being connected to the exit makes going into the house a little less terrifying, though not by much.\n\n\nThe light from outside casts itself into the entrance hall enough for you to see a sweeping staircase leading to an upper floor.  Peering around, you also see there is a door to the side and underneath the stairs it looks as though there is a corridor leading further back into the house.\n\n\nSuddenly, the door is wrenched from your hand and closes with a slam, knocking you off balance and you fall into a small table by the wall, knocking it over and whatever was on it clattering to the floor.\n\n\nYou pat your hands around in the dark, trying to find the wall to help you to your feet, and as you do, your hand falls on something which must have been on the table.  You pick it up and wait for your eyes to adjust to the darkness.  It looks like a notebook.  Perhaps you'll be able to read it when you have light to see by again, for now, you place it in a pocket of your robes.\n\n\nYou get to your feet and call out into the house again \"Hello? I'm here. Amelia? Hello?\".  Your voice echoes a little in the grand house but there's no sign that anyone heard you.\n\n\nWhich way do you go?", "action_results": [{"action": "Go up the stairs.", "result": "You head back into the entrance hall with your candle held out in front of you.  You can see the table that you knocked over by the doorway lying on its side and as you look around the room you now notice that there is not only the door you had seen on the right hand side of the entrance hall as you came in but also another on the opposite side too.\n\n\nWhich way do you do?", "action_results": [{"action": "Go through the door on right.", "result": "You keep your hand on the wall as your make your way around the edge of the entrance hall until you reach the door at the side.  You try calling out \"Hello?\" one more time before you turn the handle and open the door.\n\n\nThe room has a large window at one end and the moonlight is illuminating enough of the room for you to make out that the walls are lined with shelves of books.  You step into the room and you're relieved this door hasn't closed behind you at least.\n\n\nYou walk up to the shelves nearest the window and you read some of the spines of the books.  They seem to be about various schools of thought regarding the magical arts and you even recognise some of them from your mentor's collection.  You pull one of the books out and it's covered with a layer of dust as thick as the leather cover.  You put it back on the shelf and cough in the cloud of dust you stirred up.\n\n\nOne of the books then catches your eye as it has some symbols on the spine which look very familiar.  You pull the letter out of your pocket and hold it up to the book.\n\n\n the book reads.\n\n\n \n\n the letter reads.\n\n\n \n\nAll three of the symbols on the book are clearly on the letter as well.  What can this book be you wonder to yourself.  You pick up the book and immediately notice that it is only covered in a very thin layer of dust, this book hasn't been here for very long.\n\n\nYou turn the book to face you and see that the cover is simply a huge eye with no further writing on it.  You turn to look around you and just as your eyes are leaving the book, you're sure that you see the eye blink!\n\n\nYou stare back at the book and the eye looks just as it had, an obvious painting of an eye and in no way a real one, but you're certain you saw it blink.\n\n\nWhat do you do with the book?", "action_results": [{"action": "Open the book and read it.", "result": "This book might hold answers about who has taken your sister and why.  You open the book and sit down on the floor, spreading the book open on the carpet in front of you in a patch of moonlight.\n\n\nAs you turn the pages you see that the writing is a mixture of what looks to be latin and many more of the same strange symbols.  At the centre of the book is a larger page which unfolds to show a drawing where the symbols feel like they're moving around the page and with an eye at the centre of it all.\n\n\nIt feels like the eye is boring into your very soul and you can't take your eyes away from it.  As you watch, the eye turns red and grows bigger.  You can hear it's voice now, speaking a language you don't understand and yet you somehow know what it is saying.  You belong to it now, you belong to this place and you were always destined to be.\n\n\n \n\nTHE END", "action_results": []}, {"action": "Put the book back on the shelf.", "result": "There's something about this book which gives you the chills.  You might find information inside it but something tells you that the cost of that information would be too great and it's an instinct you think it is wise to follow.\n\n\nYou go to put it back on the shelf and as you do, you hesitate, it feels as though the book wants you to read it. \"No.\" you tell the book firmly, and yourself as you return the book resolutely to the space on the shelf where you found it.  You take a few steps back from the shelf and turn away from it before you're tempted to go back and read it.\n\n\nYou walk across the room to a small table flanked by two chairs which has a chess board inlaid into the tabletop.  On the table is a small box, tied up with a ribbon and there is a tag attached to the ribbon.  You pick up the box and when you hold the tag to the light, you see that it has your name written on it.  You put the box quickly back onto the table and take a step back.\n\n\nYou crouch down so that your eyes are level with the table and you examine the box from what you hope is a safe distance.  It's a small box, about the size of your closed fist.  Whoever sent you that letter, knew that you'd be coming here and they obviously meant you ill judging by the trap which was contained in the letter.  This box might hold something equally, or more, terrible.  On the other hand, they wanted you to come here and they took your sister, or more importantly told you about the fact they took your sister, for a reason.\n\n\nWhat do you do with the box?", "action_results": [{"action": "Open the box.", "result": "Something nags at you that you need to see what is in this box.  It's been left there for you, it was intended for you to open it.  What if the box contains instructions for how to find your sister?  You have to know.\n\n\nYou step forwards and pick up the box again, ignoring the voice in your head telling you that this is a bad idea, this feels different to the book, this was meant for you to open.  You pull on the ribbon and it unties and falls to the floor.  You yank the lid of the box off as quickly as you are able, before you can change your mind.\n\n\nYou stare inside the box, this isn't what you expected, although you realise that a part of your feared it, you just didn't want to admit it.\n\n\nInside is a small finger, the size of a child's.  It was cut a little short of the knuckle, straight through the bone with a clean cut.  Next to the finger, coated in blood, is the ring you gave your little sister for her birthday last year, a silver snake eating its own tail in a neverending loop known as the ouroboros.\n\n\nYou let out a quiet whimper as you place the box carefully back on the table, pick up the lid which had fallen to the floor from your hand at some point and gently place it back onto the box.\n\n\nThis won't help you to find her, you have to focus on finding her and not let this distract you.  You use a meditative breathing technique you use for the spells you cast which need the most focus and push the box and it's dreadful contents from your mind and walk deeper into the library.", "action_results": [{"action": "Continue", "result": "As you walk further back into the darkness of the library, pushing thoughts of the box to the back of your mind, you notice that you can see the outline of door at the end of the room; there must be light in the next room which is seeping around the door to the library.  You take a big breath and walk towards the light.\n\n\nWhen you reach the outline of the what must be a door, it looks like just a continuation of the wood panelling on this side of the room, you never would have thought there was a door here if there hadn't have been light coming through from the other side.  You feel around the panel but there's no handle.  You start to feel along every crevasse of the panel, pushing and pulling, and suddenly, when you push into a section on the right-hand side, the door pushes in and pops out again and opens towards you.\n\n\nThe door leads to a small room which is brightly lit by several large lanterns.  You have to look away whilst you allow time for your eyes to adjust to the brightness of it.  When you're finally able to see properly, you take a proper look into the room.  The walls are painted white and there is a small black altar in the centre against the back wall of the tiny room.  There are many, many more of the kinds of symbols from the letter painted onto the altar with red paint, you hope it's red paint at least.\n\n\nThe only other thing in the room is on the wall above the altar and it was the first thing you saw when you opened the door.  There, hung in a frame, surrounded by more symbols, is a photograph of your sister from a couple of years ago when your parents hired a photographer for your grandmother's funeral.  She looks innocent and vulnerable and you shudder at thoughts of what they are doing to her right now and what greater purpose they have for taking her.\n\n\nYou stand there staring at your sister's photograph.  You don't remember when you last saw the photograph in your parents' house and you wonder if they took it from there when they took Amelia or earlier than that.  You finally snap out of it and slam the door closed, clicking it back into place.  You leave the library, more determined than ever to find your sister and put a stop to whatever the people who have taken her are up to.\n\n\nWhere do you want to go now?", "action_results": [null, {"action": "Go down the corridor underneath the stairs.", "result": "With no answer to your calls, you decide to venture deeper into the house.  You walk carefully across the open entrance hall, finding it harder and harder to see in the darkness of the house.  You reach the corridor which passes underneath the sweeping staircase and your leg brushes what feels like a table to your right.  You put your hand down to it and feel the edge of the table.\n\n\nAs you move your hand over the table you feel a box of matches.  You grab it quickly, push the tray and carefully take a match out.  You feel around the box for the strike strip and the match flares the life, temporarily blinding you as your eyes adjust to having light once more.\n\n\nYou hold the match out over the table and there is a candle in a holder.  You move the match to the wick before the flame reaches your fingers and the candle takes the flame.  You shake out the match before it burns you and drop it onto the table.  You pick up the candle and hold it up to the corridor in front of you.\n\n\nFor an instant in the darkness, you think you see a figure at the end of the corridor but as you focus you can clearly see there is no-one down there, it must have been a trick of the light, with all the shadows the candlelight was casting.\n\n\nYou can see now that there are two doors leading off from the corridor, one to the left and one to the right, and a half-open door at the end though the light doesn't cast far enough ahead yet to see what lies beyond that door.\n\n\nWhich way do you go?", "action_results": [{"action": "Go through the door to the left.", "result": "You walk over to the door on the left side of the corridor, turn the handle and push the door open.  You hold the candle out in front of you and you can see a large room with a long table running down the centre, surrounded by chairs.  A large chandelier hangs over the centre of the table and reflects spots of light from your candle.\n\n\nYou step into the room, furthering the light the candle is spreading into the room.  The table is the longest you have ever seen with enough chairs around it to seat twenty people.  There is a candlestick in the centre of the table and something else down at the far end of it.\n\n\nYou walk down the room towards the end of the table and as you get closer, you start to make out what it sat in front of the chair at the head of the table, it's a small box.\n\n\nWhen you reach the box, you find that it has a ribbon tied around it and a tag attached.  You lift up the tag and find that it is addressed to you.\n\n\nDo you open the box?", "action_results": [{"action": "Open the box.", "result": "You pull on the ribbon and it falls away from the box easily.  You lift the lid and peer inside to see there is a small vial in there, with a cork stopper.  You reach into the box and lift the vial out.\n\n\nThe vial is full of liquid, a slightly thick liquid which clings to the side of the glass a little as you tilt it back and forth.  You hold it up to the candle flame and as the light passes through the edges of the liquid you can see that it is a dark red.  You realise then, that this is blood.\n\n\nA vial of blood left in a box, nay a present, addressed to you in a house only the people who have taken your sister know to expect you in; there's only one possible source of the blood and it hits you like a kick to your stomach.  \"Amelia!\" you cry out loud desperately.  \"Amelia!\" you shout now, hoping to hear a reply, some clue as to where in this hideous place she is, but there's no answer from the house.\n\n\nYou drop the vial back into the box on the table.  Your sister obviously isn't in here so you hurry out of the room to try and find her.\n\n\nWhich way do you go from the corridor?", "action_results": [{"action": "Go through the door to the right.", "result": "You turn the handle on the door to the right, push the door open and the candlelight spreads out into the room and the first thing you see is a grand piano, the lid still propped open as though it had been recently played.\n\n\nYou step into the room and see that the piano is set up with a wide bay window area surrounding it.  You walk over to the piano, sit down on the stool and see that there is some sheet music set up on the piano.  You hold the candle up to it and see that the title reads Opus 31, Prelude No. 8 by C.V. Alkan.  This isn't a piece that you've heard of but you know how to play the piano and the music looks to be pretty easy.\n\n\nDo you play the music?", "action_results": [{"action": "Play the music on the piano.", "result": "It's been a few years since you last played the piano, when you still lived at your parents' house, but your hands feel comfortable sitting back onto the keys.\n\n\nYou start to play the deep bass chords and the sound seems deafening in the quiet of the house but it somehow feels right to be making music here.  Your right hand starts to pick out the melody of the piece and you think you see something move out of the corner of your eye but you can't be sure.\n\n\nYou get more and more drawn in to the strange, at some times jarring, melody, the deep chords still booming out in a slightly off pitch; you're vaguely aware of several figures in the room but you can't seem to stop playing the piece of music.  Your back feels slightly itchy as you sense the presence of someone behind you but you carry on playing, unable to tear you eyes away from the music, unable to stop playing.\n\n\nYou reach the final note of the melody in the piece and as you release the final chord it feels as though the piano's grip on you as suddenly been loosed and you almost fall backwards at the release.  As you jerk backwards, a black gloved hand covers your nose and mouth from behind and an arm is wrapped around your throat, choking you.  You feel the cloth of a bag going over your head and everything goes black.\n\n\n......\n\n\nYou slowly start to come to, the first thing you notice is how uncomfortable your arms are behind your back.  You drift closer to consciousness and manage to tell your arms to move, to end the discomfort, but they don't respond.  This acts as a catalyst to you fully waking and you slowly open your eyes.\n\n\nThe room you are in has no windows but it is lit by about eight flaming braziers around the edges of it.  It looks about the same size as the entrance hall to the building, but with a much lower ceiling.  There are figures in black cloaks, their heads covered by tall hoods, stood in a circle around the centre of the room and chanting something which you can't make out.  You can see through the gaps between them that there is some kind of symbol painted on the floor in white, with candles and other things you can't make out around it.\n\n\nYou shift your body awkwardly, your hands are bound behind your back and your legs are bound together with rope and there is a cloth tied around your head at your mouth, gagging you.  You manage to manoeuvre enough to sit upright, your back against a wall of the room, and from your new vantage point, you can see what is in the centre of the circle of hooded figures, what is in the centre of the symbol painted on the floor.\n\n\n \n\n\"Amelia!\" you cry out, but it comes out as just a muffled noise.  None of the hooded figures react your moving or attempted shouting, though it's possible they couldn't hear you over the sound of their chanting which is starting to really unnerve you.\n\n\nYou push your back up against the wall and use your legs to push you up it until you're in a slightly unstable standing position.  You have a different perspective on the circle now as you look between the shoulders of the hooded figures and you can now see the symbol which is painted onto the floor which swoops around your sister with a line intersecting the curve and forming a solid line around her.\n\n\n \n\n \n\nYou can see a few of the items which are dotted around the symbol now, they look like figurines of strange, alien, hideous creatures; something about them screams inside your head when you look at them.  Your sister is curled up on the floor, there are no tears and you realise she must have expended all the energy she had for crying some time ago, she was probably now into the midst of despair.\n\n\nYou stand there, with your legs bound, with your hands tied behind your back, and you struggle to think of a way in which you can help your sister.  You look around desperately for something you can use to free your bonds, something you can do which will help her.  You try to think if there is any magic you can do without any ingredients, without any equipment and without even the use of your hands but you can't think of anything which can help.\n\n\nThen you see a table in a corner of the room, a small table with three large knives laid out carefully on it.  As quietly as you can, you start to hop around the edge of the room towards the table.\n\n\nThe chanting abruptly stops and all of the hooded figures turn to face you in unison.  You stop dead and lean back against the wall to keep your balance, wishing you could do veiling magic like your mentor can, wishing you could blend into the room and not be seen, but your talents were never for the subtleties of veiling and your emotions right now would probably prevent you from being able to create one even if you had the capabilities.\n\n\nThree figures break away from the circle and walk over to you whilst you see a fourth one go to the table in the corner that you were trying to reach yourself.  You struggle as they grab you but with your limbs restricted, there's only so much you can do and they carry you over to the centre of the room.\n\n\nThey lay you down on the symbol painted in the floor over the line which intersects the curve.  Three of them are holding you in place and your struggling only serves to tire you out.  One figure holds a knife directly above your face, point down and the hooded figures all start chanting again; they're chanting something different this time, you can't make out the words but the rhythm of the chant is quite different.\n\n\nYou look over to your sister and she is staring blankly at you, curled up, hugging her knees as she lies on her side.  You try to yell at her to help you but the gag is muffling your words and Amelia isn't reacting at all, she seems to be completely catatonic and you shudder to think of what they have done to her to put her in that state.\n\n\nYou look around in complete desperation for something or someone to help you, but all you can see is the hooded figures and the knife.  A dark mist seems to be curling around you now, slowly winding around each part of your body.  Once it has completely encapsulated you, you see the mist start to resolve into a shape with your body within it.\n\n\nThe mist shape becomes a great beast with tentacles sprouting from its face and huge, lumpy limbs which look as though they're formed from many tumours and lesions.  You feel your body rise up as the mist figure rises and then you feel the knife slice across your throat and the wet of your blood running down your neck and chest, and then there is nothing but blackness.\n\n\n \n\nTHE END", "action_results": []}, {"action": "Leave the piano and continue looking around the music room.", "result": "You're not sure why you even considered playing the piece at the piano, you need to find your sister or some clue to as how to rescue her, you're certainly not here to brush up on your piano playing.  You lift up the music to see if there is anything else behind it but it's the only thing on the music stand.\n\n\nYou look around the room further and see a large harp on one side of the room and a cello or a double bass on the other side, you never could tell the difference, along with several seats in the centre of the room.  When you look closer at them, you notice that the instruments aren't coated in the same layer of dust which seems to cover the house, as though someone has been here using the instruments recently but that doesn't seem to help you in any way.\n\n\nYou decide there is nothing more to be found in the music room so you return to the corridor.\n\n\nWhich way do you go from the corridor?", "action_results": [null, {"action": "Go through the door at the end of the corridor.", "result": "You hold the candle out in front of you, focussing on the doorway at the end of the corridor where you thought you had seen a figure.  Maybe you had seen someone there and they knew where your sister was.  You should go and find out.\n\n\nYou walk slowly down the corridor, but much more confidently now you have a candle to see by.  As you approach the door, you can see a little inside the room and you realise that it must be the kitchen.  You step up to the door and slowly push it fully open and let the candlelight fill the room.\n\n\nThe kitchen was vast, far larger than even the kitchen at your parents' house and you room for possibly a dozen people to be working in.  There was a large wooden table running down the centre of the whole room with pots and pans hanging from a rack on the ceiling above it.  Around the walls were worktops covered with cooking equipment, knives, utensils, plates and serving dishes; in the centre of the room on the far wall was an enormous oven and a fireplace with kettles and pans hanging over it.  You can imagine that when the fire was lit and the oven roaring, with all the people there was likely to be working in here, that it would be a veritable inferno.\n\n\nThere is a door at the back which looks as though it leads out to the back yard of the house, probably for taking deliveries of foodstuffs.  There was another door at the back on the left and another at the back on the right.\n\n\nWhat do you do?", "action_results": [{"action": "Look around the kitchen to see if you can find any clues about your sister.", "result": "The kitchen has quite a few cabinets and drawers lining the room.  You start going through methodically, holding the candle up into each cupboard and drawer as you open them.\n\n\nYou find so many different plates and serving dishes and platters you had no idea a household could need so many different kinds.  There are pots and pans, roasting tins and trays, cooking utensils, cups and saucers, many different sizes glasses and enough cutlery to serve four dozen people a six course meal.  Everything which isn't in a cupboard or drawer has a layer of dust over it showing that the kitchen hasn't been used in some time.\n\n\nThe only thing you find out of place, is an empty slot in one of the knife blocks which looks as though it held a carving knife; you hope this was missing when the kitchen was being used and it hasn't been taken by whoever is in the house now.\n\n\nWhat do you do now?", "action_results": [{"action": "Go out to the back yard.", "result": "You cross the kitchen and place your candle on the counter near to the door, you don't want the light to go out by taking it outside.  You push the handle down on the door but the door doesn't move.  You shake it, pulling hard, but the door is definitely locked.\n\n\nYou look around for a key but you can't see one.  You go through the drawers and find lots of kitchen implements, but no keys.  You get a little nervous that you're trapped in this house, but the first thing you need to do is find your sister, getting out is something you'll worry about then.\n\n\nWhat do you do now?", "action_results": [null, {"action": "Go through the door at the back left.", "result": "You walk around the large table in the middle of the kitchen until you reach the door at the back left of the room.  There is a keyhole in the door but when you turn the handle, it opens towards you without resistance.  The smell hits you as soon as you open the door.\n\n\nBehind the door is a small room with a stone floor and, lined with wooden shelves.  On the shelves are the remains of the pantry store when the house was being used and judging by the state of them, they had been there for a while.\n\n\nYou hold the candle out in front of you and identify the source of the smell very quickly, what you think was once a wheel of cheese is now a big lump of mould and you think you see a little movement on it too, maggots most likely.  You hold your breath and step in to see if there is anything of note in the room.\n\n\nYou check each shelf carefully but all you find are bags, boxes and tins of food, all covered in dust and cobwebs and with nibbles from small rodents taken out of most.  You have just reached the conclusion that there is nothing there when you sense something out of the corner of your eye.\n\n\nYou whip your head around to the doorway, your eyes flashing past the candle as you do.  Was that a figure you saw just beyond the door or was that a shadow left from the candlelight in your vision?  You get a shiver down your spine.\n\n\n\"Hello?\" you call out towards the kitchen, but there's no reply but silence.  You slowly walk to the pantry door and peer back inside the kitchen.  There's no sign of anyone in there now at least.  You step back into the kitchen and close the pantry door behind you.\n\n\nWhat do you do now?", "action_results": [null, null, {"action": "Go through the door at the back right.", "result": "You make your way to the door at the back right of the kitchen.  You take a deep breath and turn the handle of the door. The door doesn't budge.  You give it a harder tug in case it's just stuck but you can see that there is a keyhole in the door, it must be locked.  You sigh and look around the kitchen to see if there's anything you can use to pry the door open and notice a rusty old key on the floor close to your foot.  You pick it up, insert it into the keyhole of the door and turn it.\n\n\nYou tentatively open the door inwards, holding your candle out to see the interior and you're surprised to see a wall right in front of you.  You look down and see that the doorway in fact only leads to some stone stairs, going down.\n\n\nDo you go down the stairs?", "action_results": [{"action": "Go down the stairs.", "result": "You look back into the kitchen nervously before starting to head down the stairs to the level below the house.\n\n\nThe stairs are fairly narrow and the stone walls either side are covered in cobwebs.  You use your free hand against the wall to steady yourself as you step down the stone slabs.\n\n\nOnce you reach the bottom, it opens out into a small room.  The walls all have stone shelves in square set into them and some of the shelves have a few wine bottles still stacked in them.  There's not much to the room so it doesn't take you long to have a close look around it and find that there's nothing more down here than a disused wine cellar and old wine.\n\n\nYou make your way back up the stairs and back into the kitchen, closing the door to the wine cellar behind you.\n\n\nWhat do you do now?", "action_results": [null, null, null, null]}, null]}, null]}, null, null]}, null, null, null]}, null, null, null, null]}, {"action": "Look through the notebook in your pocket for guidance.", "result": "Remembering the notebook you found in the hallway, you put the candle down on the table you found it and fish the notebook out from your pocket.  You lay it onto the table next to the candle and take a look at what is in there.\n\n\nThe page is full of symbols just like from the letter.  You turn the page, and it is covered in more symbols.  You keep turning pages to find more symbols, with diagrams too.  Some of the diagrams look like parts of spells to you, but a level of magic way beyond your learnings.  On one page, there is writing you can read but it's certainly not English, but you see the name of the house:\n\n\nPh'nglui mglw'nafh Grthalkpth Langdown wgah'nagl fhtagn\n\n\nWhat do you do?", "action_results": [{"action": "Try and read the sentence aloud.", "result": "Something about that text makes you feel compelled to read it aloud.  You try to pronounce the words, stumbling through the sentence.\n\n\nYou read it again, getting a better handle on how to pronounce the strangely written words on a second time through.\n\n\nYou read it a third time, this time you pronounce it smoothly and with confidence.\n\n\nPh'nglui mglw'nafh Grthalkpth Langdown wgah'nagl fhtagn\n\n\nYou read it a fourth time, and a fifth time, each time you finish, you are already starting it again.  You can't stop reading it now, the words are just flowing from your mouth unstoppably.\n\n\nPh'nglui mglw'nafh Grthalkpth Langdown wgah'nagl fhtagn\n\n\nYour voice is getting louder and louder as you chant the line over and over again.\n\n\nPh'nglui mglw'nafh Grthalkpth Langdown wgah'nagl fhtagn\n\n\nYour voice sounds like it is joined by other voices, chorusing together\n\n\nTheir voices are clear and true all around you and inside your mind; your words become their words and your soul becomes their soul.\n\n\nYou belong to Grthalkpth now.\n\n\n \n\nTHE END", "action_results": []}, {"action": "Keep looking through the book.", "result": "Something tells you that you shouldn't be trying to read anything aloud from this notebook and you keep turning the pages.  You stop when you reach a diagram which fills both sides of the notebook and looks like a floor map.  You turn it around, and realise that it's a map of a floor of this house.\n\n\nYou can see the stairs at the front of the house but you can't tell if those are stairs up or down, if the drawing is the ground floor, first floor or higher.  You hold the candle up and look around you, getting your bearing of the layout of the ground floor and comparing that to the map.  It doesn't seem to quite match up, so maybe this is for the next floor.\n\n\nYou hold the map closer to the flame and you notice a tiny red circle along the wall of one of the rooms.  Could that be significant?\n\n\nYou stare at the map, trying to commit as much of it to memory as possible.  You fish the letter out from your pocket and use it as a bookmark in the notebook so that you can find the map quickly again.\n\n\nWhere do you go now?", "action_results": [{"action": "Go up the stairs to explore the first floor.", "result": "You head back into the entrance hall with your candle held out in front of you.  You can see the entrance hall much clearer now and you notice that there is not only the door you had seen on the right hand side of the entrance hall as you came in but also another on the opposite side too.\n\n\nWhich way do you do?", "action_results": [{"action": "Go through the door on right.", "result": "What little light is coming from the doorway shows the door to the side the clearest in the gloom and you decided to try there first.  You walk across the hallway, hoping your mentor is following behind you, towards the large door.\n\n\nJust as you are about to reach the door, the heavy oaken front door slams closed behind you, trapping you and, you hope, your mentor inside the house.  You look around frantically but you can't see anything at all.  \"Hello?\" you call out again, and you can't keep a note of desperation from your voice.  You hear your own word echo around the empty foyer with no response.\n\n\nYou turn back to the door you're now stood next to and slowly push it open.\n\n\nThe room has a large window at one end and the moonlight is illuminating enough of the room for you to make out that the walls are lined with shelves of books.  You step into the room and you can sense your mentor moving close behind you.  You're glad she's so close after the front door closed like that, you really don't want to get separated from her if the same happens with this door.\n\n\n \n\nYou walk up to the shelves nearest the window and you read some of the spines of the books.  They seem to be about various schools of thought regarding the magical arts and you even recognise some of them from your mentor's collection.  You pull one of the books out and it's covered with a layer of dust as thick as the leather cover.  You put it back on the shelf and cough in the cloud of dust you stirred up.\n\n\nOne of the books then catches your eye as it has some symbols on the spine which look very familiar.  You pull the letter out of your pocket and hold it up to the book.\n\n\n the book reads.\n\n\n \n\n the letter reads.\n\n\n \n\nYou stand slightly to one side as you compare the two so that your mentor can get into a position to be able to see the two as well.\n\n\n\"Here, here and here\" you say, pointing to the symbols from the book spine on the letter as you see them.  You take care to sound as though you're talking to yourself but you're speaking aloud for your mentor's benefit.  \"What is this?\" you wonder aloud.\n\n\nYou pick up the book and immediately notice that it is only covered in a very thin layer of dust, this book hasn't been here for very long.\n\n\nYou turn the book to face you and see that the cover is simply a huge eye with no further writing on it.  You turn to look around you and just as your eyes are leaving the book, you hear a whispered gasp and you see the eye blink!\n\n\nYou stare back at the book and the eye looks just as it had, an obvious painting of an eye and in no way a real one, but you're certain you saw it blink and you think your mentor did too.\n\n\nWhat do you do with the book?", "action_results": [null, {"action": "Put the book back on the shelf.", "result": "There's something about this book which gives you the chills.  You might find information inside it but something tells you that the cost of that information would be too great and it's an instinct you think it is wise to follow.\n\n\nYou go to put it back on the shelf and as you do, you feel the book tug slightly towards the space you assume your mentor to be in.\n\n\n\"No.\" you whisper between gritted teeth, not used to defying your mentor in this way, but you're resolved, that book is bad news and you have to put it back.\n\n\nYou put the book back on the shelf with no further resistance and look around the rest of the library, hoping that your mentor has decided to leave the book well alone as well.\n\n\nYou walk across the room to a small table flanked by two chairs which has a chess board inlaid into the tabletop.  On the table is a small box, tied up with a ribbon and there is a tag attached to the ribbon.  You pick up the box and when you hold the tag to the light, you see that it has your name written on it.  You put the box quickly back onto the table and take a step back.\n\n\nYou crouch down so that your eyes are level with the table and you examine the box from what you hope is a safe distance.  It's a small box, about the size of your closed fist.  Whoever sent you that letter, knew that you'd be coming here and they obviously meant you ill judging by the trap which was contained in the letter.  This box might hold something equally, or more, terrible.  On the other hand, they wanted you to come here and they took your sister, or more importantly told you about the fact they took your sister, for a reason.\n\n\nWhat do you do with the box?", "action_results": [{"action": "Open the box.", "result": "Something nags at you that you need to see what is in this box.  It's been left there for you, it was intended for you to open it.  What if the box contains instructions for how to find your sister?  You have to know.\n\n\nYou step forwards and pick up the box again.  You hear a whisper from nearby of \"No!\" from your mentor, in much the same way that you told her not to take the book.  Your mentor understood that the best course of action was not to take the book, but you are not listening to her warning in the same way.  You pull on the ribbon and it unties and falls to the floor.  You yank the lid of the box off as quickly as you are able, before your mentor would be able to do anything to stop you.\n\n\nYou stare inside the box, this isn't what you expected, although you realise that a part of your feared it, you just didn't want to admit it.\n\n\nInside is a small finger, the size of a child's.  It was cut a little short of the knuckle, straight through the bone with a clean cut.  Next to the finger, coated in blood, is the ring you gave your little sister for her birthday last year, a silver snake eating its own tail in a neverending loop known as the ouroboros.\n\n\nYou hear a quiet gasp as you suppose your mentor must have looked into the box too and you place the box carefully back on the table, pick up the lid which had fallen to the floor from your hand at some point and gently place it back onto the box.\n\n\nThis won't help you to find her, you have to focus on finding her and not let this distract you.  You use a meditative breathing technique you use for the spells you cast which need the most focus and push the box and it's dreadful contents from your mind and walk deeper into the library.", "action_results": [{"action": "Continue", "result": "As you walk further back into the darkness of the library, pushing thoughts of the box to the back of your mind, you notice that you can see the outline of door at the end of the room; there must be light in the next room which is seeping around the door to the library.  You take a big breath and walk towards the light.\n\n\nWhen you reach the outline of the what must be a door, it looks like just a continuation of the wood panelling on this side of the room, you never would have thought there was a door here if there hadn't have been light coming through from the other side.  You feel around the panel but there's no handle.  You start to feel along every crevasse of the panel, pushing and pulling, and suddenly, when you push into a section on the right-hand side, the door pushes in and pops out again and opens towards you.\n\n\nThe door leads to a small room which is brightly lit by several large lanterns.  You have to look away whilst you allow time for your eyes to adjust to the brightness of it, but whilst your eyes are still adjusting, you hear your mentor gasp.  When you're finally able to see properly, you take a proper look into the room.  The walls are painted white and there is a small black altar in the centre against the back wall of the tiny room.  There are many, many more of the kinds of symbols from the letter painted onto the altar with red paint, you hope it's red paint at least.\n\n\nThe only other thing in the room is on the wall above the altar and it was the first thing you saw when you opened the door and must surely have been what made your mentor gasp when she looked into the room also.  There, hung in a frame, surrounded by more symbols, is a photograph of your sister from a couple of years ago when your parents hired a photographer for your grandmother's funeral.  She looks innocent and vulnerable and you shudder at thoughts of what they are doing to her right now and what greater purpose they have for taking her.\n\n\nYou stand there staring at your sister's photograph.  You don't remember when you last saw the photograph in your parents' house and you wonder if they took it from there when they took Amelia or earlier than that.  Your mentor snaps you out of it when she slams the door closed, clicking it back into place.  \"This isn't helping.\" she whispers to you and with a little coaxing, you leave the library, more determined than ever to find your sister and put a stop to whatever the people who have taken her are up to.\n\n\nWhere do you want to go now?", "action_results": [{"action": "Go upstairs.", "result": "You tentatively start walking up the stairs and after a few steps, the heavy oaken front door slams closed.  You jump so much that you stumble on the steps and fall backwards, tumbling into your mentor and knocking her to the ground.  Her concentration broken, she is no longer hidden and you hear a booming voice from above you \"I SAID TO COME ALONE!\" and suddenly the hallway and the entire staircase, is engulfed in fire.\n\n\nThe light hits you first, forcing you to close your eyes, and the noise feels deafening in your ears, and then you feel the heat.  You open your eyes to see your robe has caught fire and your mentor has too.  You scramble on the floor, trying to stand up but your robes are tangled in your feet and your mentor is sprawled underneath you.  You put a hand on the floor to help you get up but you pull it back straight away as the flames burn through your skin.\n\n\nBefore long, you can't feel anything on your hands and arms anymore and you know that's not a good sign.  You start to crawl towards the corridor underneath the staircase but your mentor isn't moving and you realise she's unconscious, she must have taken a blow to the head when you landed on her.  You turn around and grab her, getting to your feet now and you start to drag her towards the corridor, towards safety.\n\n\nOne of your feet slips when a rug slides out from under it and you fall to the floor.  The world goes black.\n\n\n \n\nTHE END", "action_results": []}, {"action": "Go down the corridor underneath the stairs.", "result": "You make your way across the entrance hall by the light the moon is casting through the open front door towards the corridor underneath the stairs.  When you reach about halfway across the hall, the front door slams closed with a heavy boom making you physically jump in the air.\n\n\nThe entrance hall is plunged into further darkness without the moonlight shining in and you hope and pray that your mentor was inside when the door closed.  You turn back to what you estimate was the direction you had been facing as your vision hasn't yet adjusted to the darkness of the room and you continue walking forwards much more cautiously now.\n\n\nFinally you reach the corridor which passes underneath the sweeping staircase and you put your hand firmly on the corridor wall as you steady yourself from the unbalancing walk in the darkness.\n\n\n\"Over here.\" says a whisper in your right ear, making you jump again; your mentor did make it into the house before the door closed then.  You reach out your arms to the right and shuffle forwards.  Just as your hands touch the wall of the other side of the corridor, your leg touches what feels like a table.  You put your hand down to it and feel the edge of the table.\n\n\nAs you move your hand over the table you feel a box of matches.  You grab it quickly, push the tray and carefully take a match out.  You feel around the box for the strike strip and the match flares the life, temporarily blinding you as your eyes adjust to having light once more.\n\n\nYou hold the match out over the table and there is a candle in a holder.  You move the match to the wick before the flame reaches your fingers and the candle takes the flame.  You shake out the match before it burns you and drop it onto the table.  You pick up the candle and hold it up to the corridor in front of you.\n\n\nFor an instant in the darkness, you think you see a figure at the end of the corridor but as you focus you can clearly see there is no-one down there, it must have been a trick of the light, with all the shadows the candlelight was casting.\n\n\nYou can see now that there are two doors leading off from the corridor, one to the left and one to the right, and a half-open door at the end though the light doesn't cast far enough ahead yet to see what lies beyond that door.\n\n\nWhich way do you go?", "action_results": [{"action": "Go through the door to the left.", "result": "You walk over to the door on the left side of the corridor, turn the handle and push the door open.  You hold the candle out in front of you and you can see a large room with a long table running down the centre, surrounded by chairs.  A large chandelier hangs over the centre of the table and reflects spots of light from your candle.\n\n\nYou step into the room, furthering the light the candle is spreading into the room.  The table is the longest you have ever seen with enough chairs around it to seat twenty people.  There is a candlestick in the centre of the table and something else down at the far end of it.\n\n\nYou walk down the room towards the end of the table and as you get closer, you start to make out what it sat in front of the chair at the head of the table, it's a small box.\n\n\nWhen you reach the box, you find that it has a ribbon tied around it and a tag attached.  You lift up the tag and find that it is addressed to you.\n\n\n\"Don't.\" you hear your mentor whisper in your ear.\n\n\nDo you open the box?", "action_results": [{"action": "Open the box despite your mentor's advice.", "result": "You pick the box up and pull on the ribbon and it falls away from the box easily. \n\n\n\"Stop!\" you mentor whispers urgently.  \"You don't know what will happen!\"\n\n\n\"I have to.\" you reply, whispering through gritted teeth.\n\n\nYou lift the lid and peer inside to see there is a small vial in there, with a cork stopper.  You reach into the box and lift the vial out.\n\n\n\"What on earth?\" you wonder aloud as you take a closer look at the vial.\n\n\nThe vial is full of liquid, a slightly thick liquid which clings to the side of the glass a little as you tilt it back and forth.  You hold it up to the candle flame and as the light passes through the edges of the liquid you can see that it is a dark red.  You realise then, that this is blood.\n\n\n\"No!\" you half-cry as you drop the vial back into the box on the table.\n\n\nA vial of blood left in a box, nay a present, addressed to you in a house only the people who have taken your sister know to expect you in; there's only one possible source of the blood and it hits you like a kick to your stomach.  \"Amelia!\" you cry out loud desperately.  \"Amelia!\" you shout now, hoping to hear a reply, some clue as to where in this hideous place she is, but there's no answer from the house.\n\n\n\"We have to find her.\" whispers your mentor, sounding distressed herself now which doesn't calm you down at all.\n\n\nYour sister obviously isn't in this room so you hurry out of it to try and find her, hoping that your mentor is following.\n\n\nWhich way do you go from the corridor?", "action_results": [{"action": "Go through the door to the right.", "result": "You turn the handle on the door to the right, push the door open and the candlelight spreads out into the room and the first thing you see is a grand piano, the lid still propped open as though it had been recently played.\n\n\nYou step into the room and see that the piano is set up with a wide bay window area surrounding it.  You walk over to the piano, sit down on the stool and see that there is some sheet music set up on the piano.  You hold the candle up to it and see that the title reads Opus 31, Prelude No. 8 by C.V. Alkan.  This isn't a piece that you've heard of but you know how to play the piano and the music looks to be pretty easy.\n\n\n\"I know this piece\" whispers your mentor to you, obviously looking at the music too.  \"It's not something I think you should play in a place like this.\"\n\n\nDo you play the music?", "action_results": [{"action": "Play the music on the piano.", "result": "It's been a few years since you last played the piano, when you still lived at your parents' house, but your hands feel comfortable sitting back onto the keys.\n\n\n\"I really don't think you should be doing this.\" whispers your mentor urgently.\n\n\nYou start to play the deep bass chords and the sound seems deafening in the quiet of the house but it somehow feels right to be making music here. \n\n\n\"No really, don't do this!\" says your mentor, no longer whispering but talking to be heard over the sound of the chords on the piano.\n\n\nIt feels right to be playing this though, so you carry on and your right hand starts to pick out the melody of the piece and suddenly the room goes pitch black and you can't read the music any more.\n\n\nYou lift your hands from the keys and look around in the darkness but your eyes haven't adjusted and you can't see anything.\n\n\n\"I had to do that.\" whispers your mentor.  \"It really didn't feel right.\"\n\n\nThe next thing you hear is the sound of the door to the music room closing, not with a slam like the front door had when you came into the building but as though someone was calming closing it, either shutting you in here or shutting them in here with you.\n\n\nYou start to panic as the darkness just seems to mean danger all around.  You put your hand down on the piano to steady yourself and your hand lands on the keys making a jarring noise, further disorienting in the blackness of the room.\n\n\nYou jump on the seat when you feel something touch your hand but you realise that it is the box of matches being pressed into your hand, your mentor must be telling you to relight the candle but she mustn't know if someone is in here with your or not or she would have whispered something to you.\n\n\nYou drop two matches before you manage to strike the third one and the light blinds you as much as the darkness did for a moment.  You see the candle sat on top of the piano within reach and use the match to light it before shaking the match out.  You pick up the candle, stand up and hold it up, lighting the room as much as you can make it and slowly turn around.\n\n\nThere's nothing, no-one is here, and your heartbeat starts to slow down a little.\n\n\nYou walk over to the door, turn the handle, and expecting resistance you wrench it open only to find that it opens with ease and you tumble backwards a little before you leave the music room as quickly as you can and return to the corridor.\n\n\nWhich way do you go now?", "action_results": [null, null, {"action": "Try to talk to your mentor for guidance.", "result": "Having your mentor there but feeling like you're on your own is driving you crazy, you're so used to getting advice and guidance from her with your studies and this feels like the biggest test of your life.  You decide you really need to consult her about the whole situation.\n\n\nYou go to the nearest corner you can find, where the doorframe for the kitchen from the corridor creates a little niche and you whisper \"Are you there master?\"\n\n\n\"I'm here,\" she whispers back, \"but I don't think it's safe for us to talk.  The author of the letter was specific that you should be alone and we don't want to jeopardise your sister's wellbeing.\".\n\n\n\"I know,\" you reply, \"but I have no idea what I'm doing!\"\n\n\n\"Calm down,\" she whispers, \"take a deep breath.  You need to keep a clear head.\"\n\n\nYou take a deep breath in and slowly let it out.  Your mentor waits for you to do this three times before she says anything else.\n\n\n\"Ok,\" she whispers, \"something strange is going on in this house.  There's magic in here, I can feel it, but it's dark magic.\"\n\n\n\"Amelia.\" is all you can say in reply.\n\n\n\"Yes, I'm afraid I believe your sister is in danger here.\" you mentor says quietly.  \"We need to find her, but we need to know what she's involved in too.\"\n\n\n\"What do you mean?\" you ask.\n\n\n\"I don't think she's been taken for the fun of it, they've got a specific purpose in mind for her and I...\"\n\n\n\"YOU WERE TOLD TO COME ALONE!\" boomed a voice, cutting off your mentor mid-sentence.  In your concern for your sister, you and your mentor had quite forgotten to keep your voices to a whisper and evidently, you have been heard.\n\n\n\"I am alone!\" you shout back, though you don't sound convincing even to yourself.  \"I was thinking out loud!\"\n\n\n\"LIAR!\" screamed the voice and the corridor was suddenly filled with flames.\n\n\nThe fire was so bright, you had to close your eyes and you instinctively put your arm over your face, shielding it from the heat, which was instant and all around you.  The next thing you know, your arm has been grabbed and you've been pulled off your feet and sent sprawling onto the floor.  You break your fall with your arms and see that you've landed in the kitchen, and there's no fire there.  The fire is entirely filling the corridor but stops exactly at the doorway between the corridor and the kitchen.\n\n\nYou look to the side, at the person who pulled you out of the fire, and see your mentor sprawled on the floor nearby, smiling at you, and it's a wonderful sight.\n\n\n\"Thank you!\" you say to her exuberantly.\n\n\n\"Anytime you want to repay the favour, please go ahead!\" says your mentor jovially.  Then her smile drops as she looks back at the corridor.  \"We still need to find your sister.\"\n\n\nYou look back at the flames with a panicked whip of your head \"You don't think she's...\"\n\n\n\"I think she's safe from the fire.\" replies your mentor calmly.  \"That seems to have been a very specifically targeted spell.  We do need to find her soon though, their power is stronger than I thought, it's not easy to have that much control over fire.\"\n\n\nYou start looking around the now well lit kitchen for ideas of what to do next, when suddenly it is plunged into darkness as the fire, all at once, disappears.\n\n\n\"Move!\" says your mentor in a half-whisper and you hear her scrambling to her feet as your sight tries to adjust to the sudden darkness.  You hurriedly get to your feet and rush to the side of the room.  Your mentor is already there.  She puts her hand on the top of your head and pushes down; you crouch down obediently and she crouches down next to you.\n\n\n\"Under the table.\" she whispers, pointing to the table in the centre of the kitchen.  You are both crawling across the floor when you hear slow, steady footsteps coming from the corridor.  You crawl as quickly as you can and you both make it underneath the table just before a figure wearing a dark robe with the hood over the head appears in the doorway.\n\n\n\"I know you're in here.\" says the voice, it's the same voice you heard shouting just before the fire appeared.  \"Otherwise I would have already seen your charred bodies on the floor.\"\n\n\nYou hold your breath, hoping you won't give away your location.  You look at your mentor next to you and you can see that she has her eyes closed and is mouthing something over and over.\n\n\n\"Let's shed a little light on the matter shall we?\" asks the hooded figure and the room is suddenly lit up as all the candles in the room burst to life.\n\n\nWhat do you do now?", "action_results": [{"action": "Sit tight and hope your mentor is up to something.", "result": "You keep as still and quiet as possible but with the room lit up now, you know you must only have moments before you're both discovered.  You look desperately at your mentor and she is still sat with her eyes closed silently chanting.\n\n\nThe hooded figure paces around the room slowly and you feel like your heart is going to burst out from your chest it is pounding so hard.  He completes a circle around the table in the middle of the kitchen and comes to stop just to the right of where you're both huddled.\n\n\n\"Nice try!\" he says before he bends down to look underneath the table, right next to where your mentor is crouched.\n\n\nYou can't see his face still, shadowed by his hood, but his head is about a foot away from your mentor, he can't miss her and yet he shows no sign of having seen her.  The head beneath the hood moves left and right as he scans underneath the table and he doesn't react at all, when you're both sat there plain as day.\n\n\nYou physically jump when the hooded figure lets out a frustrated roar, grabs the table as he straightens and flips it up and across the room, crashing into all the kitchen equipment, sending pans, utensils and various other things flying.  He still doesn't seem to see you, yet you can see yourself and your mentor as clearly as anything else in the kitchen, though your mentor remains still in the same position, eyes closed, silently chanting and you know she must be managing to hide you both from him.\n\n\nThe hooded figure sweeps his cloak around and heads into one of the doors off the kitchen.  After some banging around, they reappear, cross the floor and head into another door.  After a minute they reappear again, stomping their feet almost like a child now.  \"Of course!\" they cry before wrenching open the back door and going outside, the lights in the kitchen abruptly going out as soon as they leave the house.\n\n\nYou look at your mentor for a cue on what to do now, wondering if you should run, or continue crouching here in the middle of the kitchen with no table covering you anymore.  She must sense you looking to her for guidance, a familiar act in this unfamiliar situation, as she opens her eyes, looks at you and stops chanting for a moment to put her finger to her lips and say \"Shhhh!\" before continuing her silent chanting and closing her eyes once more.  You remain motionless, although your legs are starting to cramp up so you're not sure just how long you can stay in the same place for.\n\n\nAbout five minutes later, the hooded figure sweeps back in from the back door, closes the door behind him and locks it with an audible clunk before heading back down the corridor again and it sounds like they then head up the stairs from the entrance hall.\n\n\nAfter another couple of minutes, your mentor stops chanting, opens her eyes and smiles at you.  \"As simple as that.\" she whispers casually.  \"Veiling two people is just harder than just veiling yourself, but we'll cover that when you're advanced enough to be learning about veils.  In the meantime...\" and she disappeared from your sight again.  \"Best they don't see me, even if they suspect you're with someone.\"\n\n\n\"What about me?\" you ask worriedly, \"they think I left out the back door, they tried to kill me!\"\n\n\n\"They still need you.\" whispers your mentor wisely.  \"They wouldn't have gone looking for you like that and they wouldn't have invited you here in the first place if they didn't need you.  They want you here, they just want you alone.\"\n\n\nYou nod slowly, absolutely terrified after seeing the ease with which they controlled fire to such precision and with such ferocity.\n\n\nYou stand up and stagger through the kitchen doorway back to the niche where you and your mentor were overheard from.\n\n\nWhere do you go now?", "action_results": [null, null, null, null]}, {"action": "Go on the offensive.", "result": "The room was all lit up now and you know you must only have moments before the hooded figure sees you.  There is no way you are able to prepare a spell in that time, you need to attack physically and you need to do it now whilst you still have the element of surprise.\n\n\nYou look around in the newly lit room and see a carving knife on the floor half underneath the table behind you.  You wait for the hooded figure to take a couple of steps towards you, until they're within an arms length of your hiding place underneath the table; in one motion you reach behind you and grab the knife then propel yourself from underneath the table, stabbing the knife down into where the hooded figure's thigh will be.  But the knife hits what feels like a brick wall, the jar of the impact knocks the knife from your grip and it spins across the floor.\n\n\nYou look up at the hooded figure, who is looking down at you, face hidden by the cloak's hood even in the lit room.  You see their leg rising and the foot plummeting to your head before you're able to move it and everything goes black.\n\n\n......\n\n\nYou slowly start to come to, the first thing you notice is how uncomfortable your arms are behind your back.  You drift closer to consciousness and manage to tell your arms to move, to end the discomfort, but they don't respond.  This acts as a catalyst to you fully waking and you slowly open your eyes.\n\n\nThe room you are in has no windows but it is lit by about eight flaming braziers around the edges of it.  It looks about the same size as the entrance hall to the building, but with a much lower ceiling.  There are figures in black cloaks, their heads covered by tall hoods, stood in a circle around the centre of the room and chanting something which you can't make out.  You can see through the gaps between them that there is some kind of symbol painted on the floor in white, with candles and other things you can't make out around it.\n\n\nYou shift your body awkwardly, your hands are bound behind your back and your legs are bound together with rope and there is a cloth tied around your head at your mouth, gagging you.  You manage to manoeuvre enough to sit upright, your back against a wall of the room, and from your new vantage point, you can see what is in the centre of the circle of hooded figures, what is in the centre of the symbol painted on the floor.\n\n\n\"Amelia!\" you cry out, but it comes out as just a muffled noise.  None of the hooded figures react your moving or attempted shouting, though it's possible they couldn't hear you over the sound of their chanting which is starting to really unnerve you.\n\n\nYou push your back up against the wall and use your legs to push you up it until you're in a slightly unstable standing position.  You have a different perspective now as you look between the shoulders of the hooded figures; you can see your mentor unconscious and bound on the opposite side of the room to you and you can also now see the symbol which is painted onto the floor which swoops around your sister with a line intersecting the curve and forming a solid line around her.\n\n\n \n\n \n\nYou can see a few of the items which are dotted around the symbol now, they look like figurines of strange, alien, hideous creatures; something about them screams inside your head when you look at them.  Your sister is curled up on the floor, there are no tears and you realise she must have expended all the energy she had for crying some time ago, she was probably now into the midst of despair.\n\n\nYou stand there, with your legs bound, with your hands tied behind your back, and you struggle to think of a way in which you can help your sister.  You look around desperately for something you can use to free your bonds, something you can do which will help her.  You try to think if there is any magic you can do without any ingredients, without any equipment and without even the use of your hands but you can't think of anything which can help.\n\n\nThen you see a table in a corner of the room, a small table with three large knives laid out carefully on it.  As quietly as you can, you start to hop around the edge of the room towards the table.\n\n\nThe chanting abruptly stops and all of the hooded figures turn to face you in unison.  You stop dead and lean back against the wall to keep your balance, wishing you could do veiling magic like your mentor can, wishing you could blend into the room and not be seen, but your talents were never for the subtleties of veiling and your emotions right now would probably prevent you from being able to create one even if you had the capabilities.\n\n\nThree figures break away from the circle and walk over to you whilst you see a fourth one go to the table in the corner that you were trying to reach yourself.  You struggle as they grab you but with your limbs restricted, there's only so much you can do and they carry you over to the centre of the room.\n\n\nThey lay you down on the symbol painted in the floor over the line which intersects the curve.  Three of them are holding you in place and your struggling only serves to tire you out.  One figure holds a knife directly above your face, point down and the hooded figures all start chanting again; they're chanting something different this time, you can't make out the words but the rhythm of the chant is quite different.\n\n\nYou look over to your sister and she is staring blankly at you, curled up, hugging her knees as she lies on her side.  You try to yell at her to help you but the gag is muffling your words and Amelia isn't reacting at all, she seems to be completely catatonic and you shudder to think of what they have done to her to put her in that state.\n\n\nYou look around in complete desperation for something or someone to help you, but all you can see is the hooded figures and the knife.  A dark mist seems to be curling around you now, slowly winding around each part of your body.  Once it has completely encapsulated you, you see the mist start to resolve into a shape with your body within it.\n\n\nThe mist shape becomes a great beast with tentacles sprouting from its face and huge, lumpy limbs which look as though they're formed from many tumours and lesions.  You feel your body rise up as the mist figure rises and then you feel the knife slice across your throat and the wet of your blood running down your neck and chest, and then there is nothing but blackness.\n\n\n \n\nTHE END", "action_results": []}]}, null]}, {"action": "Leave the piano and continue looking around the music room.", "result": "Your mentor is right of course, it would be foolish to start to play the piano, it wouldn't help to find your sister and it would only serve to draw anyone in the house towards you; you're not sure why you even considered playing it in the first place.\n\n\nYou lift up the music to see if there is anything else behind it but it's the only thing on the music stand.  You're about to start looking around the rest of the music room when you hear a whispered \"Over here!\" from your right.\n\n\nYou walk towards where you think the whisper came from and you bump into what must be your mentor, but of course you can't see her.  \"Inside the piano.\" your mentor whispers to you.  You pick up the candle from where you had it resting on the piano and hold it underneath the open lid.  The light reflects off something in there.  You peer closer and see that it's a knife blade that is reflecting your candle.\n\n\nYou put the candle back down on the piano again and reach over into the strings of the instrument to retrieve the blade.  \"Carefully!\" whispers your mentor and you can feel her holding you down so that you can reach further using both hands without toppling inside.  You manage to grasp the flat of the blade between your fingers on both hands and draw it up, your mentor helping to pull you back to the floor.\n\n\nYou hold the blade up to the candlelight once you've righted yourself and you can see that it is a dagger of some sort.  The handle has six inlaid blood red jewels in the pattern of a circle and the blade itself is wavy in shape, something which you've never seen from a dagger before, although you haven't had much cause to see many daggers in your lifetime.\n\n\nYou look around the room for something to put the blade it so that you can carry it in your robes without fear of cutting yourself on it.  You see a large harp on one side of the room and a cello or a double bass on the other side, you never could tell the difference, along with several seats in the centre of the room.  When you look closer at them, you notice that the instruments aren't coated in the same layer of dust which seems to cover the house, as though someone has been here using the instruments recently but that doesn't seem to help you in any way.\n\n\nFinally you see a cloth laid over a violin in the corner.  You take the cloth, wrap the blade in it and stow it away in one of the many pockets of your apprentice robes.  There doesn't seem to be anything more to be found in the music room so you return to the corridor.\n\n\nWhich way do you go from the corridor?", "action_results": [null, null, null, null]}]}, null, null, null]}, {"action": "Listen to your mentor, leave the box alone and continue searching the room.", "result": "Your mentor is right, there is no reason you can think of as to why this box would have been left for you if it contained anything good.  Whoever left this here did so to try and mess with you, either emotionally or as another booby trap like the letter was and you're not going to fall for it .  You step away from the table and continue to look around the room.\n\n\nThere is a large dark wood sideboard along one wall with a large vase in the centre of it and a mirror hanging above it.  You jump when you first see your candlelit reflection in the mirror, you barely even recognise your face when you take a closer look as worry and desperation has contorted it.  As you peer at yourself in the mirror, you think you glimpse a shape, a person perhaps, moving behind you.  Has your mentor dropped her invisibility disguise?\n\n\nYou turn around quickly, but the room is empty and your mentor is still hidden.  You crouch down and look underneath the large table, all you can see is a plethora of chair legs and the large sturdy columns supporting the table.  You stand up again and press your back against the sideboard, glad to have something at your back, whilst you wait for your heart to slow down and you breathing to steady.\n\n\nYou literally jump in the air when the loud bongs of a grandfather clock start to chime in the room with you, particularly as you hadn't even heard it ticking.\n\n\nBONG, BONG, BONG, BONG.\n\n\nThe sound feels deafening against the silence of the house and it rings in your ears after it the clock has finished chiming.  Then another four bongs sound this time muffled though a wall; there must be another clock in the hallway that you never saw.\n\n\nYou take a few deep breaths and finally feel calm enough to move.  You turn around to face the sideboard again.  It has about half a dozen cupboards and drawers which you open in turn.  The cupboards all contain very fancy plates and serving dishes, you idly wonder just how much they're worth, left behind in this grand old house.  The drawers all contain silverware, carefully laid out in each drawer with care but tarnished with neglect now.  The final drawer you check, doesn't open.\n\n\nYou shake the drawer a bit, you pull harder, it doesn't move.  You bend down and take a closer look, but there's no keyhole, no sign of what is stopping it from opening.  You grab a large table knife from one of the other drawers and try to prise the drawer open, but all you do is scratch the varnished surface of the wood. \n\n\n\"Here, let me.\" whispers your mentor in your ear and you feel her push past you to the drawer.\n\n\nYou step out of the way to allow her to work and you can here her chanting something in a whisper before the drawer suddenly pops open, causing the whole sideboard to jolt.  Your mentor never fails to impress you with what magic is capable of doing, maybe one day you will know enough of magic to be able to carry out unprepared spells with no equipment or forewarning like that, and she did it all whilst maintaining her invisibility as well which was the most impressive part.\n\n\nYou look down at what was sealed in the drawer and pick up a scroll of paper tied with a piece of string.\n\n\nYou pull on the string and untie it and unravel the scroll.  Half of the scroll is written in the same strange symbols from the letter you received and half of it is written in English.  You idly wonder if the same thing is written in both languages.\n\n\nYou read the English on the scroll and determine that is it the instructions for a summoning.  You can't be sure what is meant to be summoned by it but it requires two blood sacrifices, exactly six people carrying out the summoning and the details of the design which must be present on the floor and the symbolic idols needed are all very specific.\n\n\nThis might have been a curiosity left here by the previous resident of the house, left behind in a drawer which got stuck and wouldn't open, or it might have been put here by the people who have your sister and purposefully locked away to be kept safe.  You desperately hope it is the former but the sinking feeling in your stomach tells you that you know it's the latter.\n\n\n\"Let's get moving.\" whispers your mentor to you, snapping you out of your thoughts and you head back out to the corridor.\n\n\nWhich way do you go from the corridor?", "action_results": [null, null, null, null]}]}, null, null, null]}]}]}, {"action": "Leave the box where it is.", "result": "There is no reason you can think of as to why this box would have been left for you if it contained anything good.  You knew that book was bad news and you're sure this box must be as well.  You step away from the table and continue to walk deeper into the library.", "action_results": [null]}, {"action": "Use magic to try to destroy the box.", "result": "The last thing which was addressed to you was a trap and this is bound to be one too.  You're not going to fall for it and open this box, and you're not going to leave it lying around to do you harm later either.  You have to destroy it.\n\n\nYou look around the room for something which will help you and through the gloom you notice a writing set on a table nearby.  You grab the ink pot, pull out the stopper and pour a circle of ink around the box on the chess table.\n\n\nYou don't have the items you would have back in the laboratory, but you have a few useful things in your robes that you carry about with you.  You pull a small cloth bag, tied with a string from one of your pockets, fumble open the string and shake a fine dusting of the powder over the box.  You carefully tie the string back around the bag and put it back into your pocket.\n\n\nYou place your fingers onto the circle and you see the ink smudge on the opposite side of the table to you and you realise that your mentor is going to add her power to the spell.  This is a relief as you didn't know if you were going to be able to do it on your own without everything you would normally use for something like this.\n\n\nYou close your eyes and concentrate, mumbling the words of the spell you are using over and over until, with a small bang which makes you jump and a puff of smoke, the box is no longer on the table; part of the table itself is also missing, a consequence of the lack of refinement you were able to do.\n\n\nYou breath a sigh of relief, that box was trouble and you knew it, you weren't going to be that easy to trap.  You nod your head, happy to move on and walk deeper into the library.", "action_results": [null]}]}]}, {"action": "Go through the door on the left.", "result": "The door to the left looks very similar to the wood panels which cover that side of the hallway so you can see why you weren't able to see the room by the light of the moon when you first came into the house.  You go up to the door, turn the handle and push open the door.\n\n\nThe candlelight falls upon a pleasant looking parlour.  There is a small table with four chairs in the middle of the room and a tea set laid out on the table which seems very odd to you since the house is supposed to have been vacated.\n\n\nYou walk into the room and see that the tea set has been recently used and there are wet tealeaves coating the bottom of two of the cups.  You look around the room warily, half expecting to see the tea drinkers stood by the fireplace or sat writing a letter at the bureau.  \"No time for tea.\" jests your mentor at a whisper at your shoulder.  \"Let's take a look around.\"\n\n\nThere was a variety of seats and around the room and a comfortable looking pair of chesterfields seemed to be the main focus of the room.  There was a variety of furniture around the room and you set about looking through them for anything which might help your sister.\n\n\nMost of the furniture proves to be empty when you open them up, save for a few packs of cards and an abandoned piece of embroidery, until you get to the bureau.  When you open the bureau, you find a variety of writing materials but also some letters which are addressed to Langdown Hall and what looks to be some notes.\n\n\nYou open the letters to read them, but you find that most of the writing has been written in the same type of symbols which were on the letter you received at the start of this ordeal and so they're completely meaningless to you.  The notes however, seem to be written partially in English.\n\n\nBlood of an innocent.  Magical blood, family connection.\n\n\nFind an apprentice, we don't want anyone with any real power here.\n\n\nNight of the full moon is the most powerful.\n\n\nThese notes seem to explain why your sister was taken, she was certainly an innocent.  Were they considering her blood to be magical because of her relation to you though, or were they referring to your blood and was that why they had sent you the letter to bring you here?  What are they doing which needs the power of a full moon night?\n\n\n\"I do believe they mean to kill you as well, my dear apprentice.\" whispers your mentor solemnly.  \"And I believe tonight is the night of the full moon.  But we have the upper hand, they didn't want me here.\"\n\n\n\"We have to find her,\" you reply \"and fast!\"  You leave the parlour and return to the entrance hall.\n\n\nWhere do you go next?", "action_results": [null, null, {"action": "Go up the stairs.", "result": "You slowly and carefully start to ascend the staircase to the first floor.  The stairs sweep around the edge of the room, starting on the right-hand side and ending in a landing over the entrance hall on the left-hand side.  There are a few uncovered windows over the landing allowing a little moonlight to creep in, but your candle is lighting up the area to a far better extent than the moon.\n\n\nThe landing spreads out to your left over the top of the entrance hall and to the right there is a corridor running parallel to the top of the stairs, across the width of the house.  \"Looks all clear.\" your mentor whispers in your ear and you nod very slightly, nervous of who might be watching.  You move around into the corridor and hold out your candle.\n\n\nYou can see that the corridor extends all the way from one side of the house to the other with an ornate window at the far end of it.  You walk forwards a little and you can see that there is another corridor branching off to the left and to the front it looks as though there is a door on either side of the corridor.\n\n\n\"Which way?\" you whisper to your mentor out of the corner of your mouth.\n\n\n\"Your guess is as good as mine.\" she whispers back, leaving you with the decision.\n\n\n \n\nWhich way do you go?", "action_results": [{"action": "Continue down the corridor and go into the door on the left.", "result": "You walk down the corridor towards the window at the end of and stop in front of the door on the left.  You carefully turn the handle and push the door open.\n\n\nThe room is very wide but not very deep.  To the left it has a double bed against the wall with a table either side and enough space to walk around the bed but little more.  To the right is a window with heavy curtains drawn across it taking up the whole of that wall.  In front of you is a large chest of drawers against the wall and when you walk into the room and look around you can see that behind the door is a large wardrobe, so tall that it almost touches the ceiling.\n\n\nThe bed is neatly made but when you walk over to it and lightly pat the covers, the bedspread is covered in a thick layer of dust which blooms into the air and causes you to start coughing as you breath it in.  Once you've recovered you kneel down and look underneath the bed, and jump back quickly with a yelp of panic when you see a pair of eyes reflecting the candlelight.  You back away from the bed but nothing happens, nothing comes out from underneath the bed and you start to wonder if you even saw any eyes at all or if you'd imagined it.\n\n\n\"It's ok.\" whispers your mentor from somewhere near the bed.\n\n\nYou trust your mentor so slowly, you make your way back to the bed.  You kneel back onto the floor and, taking a deep breath, you hesitantly bend down and look underneath the bed again.  You start again when you see the same eyes but you don't jump away this time and as you look again you see that in fact the eyes belong to a discarded doll lying on its side underneath the bed.  You breath a great sigh of relief and chide yourself for being so easily startled.  You leave the doll where it is and go to investigate the rest of the room.\n\n\nThe chest of drawers has four large drawers and four small drawers at the top of it.  You look inside each of the large drawers first and find a few items of clothing neatly folded inside but nothing else of note.  You then try the small drawers and find that each of them is stuck tight.  You shake and pull on the drawers but they won't come open.\n\n\n\"Stand back.\" whispers your mentor and you do.  You don't feel or see her pass you but you hear her whispered chant from next to the chest of drawers.  After about a minute of her spellcasting, all four small drawers spring open at the same time.\n\n\n\"Wow.\" you breathe and move over to look into the drawers.\n\n\nAll the drawers are full of the same thing.  You pick one out and hold it up in the candlelight, a long, black candle.  You don't think you've ever seen a black candle before and there's something about it which just gives you a shiver down your spine.  They must be important for them to have been sealed away .\n\n\n\"What do you think?\" you whisper to your mentor.\n\n\n\"Unusual,\" she whispers back.  \"but let's keep looking.\"\n\n\nYou put the candle back in the drawer and move on.\n\n\nLastly, you turn to the large wardrobe and it hasn't escaped your notice that with the size of this piece of furniture, it could easily be hiding several people inside and you almost don't want to open it, but you still don't know where your sister is and you have to find anything which might help.  You steel your nerves and turn the handle of the right-hand door.\n\n\nYou open the door quickly and stand to one side, but nothing happens, no-one bursts out of the wardrobe, nothing attacks from inside it.  You peer slowly around the door and hold the candle up to the open doorway and see nothing at all inside it.  You open the other door and you can see that it is completely empty.  You shake your head at yourself, you really are getting paranoid.\n\n\nYou look around the room and decide there is nothing else to be found here and you go back to the corridor outside.\n\n\nWhere do you go now?", "action_results": [{"action": "Go through the door on the other side of the corridor.", "result": "You walk up to the door on the right-hand side of the corridor and you pause before you turn the handle of the door, was that a noise you heard inside?  It sounded like a click, a familiar noise but you can't quite place it.  You press your ear against the door but you don't hear anything again, maybe your mind is playing tricks on you.\n\n\n\"Careful.\" whispers your mentor very quietly in your ear.\n\n\nYou cautiously and slowly turn the handle and open the door a little, holding the candle to the gap and peering in.  You can see something large in the centre of the room and you open the door fully and let the candlelight spill into the room fully.\n\n\nMost of the room is taken up with a large snooker table in the centre of it.  The balls used are the more modern snooker balls and they are spread out across the table and you can see a couple of balls in the pockets.  A single cue is leaning up against the table on the far side of it.  You look around the room and see a rack of cues for the snooker table on one wall, various comfortable-looking leather chairs around the room and a small cabinet in the far left corner with three crystal decanters on top.\n\n\nYou walk over to the cabinet and see that one of the decanters has an amber liquid in it and there is a matching glass next to it which when you look at closer has a trace of the amber liquid in it.  You smell the glass and you recognise the scent of whisky immediately, something your father has always enjoyed.  You open the cabinet and see two bottles of whisky inside it, both opened and partially depleted.  You're a little tempted to have some yourself to steady your nerves but you're not in the habit of drinking alcohol and you're not sure how it would affect you, you need all of your mental and physical facets in full working order if you're to have any hope of finding and saving your sister.\n\n\nYou turn around to look at the rest of the room and you jump when the light from your candle falls on a wall of spikes and tendrils moving towards you.  You back is pressed against the wall when you realise that they're not moving, it was the candle which was moving causing the shadows to move, and they're not spikes and tendrils, they're horns and antlers; the wall is covered in taxidermied and mounted heads of animals.\n\n\nYou stare at the wall of dead animal heads for a while before you're confident that none of them are moving.  You manage to tear your eyes away from the wall of heads and back to the snooker table in the middle of the room and then you realise, the click you heard when you were outside the door, it was the sound of a snooker ball hitting another one.  The solo cue standing against the side of the table now looks very ominous to you and you slowly start bending down to look at the one place in the room where there is room for a person to be hiding.\n\n\n\"There's no-one here.\" whispers your mentor to you and you breathe a sigh of relief, straightening back up.  \"There was someone here though,\" your mentor continues, \"and they had to have gone somewhere.\"\n\n\nWhat do you do now?", "action_results": [{"action": "Finish the game of snooker in progress.", "result": "Something about the partially completed game of snooker makes you feel like you really need to complete the game, it's an urge that you just find you can't resist and you can't quite explain why. You put your candle down on the table, walk over to the rack on the wall and pick out a cue; you walk back around the table, pick up the cue which was left leaning against the table and hold it out into the room.  \"We have to finish this.\" you say to your mentor, your voice no longer hushed into a whisper.\n\n\nThere is a pause before your mentor responds, but she does so simply by taking the cue from you.  It vanishes the moment she touches it and you let it go into her grasp.\n\n\nThere is a block of chalk on the side of the table and you apply some to the end of your cue and blow away the excess.  There are 3 red balls still left on the table and you walk around to the other side of the table to take a shot.\n\n\nYou pot the red ball into a corner pocket, walk around the table and pot the blue ball into a middle pocket.  You walk around the table, put your hand into the pocket and lift out the blue ball, replacing it onto the table.  You line up another shot and miss potting a red ball into a middle pocket.  Within a few seconds of the cue ball coming to a rest, it flies off suddenly, hit by the invisible cue of your mentor.  You watch, mesmorised, as your mentor proceeds to finish potting the red balls and starts on the coloured ones, you had no idea she had such skill at snooker.\n\n\nYou're so completely involved in the game by this point, you're not thinking about your sister, your surroundings, the house or the people who lured you here, you're only thinking about the difficult shot your mentor needs to make next.  The cue ball once more flies across the table, this time striking the blue ball but it sends it off into the nearby cushion and nowhere near the pocket which must have been the target, but the cue ball slides neatly into the corner pocket.\n\n\nYou heart stops when you hear a voice just behind you say \"Foul.\"\n\n\nYou only have time to start with surprise before the mystery figure wraps a snooker cue around your neck and starts to choke you.\n\n\nSuddenly the pressure alleviates and you feel your mentor in front of you, pulling on the cue from her side.  Your attacker, probably not even realising your mentor is in the room compensates for her help though, and pulls back with even greater force and the more force they exert, the less you feel able to fight against them.\n\n\nYou can't breathe and you can feel your windpipe being crushed.  You look desperately around you as you try and push the snooker cue away from your throat and you see a small door opened up on the wall with the animal heads and a staircase behind it.  You have just enough time to think that must be where the snooker player came from, and where they went when you first came into the room as well, before you black out completely.\n\n\n \n\nTHE END", "action_results": []}, {"action": "Continue looking for an alternative exit.", "result": "You have no idea why you had an urge to play the partially completed game of snooker on the table but that would obviously be an absurd thing to do, especially with your sister's life in the balance and you force yourself to look away from the table.\n\n\n\"Here, I've found something.\" whispers your mentor from the side of the room where the animal heads are mounted and you reluctantly head over to them.  \"Down here.\" she whispers from below you and you crouch down and peer at the wall.\n\n\nYour eyes run along the skirting board, carefully not looking at the dead eyes of the animal heads, and then you see it, a line running through the skirting board and up the wall.  You hold the candle closer and stand up, following the line up the wall.  \"You see!\" whispers your mentor.  \"I think it's a door!\"\n\n\nThat would make a lot of sense, clearly someone was in here and they went somewhere; a hidden door was exactly the kind of thing you were looking for in these rooms and you would never have spotted it without your mentor's help, you feel a wave of gratitude towards her for coming on this dangerous mission with you.\n\n\n\"How do we open it?\" you whisper to her as you follow the outline of the door all the way around the skirting board again.\n\n\nWhat do you do now?", "action_results": [{"action": "Try to open the hidden door.", "result": "You start to hunt around for a handle for the door but you find it very difficult to look past the animal heads, especially when you are very literally face-to-face with them.\n\n\n\"Found it.\" whispers your mentor and one of the antlers of a deer suddenly snaps downward and the door click and swings towards you by about an inch.  You reluctantly grasp the horn of another animal head in absence of any kind of handle for the door and gentle pull to open the door towards you.\n\n\nBehind the door is a dark, narrow staircase, absent of any kind of decoration or finishing that the rest of the house had until this point.  You wonder if the owners even knew about this staircase.  You look at where you believe your mentor to be, shrug and start walking up the stairs.\n\n\nWhen you reach the top of the stairs, there is a very plain, wooden door at the top.  You're sure that someone must have gone this way when you entered the snooker room below and you're worried that someone may be lying in wait for you on the other side of this door; after all, they knew exactly where you were and if they'd wanted you to come up here, they would have left the hidden door open.\n\n\nAs quietly as possible, you slowly turn the handle and push open the door.  Nothing happens.  You let go of the handle and give the door a little push, the door swings open and hits the wall behind it with a thud which sounds deafening in the silence.  You hold your candle up and squint into the darkness at what you can see.\n\n\nThere is a corridor stretching in front of you but it's too dark to see anything else.\n\n\nWhat do you do?", "action_results": [{"action": "Walk into the corridor.", "result": "You walk along the dark corridor, candle held out in front of you, until you reach the wall at the end; the corridor continues to the right and when you peer down it, you can see there are some doors on the right-hand side of the corridor.\n\n\nSomething which strikes you as odd is that there are no windows at all on the walls, even though you're sure they are outside walls, meaning that the only light is that cast by your candle, which you notice is getting quite short now.\n\n\nWhere do you go now?", "action_results": [{"action": "Go into the first door on the right.", "result": "You push open the first door you come to along the dark corridor and the candle lights up a very drab bedroom.  There is a single bed with a metal frame, a lumpy looking mattress and no bedding.  A simple wooden chair stands next to a small, square, wooden table which looks as though it would break as soon as you tried to use it.  Other than that, the room was completely bare and felt very small compared to the rest of the house.  You crouch on the floor and look underneath the bed but there is nothing to be seen in this sparse room and you decide to leave it and return to the corridor.\n\n\nWhere do you go now?", "action_results": [{"action": "Go into the second door on the right.", "result": "You push open the second door along the corridor and find that this room must have been home to two people at some time as two single, metal bedframes are on either side of the room.  The mattress on the right hand bedframe is bare and looks very uncomfortable.  The bed on the left hand side though, looks to be made with fresh linens and looks positively inviting.\n\n\nYou look around the rest of the room and see a small table with two simple wooden chairs either side of it and you put your candle down on the table.  Between the two beds is a nightstand which has a large bowl with a jug stood inside it and when you walk over to it, the jug is full of piping hot water.\n\n\nThere is something about the water which seems very inviting and you pour it out into the bowl and submerge your face in it.  The water feels like it's refreshing you, like it's washing away your worries and your problems.\n\n\nYou pull your face out of the water and look down at the made bed.  It looks very inviting and you really are feeling tired, you should have been asleep for hours by now.\n\n\nWhat do you do?", "action_results": [{"action": "Take a nap in the bed.", "result": "You feel really tired and the bed right there just looks too inviting.  You're sure that you'll be able to help your sister better if you're not dead on your feet.  You kick your shoes off and climb into the bed.  \"What are you doing?\" your mentor hisses at you, but you're too tired to reply.  Your head sinks down into the soft pillow and the blankets covering you feel warm and cosy.  You close your eyes and in a few seconds, you're asleep.\n\n\n......\n\n\nYou open your eyes and you can't remember where you are.  You seem to be lying in a bed and you're hugging yourself, you must be cold, but you don't feel cold.  You move to pull the covers back but your arms don't move.  You try to look down but the covers are in the way and you can't see why you can't move your arms.  You try harder, struggling with all your strength but your arms don't move at all.\n\n\nThen the world goes white.  You close your eyes as you are blinded by brilliant light and you hear the sound of a door opening.\n\n\n\"Good, you're awake.\" you hear a voice say.\n\n\nSlowly you open your eyes just a crack and you see a woman standing in the doorway.  She's dressed in white and she's holding a small tray.\n\n\n\"Who are you?\" you ask the woman.\n\n\n\"I'm Nurse Hannigan.\" she says patiently.  \"You need to take your medication.\"\n\n\nYou look around the room as far as you can see lying on the bed and you can clearly see that this isn't the room you went to sleep in; the walls are white and seem to be covered in fabric, the floor is tiled and the light embedded in the ceiling is electric, a florescent tube.\n\n\n\"How did I get here?\" you ask groggily, your eyes almost open fully now and you try to sit up but Nurse Hannigan pushes you back down again.\n\n\n\"Not again.\" sighs Nurse Hannigan.\n\n\n\"My sister!\" you cry out, suddenly remembering what had happened before you went to sleep in that terrible place.  \"I need to save her, she's been taken!\"  You swivel your legs around off the bed and half stand up this time before Nurse Hannigan pushes you back down again.\n\n\n\"You need to take your meds.\" replies Nurse Hannigan calmly, but she is holding your firmly by the shoulder with one hand so that you can't easily stand up, especially with your arms immobilised.\n\n\nYou look down at your arms and find that they're inside a white jacket but the arms are wrapped across your body and round the back and they must be fastened there as you can't pull them back.\n\n\n\"My arms are stuck.\" you say to Nurse Hannigan as you continue to try to free them.\n\n\n\"It's for your own safety.\" replies Nurse Hannigan.\n\n\n\"I need my arms!\" you say, starting to panic a little now.  \"I need to save my sister!\"\n\n\n\"You don't have a sister and you need to take your meds.\" replies Nurse Hannigan, starting to sound a little impatient.\n\n\n\"I do!\" you cry, \"She's in danger, they're going to hurt her!\"\n\n\n\"Calm down.\" says Nurse Hannigan firmly and she holds out a little paper cup to you.\n\n\n\"No!  I have to get out of here!\" you yell, knocking the cup out of her hand when you use your shoulder to knock her arm to the side and you stand up and run towards the door which she left open when she came in.\n\n\n\"Security!\" yells Nurse Hannigan and before you reach the door, a large man in a white t-shirt and white trousers is filling the doorframe.  A logo on his t-shirt reads Arkham Asylum and you just have time to think that sounds vaguely familiar before you barrel into him to knock him out of your way.  What you actually manage to do though, is rebound off his immoveable form, falling backwards and without your arms free to balance you, you fall down to the floor onto your behind.\n\n\nHe reaches down, rolls you over and holds your face against the floor with one hand and holds down your body with the other.\n\n\n\"I've subdued the patient.\" says the hulking man, sounding like he's reciting a phrase he has been taught.\n\n\n\"Good.\" replies Nurse Hannigan, walking over to you as you kick your legs wildly but there's nothing for your feet to make contact with.  She bends down, putting her face next to your head and says \"You need to calm down.\" and you feel the pinch of an injection in your arm.\n\n\nYour eyes feel really heavy and you close them before you even realise that you feel sleepy.\n\n\n\"You'll feel better after your treatments.\" you hear Nurse Hannigan say just before you lose consciousness.\n\n\n \n\nTHE END", "action_results": []}, null, {"action": "Leave the room and go into the third door on the right.", "result": "You follow the corridor until the last door on the left which you find to be half open when you reach it.  You cautiously push the door all the way open and you're satisfied that no-one is hiding behind it.  This room is starkly furnished with a metal framed single bed standing on one side and a wardrobe on the other side.  There is a bare mattress on the bed frame but otherwise the room is absent of any soft furnishings.\n\n\nYou bend down and see nothing underneath the bed and so you go to check inside the wardrobe.  You walk over to it and turn the handle to open it, but nothing happens.  You try it again and rattle it, trying to free it up, but it doesn't give at all.\n\n\nYou hear a sigh and your mentor whispers \"Stand aside.\".  You do and you hear her familiar chanting spellcasting before something clicks inside the wardrobe.  You try the handle again and this time it opens.\n\n\nWhen you open the wardrobe door, you find nothing, it is completely empty and you find yourself wondering why it was locked like it was if it didn't have anything in it.\n\n\n\"Maybe it was just stuck?\" you whisper to your mentor, shrugging.\n\n\n\"Maybe.\" she replies doubtfully, but you can't find anything here to so you decide to return to the corridor and press on.\n\n\n \n\nWhere do you go now?", "action_results": [null, null, {"action": "Continue along the corridor.", "result": "You walk to the end of the corridor and turn the corner to the right and finally the area is lit by something other than your candle as moonlight drifts in through a small window on the left at the end of the corridor.  You walk forwards until you're in front of the window and look out onto the grounds at the back of the great manor house.  The grounds at the back look as though they're no longer being kept up well and the woods behind them look dark and ominous and it gives you the creeps a little as you look at it.\n\n\n\"This place has been shrouded in evil for some time.\" whispers your mentor from next to you.  \"We would be best not to linger for any longer than we need to.\"\n\n\n\"I wasn't planning to.\" you reply, but then flinch a little as you realise she would class that as being cheeky to her.\n\n\nYou turn away from the window and assess your new surroundings; in front of you is a door and to the right is another corridor with a further two doors to the right.\n\n\n \n\nWhere do you go?", "action_results": [{"action": "Go into the first door.", "result": "You approach the first door, turn the handle and slowly open it.  The room inside is devoid of furniture and instead it has a circular dais in the middle of the room with a large, golden, grand chair in the middle and a lever on one arm of the chair.  You look up and see that above the dais is a circle of equal size hanging down from the ceiling.  You walk around the side of the dais and see that behind it, with copper pipes connecting the two is what looks like a large engine with gears and pistons galore.\n\n\nYou walk around the engine but you can't see any controls anywhere or any hint as to what it is powering, other than the pipes linking to the dais.  You conclude that the only way you're going to see what the contraption does, is to pull the lever on the chair in the middle of dais.\n\n\n\"What do you think?\" you ask your mentor, desperate for some guidance on what you should do here.\n\n\n\"I'm afraid I can't fathom what the machine is doing.\" she whispers, sounding almost embarrassed at her lack of knowledge.  \"Perhaps it's better if we don't meddle with such things.\" she suggests.\n\n\n \n\nWhat do you do?", "action_results": [{"action": "Sit on the chair and pull the lever against your mentor's advice.", "result": "You step up onto the dais and look around the room but nothing happened when you stepped up there.  You walk around the chair, examining it, trying to understand what would happen when you pull the level, but the workings must be all inside the chair or underneath the platform, the chair just looks like a very grand chair, almost like a throne.\n\n\nYou sit down on the throne, the velvet-cushioned seat feeling very comfortable and almost relaxing.  You place your arms onto the arms of the throne and they rest there in just the right position and your right hand falls naturally onto the lever.  You close your eyes and think of Amelia as you pull the lever.\n\n\nYou hear the engine behind you start to whirr, the pistons pumping slowly and first and then gaining speed.  You open your eyes and find a curtain of light surrounding the circle you're sat in the middle of and the throne starts to vibrate beneath you.\n\n\n \n\nThe shaking becomes more violent and the light is cascading in waves down around you now and then the light becomes too bright for you to keep your eyes open for and you close them tightly together.  There is one final huge jolt and you get flung forwards, out of the throne and you land, unexpectedly, on sand.\n\n\n......\n\n\nYou land on your hands and knees in the sand and you squint at the bright sunlight whilst your eyes adjust to it.  You can hear voices all around you, yelling in a language you don't recognise.\n\n\nYou manage to get to your feet and you see that you're in a vast open area and what look like huge machines with bird-like wings on them in the distance.  What is closer to you is far more concerning though.\n\n\nThere is a group of oriental looking men, such as you have only seen in paintings before, wearing suits and holding what look like rifles but they're black and very oddly shaped and don't seem to require reloading as you realise that the ballistics from them are firing in your direction.\n\n\nYou yelp in surprise and horror and then you hear what sounds like a muffled Irish voice yelling something incomprehensible right behind you.  You turn around and there is a man with a horse's head holding another of the strange shaped rifles and they are pointing it right at you.\n\n\nYou take a step back and hold your hands in front of you, shaking your head.  \"No, no don't!\" you have enough time to say before you hear the deafening noise of the weapon at the same time as you get knocked backwards and you fall back into the sand.\n\n\nYour stomach feels like you were just punched hard in it and you're finding you can't catch your breath.  You look down and your brown apprentice robes are turning a deep red across your stomach and your chest, the pool of scarlet spreading fast.\n\n\nYou touch your hand to your stomach and hold it back out in front of you and your hand is wet and covered in blood.\n\n\nYou wheeze start to cough as it feels as though your lungs are full of liquid and you realise that's probably exactly what has happened.  You look up and see the horse-headed man shooting his weapon at the oriental men, each of them falling as you have until there aren't any left and you watch him walk away before closing your eyes and thinking of your sister with your last moments of life.\n\n\n \n\nTHE END", "action_results": []}, null]}, {"action": "Go into the second door.", "result": "You walk along to the corridor to the middle door and push it open.  There is a small, lowset window casting a very small amount of moonlight into the room but your candle lights up the room quite well.\n\n\nIn the left-hand corner of the room, by the outside wall, is a small stove which looks as though it could be used for both cooking and for keeping the room warm.  There is a small, threadbare settee facing it close by and another settee of a similar condition on the other side of the room.  In the middle of the room is a long, wooden table with 8 chairs around it, all unfinished wood and very plain in design.  In the far corner on the right of the room is a small desk with a single chair in front of it and a bookcase to the side of it.\n\n\nYou walk into the room and head over to the stove.  There is a cupboard next to the stove which you open and find it has a couple of pans and a few mismatched plates inside which confirms your suspicion that the stove had been used for cooking in its past.  Now though, it looks as though it hasn't been used in quite a number of years.\n\n\nYou turn around and go over to the settee nearby.  There are no cushions or other soft furnishings left on it and you lift up the cushions of the seat but find nothing underneath and you wonder to yourself what you even expected you could find underneath there.  Nevertheless, you repeat the process with the second settee across the other side of the room and find the same result, nothing.\n\n\nYou walk over to the bookcase but there is only one book left on the shelf, a leather-bound copy of 'The Holy Bible'.  You flick through the book, causing a cloud of dust which makes both you and your mentor cough and choke a little, but otherwise the book looks to be perfectly normal and you return it to the shelf.  You do notice that some of the dust has settled onto the invisible form of your mentor though, meaning you can see where she is now.\n\n\n\"The dust!\" you whisper, pointing to where it is lying on your mentors arm and shoulder.\n\n\n\"Oh!\" she says and in a couple of seconds, it has vanished and you marvel at how her spell is able to compensate for such small particles being added to her form and then veil them as well.\n\n\nYou stop staring at where your mentor was partially visible a moment ago and finally, you turn your attention to the desk.  There are a couple of drawers in the desk, neither of which have locks on them and both of which prove to be empty when you open them up.  Disappointed not to find anything useful, you leave the room and return to the corridor.\n\n\nWhere do you go?", "action_results": [null, {"action": "Go into the third door.", "result": "You walk along the corridor to the find room and this one has a small plaque on the door which reads, in a beautiful fluid script, 'Bathroom'; the door is ajar and you push it open.\n\n\nInside is a small, very basic looking tin bathtub, which is only big enough to sit in unless you were an infant.  Next to the bathtub is a small sink with one tap which looks grimy with age.  There is also a toilet with the system suspended above it and the chain hanging down with the handle missing from it.  Given the size of the bathtub, you're surprised to see a modern, flushing toilet and you wonder if it was a more recent addition.\n\n\nThere is one thing out of place in the room which you couldn't fail to notice though.  Suspended from the ceiling is an extendable ladder with a small hatch above it which looks as though it leads to an attic.\n\n\nThere is a pole leaning against the wall which looks as though it is for pulling down the ladder but you're just about tall enough to reach it without needing the pole.  You pull the ladder down and it extends to the floor whilst hinging on the ceiling so that is it perfectly positioned to allow access to the attic hatch.\n\n\n\"What do you think?\" you whisper very quietly to your mentor.\n\n\n\"I think we go up.\" she replies at the same volume and you turn to look at the ladder.\n\n\n \n\nWhat do you do?", "action_results": [{"action": "Go up the ladder and through the hatch.", "result": "You put your candle down on the floor of the bathroom, grip the sides of the ladder and climb up towards the ceiling.  Your legs are feeling wobbly beneath you and you're not sure if it's nerves, exhaustion or a combination of the two.  You reach the hatch in the ceiling, and you climb as high as you are able to so that you are bent over with the hatch above you; you place both hands firmly on the far side of the hatch and slowly lift it up until there is about an inch high gap that you can peer through.\n\n\nAs soon as the hatch is lifted, you can hear chanting coming from the attic room and you know you must be in the right place, you know that your sister must be here.  Although you can hear what must be the people who have taken your sister, you can't see anything through the gap you've lifted up other than a plain wooden floor and then the beams of the roof sloping back towards you, lit by candlelight which isn't coming from the candle you placed on the bathroom floor below you.\n\n\nYou carefully lower the hatch again and, with some difficulty, turn yourself around on the ladder so that you're facing the opposite way.  Once again, you slowly lift the hatch about an inch, the sound of the chanting is clear again and you peer through the gap you have made.  This time it is much further until the sloping beams on the opposite side of the house but the floor in between the hatch and the beams is completely empty.  You can see some shadows being cast which fall into your view of the floor though, and it's clear that the people up there are positioned to your right.\n\n\nOnce again, you close the hatch, manoeuvre yourself on the ladder until you are facing the direction the shadows were being cast from and you lift up the hatch again.\n\n\nYou can see that the light in the attic is being cast primarily by a variety of thick church candles near the edges of the attic room.  In the centre of the room, you can see the lower half of a group of people stood in a circle in black robes.  You lift the hatch a little higher and you can see that their faces are covered by the deep hoods on their robes and they are still chanting.  You try to make out the words and the word Langdown jumps out at you from what they're saying, which makes some degree of sense as that's where you are after all.\n\n\nYou lower the hatch gentle back down again and climb down the ladder and explain to your mentor what you could see when you lifted the hatch door.\n\n\n\"I think they've got her surrounded in a ritual circle.\" you whisper quietly to your mentor after you've told her what you saw.\n\n\n\"No amount of stealth is going to allow us to just take her then.\" replies your mentor, equally quietly.  We need a different tactic.\n\n\n \n\nWhat do you do now?", "action_results": [{"action": "Burst into the attic screaming, hoping the distraction will catch the hooded figures off guard,.", "result": "You take a deep breath, climb the ladder and poise yourself, ready to be as much of a distraction as possible so that you can try and find your sister, grab her and get out of there before they even know what's hit him.", "action_results": [{"action": "If you found the razor, click here.", "result": "As you stand on the top of the ladder, hunched over and preparing to fight, you remember the razor you found in the master bedroom downstairs.  You fish about in your pockets until your fingers fall onto the unmistakeable handle of the razor and you pull it out from the pocket you found it in.  You pull the blade out from the handle and hold it in your hand, trying to get a feel for how to hold it to be able to use it as a weapon.  Once you feel happy with how to hold it, you grip it tightly as you lift the hatch up, slowly at first and then you throw it up so that it topples behind you onto the attic floor with the great big bang.\n\n\nYou're already halfway through the square hatch when the noise alerts everyone in the room to your presence and all of the hooded figures abruptly turn to you, but the chanting doesn't falter for even a second.  As you climb high enough to get your first foot onto the attic floor, you start to scream, a battle cry to you but possibly the way it was rising in pitch means that the hooded figures will hear it more as a scream of terror.  Either way, you have all of their attention and you don't look very mentally stable.  Something moves in your peripheral vision to your right but you don't have time to check what it was and you just hope it was your mentor.\n\n\nAs you get the second foot onto the attic floor, raising the hand which grips the razor, you hear your mentor yell \"Look out!\" just as you get hit from behind by a great big weight and you go flying forwards onto your face.  Your arm holding the razor is pushed underneath you and before you even realise what is happening, the razor's blade is buried deep into your neck and your hand is already covered in blood.\n\n\nYou find the strength to pull yourself up a little from the floor and between the legs of the hooded figures, you can see the face of your sister, lying on the floor, staring at you with silent tears rolling down her face.  The razor comes out of your throat as you lift yourself up and a river of blood pours down your robes.\n\n\nYou collapse back to the floor again, your face landing on a pool of blood already formed underneath you and then everything goes black.\n\n\n \n\nTHE END", "action_results": []}, {"action": "If you didn't find the razor, click here.", "result": "You're already halfway through the square hatch when the noise alerts everyone in the room to your presence and all of the hooded figures abruptly turn to you, but the chanting doesn't falter for even a second.  As you climb high enough to get your first foot onto the attic floor, you start to scream, a battle cry to you but possibly the way it was rising in pitch means that the hooded figures will hear it more as a scream of terror.  Either way, you have all of their attention and you don't look very mentally stable.  Something moves in your peripheral vision to your right but you don't have time to check what it was and you just hope it was your mentor.\n\n\nAs you get the second foot onto the attic floor, you hear your mentor yell \"Look out!\" just as you get hit from behind by a great big weight and you go flying forwards onto your face.  You quickly realise that one of the hooded figures has jumped on you and is now trying to hold you down.\n\n\nYou kick and struggle but the hooded figure has the advantage over you.  Suddenly though, they are pulled back and you realise that your mentor must be helping you out, pulling them off you.  You seize the chance, resume your scream and head straight for the circle of hooded figures which you're convinced must have your sister in the middle of.\n\n\nThe hooded figures watch you run towards them quite calmly, parting just as you reach them and you see then, your sister curled up on the floor in the middle of some kind of ritual area.  She is bound and gagged and tears are running silently down her face.  You only have a moment to take in what you see but there is a seemingly random array of black candles and other small objects around the area within the circle of hooded figures.  There is also a white symbol painted onto the floor which swoops around and has a line intersecting the curve.\n\n\n \n\nIn the middle of the shape created by the lines is where your sister is lying and you skid to a halt when you reach her and scoop her up into your arms.\n\n\nAs soon as you have her though, your head is jerked back by your hair and you're thrown down to the ground.  Your sister tumbles from your arms back onto the floor and she's helpless to do anything with her limbs bound.  Just before a crowd of the hooded figures blocks out everything else, you see three of the hooded figures grappling with your mentor, who doesn't seem to have been able to maintain her veil after she got into a physical fight.\n\n\nThe chanting by the hooded figures didn't stop or falter through the whole altercation and now the chanting is becoming louder and louder.  You struggle to get up but there are four of them holding you down and you have no chance to move.\n\n\nThe blade that cuts across your neck feels hot and you feel your chest flood with warm, wet blood.  You just have time to see the same done to your sister before everything goes black.\n\n\n \n\nTHE END", "action_results": []}]}, {"action": "Try to sneak into the attic and work out what to do once you're there.", "result": "You take a deep breath, climb the ladder and poise yourself.  You're not sure how you're going to be able to get your sister out of there, but you're confident that the first step is going to be stealth; going in there like a bat out of hell is going to lead to a quick death more likely than now.", "action_results": [{"action": "If you found the dagger, click here.", "result": "You're trying to psyche yourself up for the attic infiltration when your mentor hisses at you up the ladder \"The dagger!\"\n\n\n\"Dagger?\" you whisper back.\n\n\n\"The dagger we found in the piano. Use the dagger!\"\n\n\nOh yes, the dagger, you'd completely forgotten about that.  You rummage carefully about in your pockets until you find the dagger in one of them.  You test how sharp the blade is on your finger; it isn't really that sharp but with enough force behind it, it would still do a lot of damage.  You tuck the dagger into the cord tied around the waist of your robes to keep your hands free but the blade handy.\n\n\n\"It's time.\" you whisper to your mentor and you start to lift the hatch from the opposite side to where the hooded figures are standing so that the hatch will hopefully hide your entry to the room a little.\n\n\nYou get really nervous the higher you lift the hatch, especially when you can't see the hooded figures to know if they have seen you or not.  When the hatch is almost upright, it starts to slip a little and you panic as you grab it back to stability; you grab it with your other hand just as it started to fall and you breath a silent sigh of relief.  Luckily the slip happened silently and the chanting never faltered, maybe luck is on your side you wonder.\n\n\nYour adrenaline is really surging through you now and your muscles are begging for you to run, use that adrenaline to get out of there, but you're not leaving without your sister, that's just a truth that you've known since you first read the letter they sent you.\n\n\nYou get both of your feet onto the attic floor, still crouched as low as you can manage and you wait until you feel your mentor climb up into the attic too before you lower the hatch down, although you leave it only half covering the hole as you need to get out of here quickly once you've got your sister.  You move as quietly as you can to the back of the attic, away from the hooded figures, still at a crouch and turn to look over at the circle of what you're sure now are cultists.", "action_results": [{"action": "If you found the notes about who was needed for the ritual, click here.", "result": "You think back to the notes you found in the parlour earlier and realise that might be quite important.  What did it say again?\n\n\nBlood of an innocent.  Magical blood, family connection.\n\n\nFind an apprentice, we don't want anyone with any real power here.\n\n\nNight of the full moon is the most powerful.\n\n\nThey need magical blood as well as the blood of an innocent, which is why they sent you the letter, to get you to come here of your own accord, and it's why they chose your sister as the innocent, to make sure you would come.  Now you're in the attic, you're giving them everything they need for their ritual, but you can't get your sister out without being up here.  What you've also brought though, is your mentor and they have no idea she is here, you can only hope that makes all the difference.\n\n\nSuddenly, your mentor appears next to you, crouched down just as you are, with her eyes closed and chanting.  You start with panic when you see her appear like that, you don't want the cultists to know she is here!  She is obviously spellcasting though, and with nothing else happening, you realise that she hasn't just appeared to everyone, she has extended her veil to include you as well.  You're not sure if she can listen to you whilst she's casting the veil, which obviously takes a lot more concentrated effort than just veiling herself, but you try anyway.\n\n\n\"They need me for the ritual as well.\" you whisper, your mouth very close to her ear so as to only be audible to her.  \"We need to get her out without letting them grab me too.\"\n\n\nThere's no response from your mentor as she continues to crouch there with her eyes closed and chanting.  Then you notice a tiny nod and you can only hope that was her way of agreeing with you.\n\n\n\"Ok, so we need a plan.\" you whisper hopefully and look at your mentor again.  She continues on chanting and you wish more than anything you were back in the laboratory being taught by her again, no matter how hard the lessons were, they always made sense, you always knew what you were meant to be doing even if you couldn't do it.\n\n\n\"Well, there's about a dozen of them,\" you whisper, trying to count the cloaked figures, \"if we just try and take Amelia, even veiled, there's enough of them to stop us.\"\n\n\nYou crouch there looking over at the circle of figures and wistfully whisper \"If only I could look like them.\"  At that, your mentor's eyes flick open and she looks right at you, nearly making you fall over backwards in surprise before she disappears.\n\n\n\"Yes!\" she whispers back to you and you wonder what she has planned now.  You're feeling very exposed now, no longer veiled, but the circle of chanting cultists don't seem to be paying any attention to you luckily.\n\n\nYou feel an energy falling over you and you realise it must be your mentor's doing.  You look down at yourself and see that your brown apprentice robe is now black.  You pull the hood up and find that it has deepened like the robes of the cultists, so that it now hides your face completely.\n\n\n\"How do I look?\" you whisper to your mentor but she doesn't respond; keeping up her veil and maintaining the robe change must be using up all of her concentration like the double veil had.\n\n\nYou stand up and try to emulate the postures of the cultists in the circle, upright with steady shoulders, robe hood well forward but head up straight.  You pat your waist and find that the dagger is still tucked into your, now black, cord belt and that gives you an idea on how to approach this, you only hope your sister will forgive you.\n\n\n......\n\n\nYou stride confidently over to the circle of cultists and as you approach, you get a view of what they are surrounding.  In front of the cultists is a seemingly random array of black candles and other small objects which you can't make out.  There is a white symbol painted onto the floor which swoops around and has a line intersecting the curve.\n\n\n \n\nIn the middle of the shape created by the lines is your sister, lying on her side, bound and gagged with tears silently running down her face.\n\n\nYou see a gap wide enough between a couple of the cultists and go to stand in between them but before you get there, you realise that you're not chanting as they are and that might give the game away.  You quickly try to emulate the sounds they're making though they don't seem to be making words other than Langdown in the middle of it.\n\n\n\"Ffloo mwaf gralk Langdown wahg ftah\" you say with them.\n\n\n\"Fnloo mgwaf grthalk Langdown wgahn ftag\" you try the next time.\n\n\n\"Fngloo mgwnaf grthalkth Langdown wgahnag fhtagn\" you manage the third time.\n\n\n\"Ph'nglui mglw'nafh Grthalkpth Langdown wgah'nagl fhtagn\" you flow into saying just as you reach the circle and stand between the cultists.  They don't seem to even acknowledge you arriving there.\n\n\nYou stand in the circle of cultists, chanting their strange phrase with them a few times whilst you decide the best way to do this.  You take a deep breath and step forwards towards your sister with the dagger drawn.\n\n\nYou sister starts to write about in her bonds, clearly terrified and you hate yourself for doing this to her, but it's the only thing you can think of.  You crouch down and pull her up into a sitting position and hold the dagger in front of her throat with your other hand holding her by the neck.  The cultists haven't moved but their chanting is getting louder and you manage to suppress a shiver.  You draw the dagger across her neck and blood trickles down through your fingers.\n\n\nThe chanting is reaching a crescendo and you pick up your sister, hoping that the cultists can't see that the blood is coming from the slice you just made on your own hand and not from your sister at all.  You use the dagger to cut the bond tying her and you stride out of the circle and towards the hatch.\n\n\nIt takes the cultists a few moments to realise that whatever they were attempting to do hasn't happened and that someone taking the girl away wasn't part of the plan.  By this time, your mentor has uncovered the hatch again for you and you have already lowered your sister down to start climbing down the ladder and you're halfway through the hatch yourself.\n\n\nThe cultists start running towards you but your mentor suddenly becomes visible, stood protectively next to the hatch.  She shouts a word and the cultists run into an invisible wall.  You use the time your mentor has bought you and hurry down the ladder yourself, pushing back the hood on the cloak as you do and give your sister a big hug when you reach the bottom of the ladder whilst your mentor climbs down behind you.\n\n\n\"Just go!\" yells your mentor at you and you pick your sister up and run as fast as you can.\n\n\nYou run around the corridors of the servants' quarters mostly by memory with the candle you held before abandoned in the bathroom and the hallways dark with little or no moonlight.  You make it all the way around to the staircase you came up and as you reach the door at the top of the stairs, there is a light behind you.  You daren't look behind to see if it is your mentor providing the light or someone else; you fling open the door and descend the stairs two at a time until you reach the bottom where the secret door is still stood open from when you came through it earlier.\n\n\nYou charge into the games room and out into the corridor outside it, your sister still in your arms but she's manoeuvred herself to be clinging to you as well which you're very grateful for as it's taking less effort to carry her as a result.\n\n\nOnce you're in the corridor, you hear the secret door in the games room click closed and you do look back this time.  Your mentor comes running out of the games room, sees you looking back at her and yells \"Keep going!\", which you do.\n\n\nYou run down the sweeping staircase back into the moonlit hallway below and head to the front door.  You're amazed when the door actually opens when you try it, you thought it would have been locked behind you but maybe they never thought you'd be getting out.\n\n\nYour mentor is side-by-side with you as you run through the grounds towards the exit, your speed being slowed by the weight of your sister.  When you reach the gates to Langdown Hall, you find a taxicab waiting there patiently.  You don't question it, you just get in with your mentor close behind and yell \"Just go!\" to the man who shakes the reins of the horses and sets off at a trot.\n\n\n......\n\n\nYou found out later that your mentor had managed to arrange the taxicab, you don't know how you will ever repay the debt you feel you owe to her.\n\n\nWhen the police went to Langdown Hall after you explained to them what had happened, all the cultists were gone and the attic was completely empty.  Your sister was safe though and that's all that mattered to you.\n\n\n \n\nTHE END", "action_results": []}, {"action": "If you didn't find the notes, click here.", "result": "You are contemplating the circle of cultists when suddenly, your mentor appears next to you, crouched down just as you are, with her eyes closed and chanting.  You start with panic when you see her appear like that, you don't want the cultists to know she is here!  She is obviously spellcasting though, and with nothing else happening, you realise that she hasn't just appeared to everyone, she has extended her veil to include you as well.  You're not sure if she can listen to you whilst she's casting the veil, which obviously takes a lot more concentrated effort than just veiling herself, but you try anyway.\n\n\n\"Can you keep doing this whilst I go in and get Amelia?\" you whisper to her.\n\n\nThere's no response from your mentor as she continues to crouch there with her eyes closed and chanting.  Then you notice a tiny nod and you can only hope that was her way of agreeing with you.\n\n\n\"Ok.\" you whisper, steeling yourself for what you need to do.\n\n\nYou stand up and touch your hand to your belt where the dagger is tucked.  You grab the hilt and draw it.  You have to wonder how far you are willing to go to rescue your sister, could you take the life of one of these monsters to save her?  Could you take two lives? Three?  Where would you draw the line?\n\n\nYou start walking towards the circle of cultists, still unsure as to how you will handle this when you inevitably have to make that choice.  As you approach the circle, you get a view of what they are surrounding.  In front of the cultists is a seemingly random array of black candles and other small objects which you can't make out.  There is a white symbol painted onto the floor which swoops around and has a line intersecting the curve.\n\n\n \n\nIn the middle of the shape created by the lines is your sister, lying on her side, bound and gagged with tears silently running down her face.\n\n\nYou manage to stop yourself from breaking into a run when you see Amelia like that but you hold back your muscles from making you sprint and instead, you carefully step between two cultists so that you're inside the circle without them even knowing you're there, their chanting never faltering.\n\n\nYou reach your sister, bend down and whisper in her ear, \"It's ok, I'm here to take you away from here.\"  Her eyes go wide and she starts to thrash about in absolute panic.  \"No, it's me!\" you say whilst using the dagger to cut her bonds but you realise that in your attempts to calm your sister, you were quite audible to the cultists around you.\n\n\nThe chanting suddenly gets louder and several of the cultists jump in towards you with two of them managing to land on top of you.  You feel your mentor's veil disappear from you as it has obviously become too tricky for her to maintain it.\n\n\nThe dagger is wrestled from your hand and used to slit your throat before you can do anything about it.\n\n\nYou never got to see if your sister got away or not.  You could only hope that your mentor was able to do something to save her at least.\n\n\n \n\nTHE END", "action_results": []}]}, {"action": "If you didn't find the dagger, click here.", "result": "You start to lift the hatch from the opposite side to where the hooded figures are standing so that the hatch will hopefully hide your entry to the room a little.\n\n\nYou get really nervous the higher you lift the hatch, especially when you can't see the hooded figures to know if they have seen you or not.  When the hatch is almost upright, it starts to slip a little and you panic as you grab it back to stability; you grab it with your other hand just as it started to fall and you breath a silent sigh of relief.  Luckily the slip happened silently and the chanting never faltered, maybe luck is on your side you wonder.\n\n\nYour adrenaline is really surging through you now and your muscles are begging for you to run, use that adrenaline to get out of there, but you're not leaving without your sister, that's just a truth that you've known since you first read the letter they sent you.\n\n\nYou get both of your feet onto the attic floor, still crouched as low as you can manage and you wait until you feel your mentor climb up into the attic too before you lower the hatch down, although you leave it only half covering the hole as you need to get out of here quickly once you've got your sister.  You move as quietly as you can to the back of the attic, away from the hooded figures, still at a crouch and turn to look over at the circle of what you're sure now are cultists.", "action_results": [{"action": "If you found the notes about who was needed for the ritual, click here.", "result": "You think back to the notes you found in the parlour earlier and realise that might be quite important.  What did it say again?\n\n\nBlood of an innocent.  Magical blood, family connection.\n\n\nFind an apprentice, we don't want anyone with any real power here.\n\n\nNight of the full moon is the most powerful.\n\n\nThey need magical blood as well as the blood of an innocent, which is why they sent you the letter, to get you to come here of your own accord, and it's why they chose your sister as the innocent, to make sure you would come.  Now you're in the attic, you're giving them everything they need for their ritual, but you can't get your sister out without being up here.  What you've also brought though, is your mentor and they have no idea she is here, you can only hope that makes all the difference.\n\n\nSuddenly, your mentor appears next to you, crouched down just as you are, with her eyes closed and chanting.  You start with panic when you see her appear like that, you don't want the cultists to know she is here!  She is obviously spellcasting though, and with nothing else happening, you realise that she hasn't just appeared to everyone, she has extended her veil to include you as well.  You're not sure if she can listen to you whilst she's casting the veil, which obviously takes a lot more concentrated effort than just veiling herself, but you try anyway.\n\n\n\"They need me for the ritual as well.\" you whisper, your mouth very close to her ear so as to only be audible to her.  \"We need to get her out without letting them grab me too.\"\n\n\nThere's no response from your mentor as she continues to crouch there with her eyes closed and chanting.  Then you notice a tiny nod and you can only hope that was her way of agreeing with you.\n\n\n\"Ok, so we need a plan.\" you whisper hopefully and look at your mentor again.  She continues on chanting and you wish more than anything you were back in the laboratory being taught by her again, no matter how hard the lessons were, they always made sense, you always knew what you were meant to be doing even if you couldn't do it.\n\n\n\"Well, there's about a dozen of them,\" you whisper, trying to count the cloaked figures, \"if we just try and take Amelia, even veiled, there's enough of them to stop us.\"\n\n\nYou crouch there looking over at the circle of figures and wistfully whisper \"If only I could look like them.\"  At that, your mentor's eyes flick open and she looks right at you, nearly making you fall over backwards in surprise before she disappears.\n\n\n\"Yes!\" she whispers back to you and you wonder what she has planned now.  You're feeling very exposed now, no longer veiled, but the circle of chanting cultists don't seem to be paying any attention to you luckily.\n\n\nYou feel an energy falling over you and you realise it must be your mentor's doing.  You look down at yourself and see that your brown apprentice robe is now black.  You pull the hood up and find that it has deepened like the robes of the cultists, so that it now hides your face completely.\n\n\n\"How do I look?\" you whisper to your mentor but she doesn't respond; keeping up her veil and maintaining the robe change must be using up all of her concentration like the double veil had.\n\n\nYou stand up and try to emulate the postures of the cultists in the circle, upright with steady shoulders, robe hood well forward but head up straight.  You're still not sure how you're going to play this out, but you're feeling like you have a chance now.\n\n\n......\n\n\nYou stride confidently over to the circle of cultists and as you approach, you get a view of what they are surrounding.  In front of the cultists is a seemingly random array of black candles and other small objects which you can't make out.  There is a white symbol painted onto the floor which swoops around and has a line intersecting the curve.\n\n\n \n\nIn the middle of the shape created by the lines is your sister, lying on her side, bound and gagged with tears silently running down her face.\n\n\nYou see a gap wide enough between a couple of the cultists and go to stand in between them but before you get there, you realise that you're not chanting as they are and that might give the game away.  You quickly try to emulate the sounds they're making though they don't seem to be making words other than Langdown in the middle of it.\n\n\n\"Ffloo mwaf gralk Langdown wahg ftah\" you say with them.\n\n\n\"Fnloo mgwaf grthalk Langdown wgahn ftag\" you try the next time.\n\n\n\"Fngloo mgwnaf grthalkth Langdown wgahnag fhtagn\" you manage the third time.\n\n\n\"Ph'nglui mglw'nafh Grthalkpth Langdown wgah'nagl fhtagn\" you flow into saying just as you reach the circle and stand between the cultists.  They don't seem to even acknowledge you arriving there.\n\n\nYou stand in the circle of cultists, chanting their strange phrase with them a few times whilst you decide the best way to do this.  You look around the floor at the various ritual objects being used and you see a bone which has been carved into a shiv which looks to be your best hope.  You take a deep breath and step forwards towards your sister scooping up the bone shiv from the ground on the way.\n\n\nYou sister starts to write about in her bonds, clearly terrified and you hate yourself for doing this to her, but it's the only thing you can think of.  You crouch down and pull her up into a sitting position and position the bone shiv in front of her throat with your other hand holding her by the neck.  The cultists haven't moved but their chanting is getting louder and you manage to suppress a shiver.  You draw the bone shiv across her neck.\n\n\nYou were expecting to get some blood trickling between your fingers then but your bluff hasn't worked and the bone shiv wasn't sharp enough to cut your hand to look like you had cut your sister's throat.\n\n\nIn your desperation of the only plan you had not working, you pick up your sister to instead try and run with her to the exit.  The cultists have realised that you're not one of them though and several of the cultists jump in towards you with two of them managing to land on top of you.  One of the cultists produces and dagger and uses it to slit your throat before you can do anything about it.\n\n\nYou never got to see if your sister got away or not.  You could only hope that your mentor was able to do something to save her at least.\n\n\n \n\nTHE END", "action_results": []}, {"action": "If you didn't find the notes, click here.", "result": "You are contemplating the circle of cultists when suddenly, your mentor appears next to you, crouched down just as you are, with her eyes closed and chanting.  You start with panic when you see her appear like that, you don't want the cultists to know she is here!  She is obviously spellcasting though, and with nothing else happening, you realise that she hasn't just appeared to everyone, she has extended her veil to include you as well.  You're not sure if she can listen to you whilst she's casting the veil, which obviously takes a lot more concentrated effort than just veiling herself, but you try anyway.\n\n\n\"Can you keep doing this whilst I go in and get Amelia?\" you whisper to her.\n\n\nThere's no response from your mentor as she continues to crouch there with her eyes closed and chanting.  Then you notice a tiny nod and you can only hope that was her way of agreeing with you.\n\n\n\"Ok.\" you whisper, steeling yourself for what you need to do.\n\n\nYou stand up and start walking towards the circle of cultists, still unsure as to what exactly you're going to do when you get there.  As you approach the circle, you get a view of what they are surrounding.  In front of the cultists is a seemingly random array of black candles and other small objects which you can't make out.  There is a white symbol painted onto the floor which swoops around and has a line intersecting the curve.\n\n\n \n\nIn the middle of the shape created by the lines is your sister, lying on her side, bound and gagged with tears silently running down her face.\n\n\nYou manage to stop yourself from breaking into a run when you see Amelia like that but you hold back your muscles from making you sprint and instead, you carefully step between two cultists so that you're inside the circle without them even knowing you're there, their chanting never faltering.\n\n\nYou reach your sister, bend down and whisper in her ear, \"It's ok, I'm here to take you away from here.\"  Her eyes go wide and she starts to thrash about in absolute panic.  \"No, it's me!\" you say whilst trying to untie her bonds but you realise that in your attempts to calm your sister, you were quite audible to the cultists around you.\n\n\nThe chanting suddenly gets louder and several of the cultists jump in towards you with two of them managing to land on top of you.  You feel your mentor's veil disappear from you as it has obviously become too tricky for her to maintain it.\n\n\nOne of the cultists produces and dagger and uses it to slit your throat before you can do anything about it.\n\n\nYou never got to see if your sister got away or not.  You could only hope that your mentor was able to do something to save her at least.\n\n\n \n\nTHE END", "action_results": []}]}]}, null]}, null, null, {"action": "Return to the corridor and then go back to the previous corridor.", "result": "You back along the corridor and turn the corner to the left. You're faced with the same three doors on the left and the corridor at the end which leads to the stairs down to the games room where you came up from..\n\n\nWhere do you go?", "action_results": [null, null, null, null, null]}]}, null]}, null, null]}, null]}, null, null]}, null, null, null]}, null, null, null, null]}, null]}, null, {"action": "Go to the branching corridor.", "result": "You take a few steps forwards and turn into the corridor to your left.  It was probably the shadows cast by your candle as you turned, but it looked for a moment like a dark figure moved quickly from somewhere on the corridor to the right.  It's probably your paranoia but you look all around you, checking you're alone just in case.\n\n\nYou start to walk down the corridor until you can see that there is a door to your left, a door a little further down to your right, a door further down from that on your left and another ornate window at the end of the corridor.  The light from the window at the end of the corridor looks a little different on the right-hand side compared to the left-hand side and you wonder if there is something else down there too.\n\n\nWhich way do you go?", "action_results": [null, {"action": "Go through the first door to the left.", "result": "You walk the few paces to the closest door and see that it is already slightly open.  You push the door open tentatively and stand back for a moment.  Nothing happens.  You step forwards into the doorway allowing the candlelight to be cast into the room.\n\n\nYou give a sharp intake of breath when you see that this is, or rather was, a child's room, and it resonates so strongly that this could be easily your sister's room.  The bed in the centre of the right side wall, looks so small even compared to the area you sleep in at the laboratory; the bed is neatly made, the bedding all left in place as though people still loved here.  You move over to the bed and see blue stars and angels embroidered on the top blanket, this was obviously a little girl's room.\n\n\nA chest of drawers stands against the opposite wall, with a small mirror and hairbrush on top of it.  A tiny rocking chair with a small tasselled cushion on it sits in a corner, perfectly still, with a porcelain doll in a white dress propped onto the seat, awkwardly leaning to one side.\n\n\nYou look underneath the bed, ignoring a childhood fear of monsters underneath your own bed, but find only balls of dust there.  You walk over the chest of drawers and methodically open each drawer, only to find them all completely empty.  You kneel down and look underneath the chest of drawers and see a small leather suitcase.  You grab the suitcase by the handle, undo the buckles and open the case.  Inside is what was probably once a much loved bear, his fur worn and matted, one ear torn a little from its head.  You wonder what happened to the child who used to love here and if they missed the bear they left behind.\n\n\nThe room makes you feel a keen sense of loss for a your sister's childhood as she suffers whatever ordeal she is being put through and you fight the melancholy this brings on in order to keep looking for her and to do your best to save her.  You put the child's room behind you, leaving the room and closing the door behind you.\n\n\nWhich way do you go?", "action_results": [null, {"action": "Go through the door on the right.", "result": "You open the door of the room on the right and find to your surprise that there is already a light in this room, a candelabra on the other side of the room sits burning five black candles and illuminating the room better than the small candle you are carrying can.\n\n\nThe room is dominated by a large, four-poster bed, with purple velvet hangings closed around every side.  A small table flanks the bed on each side and a small leather chair nestles in the corner on one side.  At the foot of the bed, a large trunk stands the width of the bed and you can see a large metal catch on the front of it.\n\n\nA large glass or crystal chandelier hangs from the ceiling in the middle of the room, reflecting the light from both the candelabra on the far side of the room and the candle in your own hand.  To your left and right against the same wall the door is on, are two large wardrobes and a large chest of drawers and in the centre of the room is a small, round table with a glass tabletop.\n\n\nOn the wall opposite the door is a large, sweeping bay window area with a chaise lounge filling most of the area within it.  The curtains are open and the moon is contributing its light to the room as well.  To the right is a dressing table, on which the candelabra is stood, with three mirrors attached to the back of it, allowing the candlelight to bounce off them and be sent to more corners of the room, illuminating several small seats around the furniture in the room and a large full length mirror stood in the corner near the dressing table.\n\n\nYou allow the door to swing fully open and you continue pushing it open until it has reached the interior wall for fear that someone could have been hiding behind it, as certainly someone was here very recently who had lit the candles.  You step very cautiously into the room, looking all around you at all times, expecting whoever lit those candles to still be here, but you make it over to the chaise lounge without anyone bursting out from a wardrobe or underneath the bed or anything, although you know that doesn't mean that they won't of course.  You feel reassured by the invisible presence of your mentor and you even manage not to jump when she whispers in your ear \"Caution apprentice, we may not be alone.\".\n\n\nThe room has been decorated in pale gold and dark wood, giving the furniture a deep contrast to the soft furnishings, all except for the bed which looms in darkness as it stands away from the candles and the moonlight with the curtains in a deep purple colour.  There's something about the bed which is making you feel uneasy and you instinctively go to the other side of the room instead.\n\n\nYou open one of the drawers in the chest of drawers and find it full of clothing for a gentleman, seemingly clean and freshly pressed.  You open another drawer and find the same, in fact all of the drawers when you open them contain similar clothes; this is the first room you've gone into which seems as though it is being lived in, which is simultaneously comforting as something so familiar, and disconcerting as you don't know who they are or what they're capable of.\n\n\nYou go to the dressing table and find a variety of grooming items lying on the table next to the candelabra, including a comb, a shaving brush, moustache wax and a razor.  You pick up the razor and open it out, the blade looks well cared for.  You hold a section of your robes taut and drag the razor across the fabric, it makes a clean cut straight through the thick material and you nod your head approvingly at the sharpness.  You close the razor and drop it into a pocket in your robes.\n\n\nYou very hesitantly approach the closest of the large wardrobes, a modern item of furniture which seems very oversized to you, and unnecessary when clothes being folded in drawers was perfectly sufficient.  As the wooden towers loom over you now, your opinion of them worsens and you vow if you make it through this alive, you'll never get a wardrobe, even if you manage to become a very successful wizard.  You unhook the latch on the door, pull the door open and step back in one smooth, quick motion.\n\n\nYou jump to one side when you see a shadowed figure inside the wardrobe and you manage to fumble the razor into your hand with the candle in the other hand but you don't manage to open the razor before you hear your mentor whisper \"Calm down.  There's no-one there.\".  You then realise that the figure hasn't left the wardrobe.\n\n\nYou hold your candle up towards the wardrobe and take a step closer.  You then almost smack yourself in the head for your own foolishness, it's a dinner suit hanging up with a top hat on the shelf above, not a person at all.  You chuckle to yourself slightly in relief and walk up to the wardrobe and open the other door.  The other side of the wardrobe has a few suits hanging up as well and you close the doors smiling to yourself.  Then you look over to the other wardrobe.\n\n\nWhat do you want to do?", "action_results": [{"action": "Open the other wardrobe.", "result": "You're feeling far less intimidated by the other wardrobe after your paranoid overreaction to the first one and you confidently stride over to the second wardrobe, flick open the catch and open the door.\n\n\nAll confidence leaves you as you yelp and leap backwards in pure, primal terror.  Your back is against the bay window before you even realised you had moved and you're staring fixedly at the open wardrobe door.\n\n\nAcross the open doorway is a very large web covering the entire door and sat in the middle of the web is a gigantic spider, the like of which you have never seen before.  From the size of it, you can only assume it has been feeding on rats or birds or maybe small children, and a picture of Amelia flashes across your mind.\n\n\n\"It's probably more afraid of you than you are of it.\" whispers your mentor to you but this doesn't reassure you in any way.  You're just managing to focus your mind to think about moving, when the giant spider beats you to it and starts to climb down its monstrous web.  You stand very still, hoping not to attract the attention of the beast spider as it starts to lower itself from a newly spun web down the front of the wardrobe.\n\n\nIt lands on the floor and you actually hear it thud onto the rug when it touches down.  All of your instincts are screaming to move, to get off the floor, to get to a different level to where the spider is, but you're too scared to move and you just keep watching the spider instead.\n\n\nIt starts walking across the room, not towards you but towards the bed.  It gets to the foot of the bed, stops, turns, and starts moving directly towards you.  This is too much for you and you leap on top of the chaise lounge, pulling your robes high up with you around your knees, being sure not to give the spider a way of easily climbing up.\n\n\nYou were so fixated on the spider that you didn't notice the candelabra floating across the room until the flames were being thrust at the monster.  Your mentor has saved you!  The huge spider turns, and this time runs straight out of the door, faster than any creature should be able to travel.  You dash across the room and quickly close the door after it and your heart starts to slow down a little.  It's far too big to be able to get in through the gaps around the door, you're safe from it now.  You kick the wardrobe door closed again and hope there wasn't another one in there too.\n\n\nIn the meantime, you mentor replaced the candelabra onto the dressing table.\n\n\n\"I didn't know they could get that big!\" you whisper to your mentor after getting your breathing back under control and your heart beating at a normal, if slightly quickened, rate again.\n\n\n\"I must admit that I've never seen one quite that size in this country.\" whispers your mentor back to you.  \"I do fear that dark magics have affected the creatures here; this isn't a place I would want to linger in.\"\n\n\n\"Then let's keep looking.\" you reply and you decide to open the trunk at the foot of the bed and hope not to find another monster inside this one.", "action_results": [{"action": "Continue", "result": "The trunk has a catch on it with a slot for a padlock but there isn't one attached.  You flip up the catch, grip it and use it to pull up the lid.\n\n\nInside, the trunk is full of black.  You hold the candle closer, leaving the lid of the trunk leaning back against the bed, and yes, it's completely full of black.  You grab some of the black and pull it out, it's a black cloth which seems to absorb all light from around it.\n\n\n\"I'm getting a very negative energy from this.\" whispers your mentor in your ear.  You place the candle on the little glass table behind you and use both of your hands to shake the material out and you find that it's a robe, not that dissimilar to yours but with a large hood which would fall forwards to cover the face on any normal sized person.\n\n\nYou start to throw the robe around your shoulders but the material's movement is stopped dead by something before it reaches your shoulders.\n\n\n\"No, you mustn't!\" whispers your mentor with a worried tone.\n\n\n\"But this could be a great disguise.\" you whisper back.  \"If I can look like one of them, I might be able to get in closer to Amelia and take them by surprise.\"\n\n\nYour mentor pauses for a moment and then lets go of the cloth.  You go to throw it around your shoulders again and this time it arcs smoothly around to your back, on top of your apprentice robes.  You fasten the catch around the front of the robe and put the hood up, letting it fall down in front of your face.  Something feels very wrong about wearing the robe, you get a really bad feeling all the way up your spine and your instincts are screaming at you to take it off.\n\n\nWhat do you do?", "action_results": [{"action": "Take the robe off.", "result": "When it comes to magic, your mentor knows what she's talking about and if she thinks you shouldn't put the robe on, then you will listen to her.  You shove the robe back into the trunk but just before you let go of it, your mind starts to see visions of a ritual circle.  When the robe hits the trunk, the wave of negative energy and then the hit of it no longer being there, turns your stomach into knots and you find yourself retching next to the trunk.\n\n\nYou take a few deep breaths and centre your energy, calming your stomach and more importantly, your mind.  In the meantime, your mentors slams the lid of the trunk down on top of it the foul-energied thing and you breath a sigh of relief.\n\n\nOnce you're over the trauma of having held the robe, the disappointment of a missed opportunity hits you as you think about how good it would have been to be able to blend in with your enemy and then strike with the element of surprise from within their own ranks.  You shake your head, reinforcing to yourself that it wouldn't have happened like that, that the robe had been worn through so much evil magic that it buzzed with negative power, that you would most likely have joined their ranks rather than struck at them from within them.  You focus your mind and stand up, moving on from the horrible experience altogether.\n\n\nYou look around the room and the bed and area around it are the only part of the room you haven't examined, though it seems the least likely area to hold any answers as well.\n\n\nWhat do you do now?", "action_results": [{"action": "Look further around the bed area of the room.", "result": "You pick up the candle and walk around the right hand side of the bed and to the small table stood next to it.  The bed itself is hidden by the deep purple curtains hanging from the canopy.  You pull the nearest curtain to one side and hold your candle up high; you see that the bed is elaborated covered in bedding and soft furnishings with golden blankets and purple pillows and cushions and a golden bolster with a purple trim at the foot of the bed.  When you look closer, you notice that some of the bedding is pulled back on the side furthest from you as though it was recently slept in.\n\n\nYou draw back from the bed itself and turn your attention to what is around it.  The little table stands empty next to the bed and there doesn't look to be anything else around here.  You move around to the other side of the bed where the bedding was disturbed.  The little table on that side has an unlit candle sat on it with a small, leather bound book next to it.  You move over to the table and take a closer look at the book.  You flick through the pages but they're all covered in the strange symbols like the ones from the letter you were sent, you can't read any of it so you put it back down.\n\n\nYou steel yourself for the part you have been putting off, you take a deep breath and then you get down onto all fours and hold the candle carefully underneath the bed.\n\n\nThere is nothing under there.  You peer around a bit more, looking for anything strange, a trap door or something perhaps, but there's nothing and you wonder why you had been avoiding looking there for so long.\n\n\n\"I felt like there was something here.\" whispers your mentor, echoing your own thoughts.\n\n\nYou shrug and reply \"If there is, I can't find it.\"\n\n\n\"Ok, let's move on then, we're wasting time here.\"\n\n\n \n\nWhere do you go now?", "action_results": [null, {"action": "Return to the corridor and go through the second door on the left.", "result": "You walk down the dark corridor until your candle lights up the second door on the left and you can see this door has an engraving in the wood; you hold the candle up to it and you're surprised to see that it's an engraving of a rabbit, a very innocent looking picture which jars against the fear and anxiety you're feeling.  You turn the handle and step into the room and you're not surprised to see this is a room for a child.\n\n\nTo your right is a wooden cot, painted white which reflects the light of the candle making it almost feel as though it's glowing in the darkness of the room.  There was a rocking horse nearby, the back well worn and the hair slightly tangled, the right size for a child of around three or four years old.  A wooden train set was on the floor near to the cot, the engine piece missing and half of the carriages on their side.  There are two windows, their curtains drawn, on the wall opposite the door and when you look at the wall to the left of the door you see a blackboard hung on it with something written on it.  The most dominant feature of the room however, is against the left hand wall, taking up most of that side of the room, an enormous dollhouse.\n\n\nYou walk into the room and over to the cot.  On the floor next to the cot lies a wooden mobile with carved airships attached on strings, also painted white just like the cot.  The cot itself is completely empty, no mattress or bedding, just bare wood.  You move over to the rocking horse and it suddenly starts to rock back and forth.  You jump backwards and let out an unintentional yelp but your mentor whispers urgently \"Sorry! That was me!\".  You take a few slow deep breaths and your heart starts to slow down.\n\n\n\"Some warning next time.\" you whisper harshly to your mentor but there's no reply and you realise why, it's not your place to chide your mentor and she obviously isn't happy with you for doing so.\n\n\nYou decide to move on and you turn around and move across the room until you are in front of the blackboard, you hold your candle up high to illuminate the neat, cursive writing.\n\n\n \n\nHow sharper than a serpent's tooth it is to have a thankless child.\n\n\nEavesdroppers never hear good of themselves.\n\n\nDiscretion is the better part of valour.\n\n\n \n\nYou were expecting to see more of the strange symbols you seem to keep stumbling upon but instead this seems to be lessons for a child, although you can't help but feel that these lessons were trying to stop a curious child from finding out secrets in the house, or that could be your justified paranoia of your own reasons for being here.\n\n\nHaving exhausted the rest of the room, you turn your attention to the dollhouse.  The design of it reminded you more of a castle than a house, with towers and crenulations, it even had a clocktower which you had certainly never seen on a dollhouse before.  When you peer closely, you see that the time on the clock read a quarter past four and you realise that the clock is working and accurate.  There are half a dozen staircases  and over a score rooms, each room fully furnished with everything a modern home could possibly desire, including quite a few interesting looking miniature contraptions you don't recognise and can't even imagine what they do.  In an annex of the dollhouse, you see what looks to be a boiler room, though you're not sure what it could be powering, it certainly wasn't a ship, though perhaps it is meant for the odd contraptions you can see.\n\n\nYou start to look closer at each of the rooms, looking for a clue.  \"What are you looking for?\" whispers your mentor to you.\n\n\n\"I have no idea.\" you reply honestly.  \"It just feels like there must be something here.\"\n\n\n\"Alright.\" whispers your mentor and you look methodically from room to room, trying to see anything which looks out of place.  It's difficult in the candlelight though and without knowing what you're looking for, you don't see anything which might be helpful.\n\n\n\"Find anything?\" you whisper to your mentor.\n\n\n\"Nothing.\" she replied, \"Let's move on.\"\n\n\n \n\nWhich way do you go?", "action_results": [null, null, null, {"action": "Go to the end of the corridor and see if there is anything there.", "result": "You walk along the corridor towards the large ornate window at the end of the corridor.  As you approach the window you can see from the light of your candle that the corridor continue around to the right, along the back wall of the house which is lined with windows.  Each window is different and when you look closer at them you can see that they are depicting different creatures, they look like monsters to you, with tentacles and great bat-like wings.\n\n\n\"I would recommend averting your eyes,\" whispers your mentor quietly in your ear, \"I'm getting a sense of power from those images.\"  You shudder and try your best to pull your eyes away from the windows.\n\n\nYou follow the corridor down, trying not to look at the windows but each of them seem to show at least one person being devoured or destroyed by the monster depicted and you can't seem to keep your eyes off them.\n\n\n\"Look.  Away.\" whispers your mentor in a tone you're very familiar with and you instantly obey, just in time to see that you were about to walk into a wall at the end of the corridor.  You look around to see a door on the wall opposite the windows.\n\n\nDo you go through the door?", "action_results": [{"action": "Go through the door.", "result": "You open the door into a room with a tiled floor and a large copper bath in the centre of the room with ornate claw feet.  A large tap rises from the floor and curves over the edge of the bath with a valve on the side of the pipe.  The copper of the tub is no longer shining and is starting to turn a little green with age a lack of attention.\n\n\nThe walls are tiled up the midway point in the same green colour the copper bath was turning.  A large wooden cabinet stands on one side of the room with two copper washbasins atop it, each with a copper pipe curving over the top of the bowl and a valve on the side of the pipe.\n\n\nIn the corner of the room is a porcelain toilet, to your surprise not separated from the rest of the bathroom which strikes you as somewhat unhygienic.  The water system sits high on the wall above the toilet with a chain hanging down finished with a copper handle.\n\n\nYou walk around the room, looking for anything unusual or out of place but other than the toilet being open in the room, you don't see anything strange.  You open the doors of the wooden cabinet and see only the pipes from the washbasins going through the back of them, down into the floor.  You turn the valve on one of the pipes to see if the plumbing was working and the pipes start to loudly bang and click before cold water then pours out of the tap but there's nothing strange about it and nothing else happens.  There doesn't seem to be anything of any use to be found in this room and you decide to leave and return to the previous corridor.\n\n\nYou leave the room and walk down the corridor, trying not to look at the windows again but finding it impossible to stop staring at them.\n\n\n\"Control!\" whispers your mentor in your ear.  You know she's telling you to stop staring at the windows but you just can't stop it.  Suddenly, you're forcibly turned to the wall opposite the windows and you realise your mentor has physically grabbed you and turned you to break your eye contact with the windows.  You shake your head and try to come back to yourself.\n\n\n\"I'm ok.\" you whisper and you put one hand up to the side of your face to block your view of the windows as you return to the corridor you came from.", "action_results": [null]}, null]}]}, null, null, null]}, null, null, null, null, null]}, {"action": "Keep the robe on.", "result": "Your instincts are telling you to take the robe off, but your rational mind is telling you that this is a disguise, that you can blend in with your sister's captors and rescue her from the jaws of death.  You know where to go, you feel it, you know the path directly to her.\n\n\nThe hood falls further over your face and you start to feel enveloped by the robe now.  Yes, you remember now, the summoning.  The blood ritual is near, you can feel how close you are now, you can almost taste the girl's fear.  You just need to get to the ritual site.  And the magical blood, you must give the magical blood.  You must go there now.\n\n\nYou move round to the side of the bed, reach underneath the bed and push the hidden lever and walk quickly up the revealed staircase.  You emerge into the wardrobe into the old servants' quarter, unlatch the door and cross the small bedroom and out the door.  You move swiftly around the corner, down the corridor and into another room.  You pull out the ladder, and start climbing it into the attic to join your fellow cultists.  Grthalkpth must be summoned.  The innocent must be sacrificed, and the wizard too.\n\n\nYour foot stops suddenly as you climb the ladder.  You tug on your foot and it doesn't move.  You look down and nothing is there but your foot is caught on something.  You kick your leg, making contact with something and the invisible obstacle is gone and you continue climbing the ladder.\n\n\nThe others are already here, gathered in a circle around the symbol of Grthalkpth  painted on the floor in the blood of the collective cultists with the innocent already in position inside it.\n\n\n\"Ph'nglui mglw'nafh Grthalkpth Langdown wgah'nagl fhtagn.\" you recite in unison with the others as you move closer to the girl lying crying on the floor.\n\n\n\"Ph'nglui mglw'nafh Grthalkpth Langdown wgah'nagl fhtagn.\"\n\n\nShe turns her face to you and her expression changes to one of shock and horror.\n\n\n\"Ph'nglui mglw'nafh Grthalkpth Langdown wgah'nagl fhtagn.\" you say as you bring the dagger in your hand down into her chest, she cries out in pain as you hold her down until she stops moving before you turn the dagger on yourself.  You plunge the blade into your chest and you feel your heart stop when you penetrate it.\n\n\n\"Ph'nglui mglw'nafh Grthalkpth Langdown wgah'nagl fhtagn.\" you say with your last breath before joining your sister in a pool of blood.\n\n\n \n\nTHE END", "action_results": []}]}]}, {"action": "Ignore the wardrobe and search the rest of the room except for it.", "result": "As you look at the second wardrobe, all confidence you got from opening the first one ebbs away and you get a really bad feeling about it.  Something inside you is telling you that you really don't want to open it.  You decide that you can search the room without looking in that piece of furniture, if your sister were in there then she would have called out to you after all, so if there is anything, or anyone, in there then it can't be good.  You walk quickly past the wardrobe and head straight over to the large trunk standing at the end of the four poster bed.", "action_results": [null]}]}, null, null]}, null, null, null, null]}, null]}, null, null, null]}, null, null]}, null, null, null]}]}, null]}, {"action": "Explore this floor.", "result": "You decide that this probably isn't a map to find your sister, there was no way that the people who took her, the people who had put such a curse into the letter they sent to you, would leave you a map to find her on the table as soon as you came into the house.  This was probably a map to a trap and there was no reason to follow it, in fact following it was probably exactly what they wanted you to do when they left it there.  You decide that you will continue on looking for your sister as you were.\n\n\nWhich way do you go?", "action_results": [null, null, null]}]}]}, null]}]}, null, null, null]}, {"action": "Leave the box and continue searching the room.", "result": "There is no reason you can think of as to why this box would have been left for you if it contained anything good.  Whoever left this here did so to try and mess with you, either emotionally or as another booby trap like the letter was and you're not going to fall for it .  You step away from the table and continue to look around the room.\n\n\nThere is a large dark wood sideboard along one wall with a large vase in the centre of it and a mirror hanging above it.  You jump when you first see your candlelit reflection in the mirror, you barely even recognise your face when you take a closer look as worry and desperation has contorted it.  As you peer at yourself in the mirror, you think you glimpse a shape, a person perhaps, moving behind you.\n\n\nYou turn around quickly, but the room is empty.  You crouch down and look underneath the large table, all you can see is a plethora of chair legs and the large sturdy columns supporting the table.  You stand up again and press your back against the sideboard, glad to have something at your back, whilst you wait for your heart to slow down and you breathing to steady.\n\n\nYou literally jump in the air when the loud bongs of a grandfather clock start to chime in the room with you, particularly as you hadn't even heard it ticking.\n\n\nBONG, BONG, BONG, BONG.\n\n\nThe sound feels deafening against the silence of the house and it rings in your ears after it the clock has finished chiming.  Then another four bongs sound this time muffled though a wall; there must be another clock in the hallway that you never saw.\n\n\nYou take a few deep breaths and finally feel calm enough to move.  You turn around to face the sideboard again.  It has about half a dozen cupboards and drawers which you open in turn.  The cupboards all contain very fancy plates and serving dishes, you idly wonder just how much they're worth, left behind in this grand old house.  The drawers all contain silverware, carefully laid out in each drawer with care but tarnished with neglect now.  The final drawer you check, doesn't open.\n\n\nYou shake the drawer a bit, you pull harder, it doesn't move.  You bend down and take a closer look, but there's no keyhole, no sign of what is stopping it from opening.  You grab a large table knife from one of the other drawers and try to prise the drawer open, but all you do is scratch the varnished surface of the wood.  You sigh and give up, moving on to the rest of the room.\n\n\nAt the far end of the room is a glass doored cabinet which reaches almost as high as the ceiling.  The doors to this are locked but you can see through the dusty glass at the displayed plates with beautiful paintings on and large crystal bowls and glasses.\n\n\nOne wall has large curtains hanging over most of it and when you pull them back, they reveal huge glass doors which can open onto a terraced area outside.  You try each of the doors but they're all locked.\n\n\nWith nothing else of interest in the room, you decide you return to the corridor outside it.\n\n\nWhich way do you go from the corridor?", "action_results": [null, null, null, null]}]}, null, null, null]}]}]}, null, null]}]}, null, null, null]}, {"action": "Go through to the door to side.", "result": "You and your mentor step out of the taxicab about a quarter of a mile away from Langdown Hall at a quarter to three o'clock in the morning.  The note said to come alone but your mentor insisted on coming and at the end of the day, she's your boss.\n\n\nShe pays the taxicab driver and tips in him extra saying \"You never saw us.\" before he shakes the reins and the horses set off at a trot.\n\n\n\"This isn't going to work,\" you say worriedly,, \"they're going to know you're here.\"\n\n\n\"Nonsense.\" she replies confidently.  \"Now just wait there a moment whilst I concentrate on this.\"\n\n\nYou watch, holding your injured arm protectively as she picks up a stick from the ground and uses it to draw a circle in the dirt around her.  She then takes a bag of powder from her pocket, sprinkles some on her head before closing her eyes and murmuring some words you can't make out.  Then in the blink of an eye, she isn't there anymore.\n\n\n\"Master?\" you ask hesitantly to the spot where she had been stood a moment before.\n\n\n\"Shhhhhh!\" comes the whispered reply.  \"Don't go talking to me like that or you'll give the game away!\"\n\n\n\"Right.\" you whisper back, finding the whole thing quite unnerving.  \"Shall we go then?\" you whisper, pointing to the hall.\n\n\n\"Stop acting like you're talking to someone.\" snapped your mentor in a harsh whisper and the familiar sense of being told off by her kicked your brain into instant obeyance.  You turn and start striding down the path towards Langdown Hall.\n\n\n......\n\n\nWhen you reach the gates to the grounds of the hall, you look nervously around you, wary of an ambush.  You can't even hear the footsteps of your mentor; you know she's masking the sound of her walking in the same way she is masking the sight of her but you can't help but wonder if she is still with you or not.\n\n\nYou push open the gate and it swings open with no resistance and with an eerie sounding creak.  You cautiously step through into the grounds of Langdown Hall and hope your mentor is following you.\n\n\n \n\nLangdown Hall is an old stately home which had been without an occupant for a number of years after the family who owned it died out and the distant relative they left it to wasn't able to pay for its upkeep.  The stone of the building was black with ornate windows and rounded towers at the corners.  Everyone knew the building but there were varying reports of the size of it inside.  Whichever rumour you chose to believe though, the house was indisputably vast and imposing.\n\n\nThe night is clear and the full moon is casting deep shadows in the gardens of the grounds; you wonder if there is anything lurking in those shadows and your eyes dart about all around you as you walk along the path leading up to the huge oak door.\n\n\nYou reach the door with nothing having jumped out on you, though you're still not sure if your mentor is with you or not.  You take a deep breath, grasp the iron doorknocker and crash it into the door twice.  The noise sounds deafening in the silence of the night but no further sound comes from inside the house.\n\n\nYou wait for a minute or two with nothing happening before you hear a whisper in your ear which makes you physically jump and you hope no-one was watching.\n\n\n\"Try the handle\" says the whisper and you feel the slight brush of your mentor against your back as she got as close to your ear as possible.\n\n\nYou focus on not reacting to her, visibly or audibly, and you push down the large door handle and open the door.\n\n\nThe house is pitch black inside and you realise that none of you thought to bring any candles.  You tentatively step inside the house and call out \"Hello?\" into the black void of the entrance hall.\n\n\nYour dark vision adjusts to the blackness of the room as you step further inside and you can see the outline of the stairs.  Squinting around you can see an door to the side of the entrance hall and what looks like a corridor at the back underneath the sweeping staircase.\n\n\nWhich way do you go?", "action_results": [null, null, null]}, {"action": "Go down the corridor at the back.", "result": "\"She can't have been taken.\" you say to your mentor, not sure if you're trying to convince her or yourself.  \"My parents would have sent a telegram, the police would be searching for her.\"\n\n\n\"Perhaps the best thing to do is to go and find out for ourselves.\" replies your mentor kindly.  This sounds like the best thing to do; if you go to your parents house and see your sister for yourself, that you can write this letter off as a particularly vicious prank and either put it behind you or attempt to find out who had sent you the horrible cursed letter which had been the cause of your injury.\n\n\nYou take the letter from your mentor and put it into the robes of your pocket and start heading for the door.\n\n\n\"Well if you wait just a couple of minutes, I can come with you.\" your mentor said.  You stop and turn to look at her surprised.  \"You've already injured one arm, I'd rather we keep the rest of you in tact.\"\n\n\nOnce your mentor is properly dressed, you head outside to hail a taxicab.  It's pretty late to be able to easily find one but your mentor seems to have some kind of sixth sense about them and after heading over a few streets, you find a taxicab at the side of the road with the driver brushing the manes of his horses.\n\n\nThe taxicab driver says he was just finishing his shift but your mentor offers him double for the journey and before you know it, you're on your way.  You pull up at your parents' townhouse after about twenty minutes and true to her word, you mentor hands over more money than you even have to the driver and he heads off home a happy man.\n\n\nYou walk up the steps to the front door together, and you take note that all the lights appear to be off and you start to relax; if your sister was gone, the whole house would be in a furore.  You ring the doorbell and wait for it to be answered.  You look at your mentor and she is frowning as she looking around the street whilst you wait.  You take a look around as well but nothing seems to be out of the ordinary and in this part of town, the street lighting is maintained well so you have a good view of the street.\n\n\n\"Something doesn't feel right.\" she says and you get a gnawing feeling in the pit of your stomach.\n\n\nThe door opens and your parents' butler answers the door in his dressing gown and slippers; he looks sleepily at you but when he sees you mentor he straightens up and looks embarrassed at his attire.\n\n\n\"Begging your pardon but the whole house is asleep.\" Jones says, more to your mentor than to you.\n\n\n\"I just need to check on my sister.\" you say as you push past Jones with a stunned look on his face and your mentor following closely behind you.\n\n\nYou take the stairs two at a time, not stopping to see if your mentor is keeping pace with you.  You fling open her bedroom door without even knocking and rush over to her bed.\n\n\n\"Amelia!\" you say as you approach the bed in the darkness.  Your mentor enters the room behind you carrying a candle she must have taken from Jones and you then see the bed.  There's no sister-sized lump and the covers are in disarray.\n\n\n\"No.\" you say, as you pull the covers off the bed completely. \"No no no.\" you say and you fall to the floor and check underneath the bed. \"No no no no no.\" you say as you look desperately around the room.  That's when you see the symbols on the walls which look like they've been written in blood.\n\n\nJones walks into the room then and lets out an almost inhuman cry.  He rushes over to the bed whilst your mentor is calmly examining the walls.  You frantically check every corner of the room, hoping to find Amelia hiding in some tiny corner but she's not there and you have to admit it to yourself.\n\n\nYou go to stand with your mentor and ask her \"Is it? Is it... blood?\".  You almost don't want her to tell you but you need to know.  She nods sadly and looks at you with a pained look.\n\n\n\"I believe it is. I'm so sorry.\" she says.\n\n\nJones rushes out of the room to wake your parents and before long, the whole house has been awoken and the uproar you expected when you arrived came to pass.\n\n\nIn the meantime, your mentor has copied down the symbols from the walls onto some paper. \"This was important enough for them to leave on the walls so we ought to look into it more.\" she said and you realised they looked a lot like the straight script which was on the letter you received.\n\n\nYour parents are in a state of panic about your sister but they don't know about the letter you've received yet.  It said to come alone and you're not sure if you show them, if you'll be able to stop them from coming as well.\n\n\nDo you show your parents the letter?", "action_results": [{"action": "Deal with this without getting them involved.", "result": "You decide you need to keep your parents out of this, for their own good.  You also realise that whoever you are dealing with is serious.  Although they say to come alone, you think that you and your mentor are going to be able to deal with it.  If your parents know about the letter then they'll insist on coming along and they'll end up hurt and even worse, stop you from getting your sister back alive.\n\n\nYou approach your mother, who is in a blind panic, and calmly tell her \"We need to go and deal with something.\".\n\n\nYour mother barely seems to notice you, let alone put up a fight.  It would be very different if you had shown her and your father the letter, you're sure of that.\n\n\nYou lead your mentor out of the bedlam that your parents' house has turned into.  A servant rushes past you as you walk out of the door holding a note which you assume is to a message to the police; you want to be gone before the police arrive as you don't want to lie to an officer of the law but if they find out about the letter, Amelia will be as good as dead.\n\n\nYour mentor leads the way down to the road and you follow after her blindly, you can barely feel you legs carrying you as your mind is full of images of your sister being held against her will, crying, feeling scared, but you manage to stop the chain of images before you reach the things her captors might be doing to her.\n\n\nYour mentor flags down a taxicab easily, they are much more common this late at night in an upmarket area like this one.", "action_results": [null]}, {"action": "Show the letter to your parents.", "result": "\"We need to show them.\" says your mentor to you gently.  \"They deserve to know what has happened, what we can do to help her.\"\n\n\n\"But they can't be involved,\" you protest, \"they'll get hurt.\"\n\n\n\"Yes, I agree.\" replies your mentor, and she walks over to your mother and says a few quiet words in her ear before leaving the room, presumably to find your father also.\n\n\nYour mentor gathers the four of you in the parlour and makes sure they are sitting down before looking to you to break the news to them.\n\n\n\"I received this earlier tonight.\" you explain.  \"It was hand delivered, I don't know who by, and it was booby trapped too.  The people who sent this are serious people, and dangerous, very dangerous.\"\n\n\nYou hand the letter over to them, and they hold it between them.\n\n\n\"These are like the symbols on the walls\" says your mother.\n\n\n\"Yes,\" you reply, \"I think they might have put them onto the walls just so that I knew the letter was genuine.\"\n\n\n\"God save us.\" your father says.  \"We have to go there.\"\n\n\n\"No, it's too dangerous, I won't let you.\" you say, raising your voice unintentionally.  \"You have to stay here.\"\n\n\n\"Not while I'm alive!\" says your mother with more passion than you've heard in her for years and your father starts to rise from the seat next to your mother, springing into action.\n\n\n\"And that wouldn't be for long if you were to accompany us.\" says your mentor with such authority to her voice that your father falls back onto the seat and both of your parents just stare at her.  \"I'm afraid that your coming with us would inevitably lead to the demise of yourselves, myself, my apprentice and your missing daughter.  We can't possibly allow it.\"\n\n\nYou father started to say something in argument to your mentor but your mentor simply spoke over him. \"It is imperative that you remain here, if your daughter manages to escape her captors then she will need you to be here at her home should she manage to get that far.  I believe you have alerted the authorities to the situation and they will find it highly suspicious if you were to be missing from the house when they arrived also.\"  Your father tried to speak again, but was cut off by your mentor once more.  \"And before you suggest we take the police to the location specified in the letter, they absolutely cannot be involved in this matter; they do not understand the complexities of a situation like this and their foolhardiness would get us all killed.\"\n\n\nYour parents sat in stunned silence, staring at your mentor; you were used to being spoken to in the same manner by her in your many lessons, but it will have been a long time since anyone spoke to your parents in the same way.\n\n\nYou clear your throat and say \"We should leave, before the authorities arrive, if you have already sent them a message?\".  You look at your father and he nods in answer.  \"Then we shall go now.\" \n\n\nYou hold out your hand to your mother and she hands the letter back to you before standing up and embracing you fiercely.\n\n\n\"Bring her back.\" she simply says to you, and you and your mentor leave the house and flag down a taxicab.", "action_results": [null]}]}]}, {"action": "Go to Langdown Hall with your mentor.", "result": "You decide you need to find out anything you can about this mysterious correspondence before you do anything as rash as opening it.  Your knowledge of the magical is only just in its fledgling stages and you can't be too careful where dark magic is concerned.  If there's one thing you've developed from your studies since you became a magical apprentice, then it's a healthy sense of paranoia.\n\n\nYou place the envelope down on the desk; just as your fingers leave the paper, you could swear you felt a slight vibration from the envelope.  Nothing significant, just enough to tingle the ends of your fingers.  You frown at the envelope as it sits innocently on your book laden desk but it doesn't look to be vibrating or doing anything unusual at all so you start to look for a book you think might be useful.\n\n\nYour fingers drum along the spines of the books on the shelves as you scan the titles.  Aha, that's the one you were looking for and you lift the thick, leather bound tome titled 'Traps and Trips to Rattle Wits'.  You were never sure if the author of the book intended the title to rhyme and this had always annoyed you a little, but this only resulted in making the book more memorable to you.\n\n\nYou push the papers covering half of your desk to one side, some of them falling on the floor to join the other orphaned notes which had fallen there from previous similar desk clearing flourishes.  You place the book on the now cleared aware of your desk and turn the first few pages until you find the chapter listing.  You run your finger down the page until you find the one you were looking for, 'Concealed Traps in Everyday Objects'.  You note the page number and turn the pages until you find the right chapter.\n\n\nYou're sure you've seen something about how to detect spells like one which could be contained in this envelope somewhere in this chapter and you flick through the pages, feeling more and more anxious as you do.  You find a section in the chapter specifically focussed on hiding nasty surprises in parcels and letters' you turn the page and there it is, half a page devoted to how to detect and dispell traps like that.\n\n\nIt's a simple enough spell which can be enhanced with a very basic potion so you set about gathering the ingredients you need from around the room.  Your mentor calls it the work room but you've always preferred the term laboratory.  There are bottles and boxes covering shelves, filling cabinets and lining the edges of the room on the stone floor in every nook and cranny.  You think it was probably an organised space at one time or another but as more things had been acquired, and the available space had lessened the organisation had gone right out of the window.\n\n\nThe ingredients you needed are all common ones though, so you know exactly where to go to find each one.  You look around to make sure your mentor hasn't come into the room and you open up the cupboard that your bed sits upon and take out a mechanical contraption which you know she would strongly disapprove of.  You carefully insert the ingredients into the pot at the base of the machine then you light the fuse around the side and you stand back.  It makes a bang when it starts up but steam starts to pour out and the pistons pump up and down and you can see the pestle going in and out of the pot at the bottom which is turning around at the same time.  The whole thing makes quite a racket but it's late enough that your mentor is probably asleep and she can sleep through an airship landing so this is unlikely to wake her.\n\n\nAfter a few minutes, you pull a lever which disconnects the pistons and the steam dissipates.  You remove the pot and your ingredients are a fine powder, absolutely perfect for your needs.  You take the powder and stir it into the tea you had been drinking before your evening was disrupted by the letter and drink it all in one go.\n\n\nYou grab a few candles from a drawer, not strictly necessary for the spell but you always feel like candles make it easier; it's probably all in your head but that's a good enough reason to use them for you.  You draw a circle in chalk on the stone flag which is clear of detritus by your desk and carefully place the candles around the circle and light them using a candle from your desk.  You pick up the envelope from where you left it on your desk and as soon as you touch it, you get the same uneasy feeling back that you hadn't noticed had worn off.  You shudder slightly and place the letter within the circle on the cold, stone floor.\n\n\nYou kneel down next to the circle, place your finger on the chalk circle, close your eyes and quietly repeat the words of the spell a few times.  Whilst you're saying the words, you focus your mind on what you want to know.  You think about the envelope, about the strange feeling which seems to surround it and you think about how you want to see through the outer envelope, how you want to see what is contained within.  After a few minutes, you open your eyes and look at the letter within the circle.\n\n\nIt looks to be glowing, no, wait, the envelope isn't glowing but it's covered in strange symbols which are glowing.  It doesn't look like any language you've seen before.  Quickly you grab some paper and a pencil from your desk and try to draw as many of the symbols as you can before they fade away and the envelope looks just as it did before.\n\n\n\n\n \n\n \n\n \n\nYou frown at the letter and at the symbols you've written down and instead of finding out if opening the letter will trigger a magical trap of some sort, you're left with even more questions instead.  If you didn't feel comfortable about the letter before, you're convinced there's something very strange about it now.\n\n\nWhat do you do with the letter now?", "action_results": [{"action": "Open it.", "result": "You're reasonably sure the letter isn't going to explode in your face if you try and open it but there's certainly something more to it than meets the eye.  You place it back into the chalk circle on the floor and kneel down next to it once again.\n\n\nYou touch your fingers to the chalk circle and close your eyes once more and this time you fill your thoughts with barriers, walls, steel boxes, prisons, cages, as much as you can think of which meant containment to you.  Your thoughts went bigger, stronger, to mountains, to burying deep within the earth, to complete darkness with no escape.\n\n\nYou open your eyes this time and the letter in front of you seems to be absorbing all the light around it, like a small pit of darkness, sucking in all the light and sound from nearby.  You reach out, pick up the envelope and break the seal.\n\n\nA rush of energy feels like a slap in the face, but then it's gone and you're just left, kneeling on the floor, holding an ordinary looking envelope.  It no longer tingles or vibrates against your fingers, you realise that the uneasy feeling has gone too and you breathe a sigh of relief.\n\n\nCarefully, you open the envelope, to reveal acid green paper inside.  You take the paper out and open up the letter.\n\n\n\n\n \n\n \n\n \n\n \n\n \n\n \n\nIt feels as though your world is crashing down around you.  Your sister, your baby sister.\n\n\nYou stare at the paper for a while before you then dash over to your desk to the small clock you keep there.  You shove the books, papers and other general detritus of your studies around until you find the clock hidden behind a small stack of books and papers in the corner.  It's almost one o'clock in the morning, there is still time to get to Langdown Hall.\n\n\nDo you go to Langdown Hall?", "action_results": [null, null, {"action": "Go to your parents house to see if your sister is really missing.", "result": "Your sister can't have been taken, your parents would have contacted you, there would be a search.  You decided that if you go to your parents house and see your sister for yourself, that you can write this letter off as a nasty prank and put it behind you.  You put the paper with the symbols you wrote down and the letter into the pocket of your robes and head outside to hail a taxicab.\n\n\nIt's pretty late to find a taxicab but after looking for ten minutes, you hear the sound of horses trotting down the road and flag it down.  You pull up at your parents' townhouse after about twenty minutes and fumble around for the money to pay for it.  After scouring every pocket you manage to scrape the change together but you're left with almost nothing now.\n\n\nYou walk up the steps to the front door, noticing that all the lights appear to be off and you start to relax; if your sister was gone, the whole house would be in a furore.  You ring the doorbell and wait for it to be answered, taking a look around the street whilst you wait.  Nothing seems to be out of the ordinary and in this part of town, the street lighting is maintained well so you have a good view of the street.\n\n\nEventually, the door opens and your parents' butler answers the door in his dressing gown and slippers and a sleepy expression on his face.\n\n\n\"They're asleep.\" he says simply to you.  Jones always was a terse man and being woken up in the night most likely made him rather grumpy as well, but this was important.\n\n\n\"I just need to check on my sister.\" you say as you push past Jones with a stunned look on his face but he doesn't stop you.\n\n\nYou take the stairs two at a time.  You're sure your sister is quite fine but you have a great sense of urgency to check now that you're in the house.  You fling open her bedroom door without even knocking and rush over to her bed.\n\n\n\"Amelia!\" you say as you approach the bed in the darkness.  Jones is coming up the stairs behind you with a candle and you swish you'd grabbed it from him in your haste.  As your eyes adjust to the darkness, you start to make out the bed.  There's no sister-sized lump and the covers are in disarray.\n\n\n\"No.\" you say, as you pull the covers off the bed completely. \"No no no.\" you say and you fall to the floor and check underneath the bed. \"No no no no no.\" you say as you look desperately around the room.\n\n\nJones walks in carrying the candle and that's when you see the symbols on the walls which look like they've been written in blood.\n\n\nJones drops the candle and lets out an almost inhuman cry.  He rushes over to the bed whilst you scoop up the candle and start checking the room, still hoping to find your sister hiding in some corner of it.\n\n\nBefore long, the whole house has been awoken and the uproar you expected when you arrived came to pass.  Your parents are in a state of panic about your sister but they don't know about the letter you've received yet.  It said to come alone and you're not sure if you show them, if you'll be able to stop them from coming as well.\n\n\nDo you show your parents the letter?", "action_results": [{"action": "Deal with this yourself.", "result": "You decide you need to keep your parents out of this, for their own good.  You also realise that whoever you are dealing with is serious and when they say you should come alone then you need to listen to them, or you might not get your sister back alive.\n\n\nYou approach your mother, who is in a blind panic, and calmly tell her \"I need to go and deal with something.\".\n\n\nYour mother barely seems to notice you, let alone put up a fight.  It would be very different if you had shown her and your father the letter, you're sure of that.\n\n\nYou go to your father and ask for money for a taxicab, saying that it's important.  He doesn't really take in what you're saying to him as he has just finished writing a message for one of the servants to take to the police, but he unlocks and opens his desk drawer and hands you as much money as you earn in a month and picks up his pen again and seems to forget that you're there.\n\n\nYou leave the house and flag down a taxicab, finding them much more common this late at night in an upmarket area like this one.", "action_results": [null]}, {"action": "Show the letter to your parents.", "result": "You take your parents to one side, away from the staff, and show them the letter you received earlier that night.\n\n\n\"These are like the symbols on the walls\" says your mother.\n\n\n\"Yes,\" you reply, \"I think they might have put them onto the walls just so that I knew the letter was genuine.\"\n\n\n\"God save us.\" your father says.  \"We have to go there.\"\n\n\n\"No no!\" you reply sternly.  \"It says alone, I'm going to go alone.\"\n\n\n\"Not while I'm alive!\" says your mother with more passion than you've heard in her for years.\n\n\nYour father leaves the room and you can hear him ordering the servants to assist with them getting ready to leave the house and you know it's futile to try and stop them from coming with you.\n\n\n......\n\n\nYou arrive at Langdown Hall in your parent's carriage.  Your fathers asks the driver to keep the horses and carriage nearby but out of sight if possible and a minute later the three of you are stood alone in front of the gate to the grounds.\n\n\n\"I guess we go in then.\" you say and push open the gate.  It swings open with no resistance and an eerie sounding creak and you lead the way into the grounds of Langdown Hall.\n\n\nLangdown Hall is an old stately home which had been without an occupant for a number of years after the family who owned it died out and the distant relative they left it to wasn't able to pay for its upkeep.  The stone of the building was black with ornate windows and rounded towers at the corners.  Everyone knew the building but there were varying reports of the size of it inside.  Whichever rumour you chose to believe though, the house was indisputably vast and imposing.\n\n\n\"Do we knock?\" your mother asked from behind you.\n\n\n\"I guess we can try.\" you say and you cautiously approach the huge main door, grasp the iron doorknocker and crash it into the door twice.  The noise sounds deafening in the silence of the night but no further sound comes from inside the house.\n\n\n\"I think it's time we tried the handle.\" says you father, stepping forward and in one smooth motion, opens the door.\n\n\nThe house is pitch black inside and you realise that none of you thought to bring any candles.  You tentatively step inside the house and call out \"Hello?\" into the black void of the entrance hall.\n\n\nYour dark vision adjusts to the blackness of the room as you step further inside and you can see the outline of the stairs.  Your parents are following behind you and once you're almost at the foot of the stairs, the door slams shut behind you and your mother lets out a scream of shock.\n\n\n\"Probably the wind.\" you say to your mother, but you know it's a still night and your hands are starting to shake now.  You start to climb the stairs, holding on to the banister in the darkness.  You're not sure why you want to head upstairs but your gut is telling you that's where you need to go.\n\n\nWhen you reach the intermediate small landing halfway up the stairs, you look up the remaining stairs and you think you can make out a shadow which could be a person.  \"Hello?\" you ask into the darkness again and this time you get a reply.\n\n\n\"I SAID TO COME ALONE!\" bellows a deep voice from the first floor landing and suddenly the entire staircase, is engulfed in fire.\n\n\nThe light hits you first, forcing you to close your eyes, and the noise feels deafening in your ears, and then you feel the heat.  You open your eyes to see your robe has caught fire and your parents have too.  You know you need to get out of the flames as soon as possible and you shove them hard, so that they go tumbling down the stairs, to the hallway below which is free of fire.\n\n\nYou start running down the stairs yourself but your robe is entirely engulfed in flames now and you can't feel anything where you felt the fire burning you before which you know is a bad sign.  When you're most of the way down the staircase, your legs give way beneath you and you fall the last few stairs.  You glimpse your parents on the floor at the base of the stairs, still on fire, your mothers neck at an angle it shouldn't be and both of them not moving before everything goes black.\n\n\n \n\nTHE END", "action_results": []}]}]}, {"action": "Burn the letter without opening it.", "result": "The uneasy feeling about the letter gets too much for you and you hold the letter closer and closer to the candle, you're not sure why but you're overcome with a need to burn the letter, to destroy it.  Your mind is certain now, the letter must be completely eradicated, it must be burnt, but your arms are stopping you from reaching the flames.\n\n\nYou concentrate harder, you focus all your will on pushing the envelope towards the candle but your arms feel like they've become steel, they are utterly rigid.\n\n\nYou start to panic now, the letter can't be here, it can't stay here; you don't know what will happen if the letter is allowed to exist for a single minute longer but the dread in the pit of your stomach tells you that it will be something truly terrible.\n\n\nYou whip your body around to the left with your arms still rigid in front of you.  A flame dances across the bottom of your palm and you stop with the letter right over the flame of another candle.  Your arms try to jerk away but you hold them steady; holding them still feels a lot easier than pushing them forwards had been.\n\n\nThe paper begins to blacken where the flame meets the letter and it spreads out across the envelope quickly.  The burning reaches your fingers but you just can't let go.  You're sure your fingers must be burning now, but you can't feel it, you're just mesmerised by the letter which is emerging from inside the envelope as it burns away.  The paper is acid green and somehow untouched by the fire.\n\n\nAs the black and crisp envelope flakes away, the letter inside finally succumbs to the fire and begins to burn.  Suddenly, a mark forms on the paper in brilliant light so bright you have to turn your face away from it.  The light dims and as you look back, you see that the mark on the paper which has lit up and the same insignia as was imprinted in the wax seal.  The G fades away leaving only the tentacles illuminated until the fire engulfs them too.\n\n\nWhen the last fraction of paper burns between your now angry red fingers, your grip is released and a flood of pain from the fingers which had been gripping the paper in both hands crashes into you like a wave.\n\n\nYou collapse to your knees on the cold stone floor, your hands still held out in front of you but searing with agony now and you're not sure what came over you, why you felt the need to burn the mysterious letter and you start to feel pangs of regret.\n\n\nThe next morning, with your hands bandaged up as best you had been able to manage with your fingers crippled, your mentor wakes you from your bed.  You open your eyes to see her pushing back the curtain which separates your bed from the rest of the room where you work.\n\n\n\"You need to wake up.\" she says, with an urgency in her voice you haven't often heard.  \"It's your sister.\"\n\n\nAny tiredness you felt from just being woken is gone in an instant as adrenaline surges through you.  \"Leanne?\" you ask, your voice higher than normal.  \"What about her? Is she alright?\"\n\n\n\"She's gone.\" replies your mentor.  \"I was near to your parents' house this morning as I came back from the market and heard the ruckus.\"  She hesitates before she speaks again, letting the words sink in to my brain as I try to think exactly when had I last seen my little sister.  \"I think she was taken yesterday.\" she says grimly.\n\n\nYour mind races and as the pain aches from your fingers you find your thoughts going back to the letter you burnt last night.  The strange letter which arrived on the day your sister was taken.  Why had your burnt it, what had come over you?\n\n\nYou can hear your teacher speaking to you still, but it is all a muffled echo in your ears as you lay back down in your bed, staring at the spot on the floor where you can see the ashes of the letter you hadn't swept up last night.  The same feeling which had made it so impossible to move your arms the previous night seems to be affecting your whole body and the image of a G wrapped in tentacles seems to fill your thoughts and your vision and you don't even want to move anymore, you don't see why you should even try.\n\n\n \n\nTHE END", "action_results": []}]}, null]}]}