{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=62789", "context": "", "first_story_block": "It was a silent dinner. We could hear the faint orchestra of crickets outside.\n\n\n\"I heard that... you've been hanging out with bad kids.\" Dad said out of the blue.\n\n\"Dad, Jared and Sid are decent guys,\" I explained.\n\n\nMy dad lets out a sarcastic chuckle, one that sent a surge of heat in my neck.\n\n\n\"I hear they do a lot of disgraceful things,\" he paused and took a bite of the scrambled eggs. \"... and they skip class! I bet you skip class, too. I thought you'd know better.\"\n\n\"Oh, I'd know better than you ever would,\" I mumbled to myself.\n\n\"What did you just say?\"\n\n\"Oh, I said something? I didn't hear it.\"\n\n\"You know, your mom would be so disappointed in you.\"\n\n\nI stood up for a moment. I couldn't do anything but stare. Then with all the hot blood running up my head and my throat, I couldn't hold it in anymore. I had to let it out.\n\n\n\"Well ever since mom left us, you've never been on my side.\"\n\n\nDad's eyes widened and managed to pierce through me with his glare and I felt a bit of myself go in a rage. Suddenly, he stood up as well and took my arm. My body was pulled towards him like paper, It felt like he made my muscles rip a bit.\n\n\n\"Hit me,\" I provoked him. I was done.\n\n\nThen he hit me. Knuckles. Hard ones. Twice.\n\nBut you know what? It didn't hurt. No. No. More like, It made me feel more alive. It only made me laugh.\n\n\n\"Go to your fucking room, kid.\"\n\n\"Whatever.\" I quipped, shrugging my arm off his grip. \n\n\nAfter that, I found myself taking a deep breath with my back against my bedroom door and a little later on, I heard a key lock me in. I hope tonight won't be too much of a bore.", "action_results": [{"action": "This again, huh?", "result": "This home has been tense without mother around. She had always been the one to make things better between me and Dad. It was always \"I'll talk to dad, later\" or \"It's just one of those days.\" I never really understood why she left and dad never did anything wrong, honestly. \n\n\nIt was just a day before Valentines. Dad had things set up. He hid a little gift in her room and we even tried to make a cake! But in the end, she never came home. We tried calling her, frantically shaking the phone in despair. There was no answer and it was then that it dawned to me that she was never coming back. Tears.\n\n\nIt was the first time I cried in years. I bet it was the same for father, only he's never cried since probably forever before that happened, old bastard.\n\n\nAnyways, it's been about an hour since that tangent at the dining table and all I did was just lie on my bed and play some game on my phone. I really should get up or something.\n\n\nI think I should be doing something else.", "action_results": [{"action": "I should check the window or something.", "result": "I walked over to my window and moved the dirty pale green curtains out of the way. I didn't bother opening the actual window up.\n\n\nThe neighborhood greets my bloody eyes and I can see Jared's house. He isn't there today because his parents took him on a trip to some relatives. 'They're just some crackhead cousins who missed us,\" he told me.\n\n\nHe's a good guy. Sure, he may be crazy. That doesn't change the fact that he's a good guy.\n\n\nHe's honestly one of the better ones. He once scared the shit out of some bullies on the street, defending this young grade-schooler just trying to get home. He took out a gun and pointed it at one of the bullies and the kids just screamed and ran. \n\nIt was a real gun, though. I was like, 'Dude, what were you thinking!' I screamed and he just told me he had the safety on. \n\nWe had great memories. Drunk-ass nights where we almost got arrested and memories which made me realize there's more to life than just going down some academic route to a useless repetitive job.\n\n\nNow, will you look at that? the skies have gone dark. It's getting pretty late. \n\n\nMaybe I should do something else?", "action_results": [{"action": "Yup, I'm done over here.", "result": "I should really do something else.", "action_results": [{"action": "Who knows what lurks in my closet.", "result": "Well, well, well, If it isn't my trusty old cabinet. Note that Slipknot poster on the left door. It's interesting, cause Mom never really bothers to fix this all up. Dad does.\n\n\nI can see a black sock poking out of it. Dad hasn't cleaned this closet in ages.", "action_results": [{"action": "I guess opening this wouldn't hurt.", "result": "Unkempt. Just how I like them. I got three panels over here but none of them with freshly-ironed and well-folded clothes. I can't even see well, it's dark.\n\n\nBut what's this?", "action_results": [{"action": "Well, if it isn't a rubber ball.", "result": "This rubber ball and I go a long way back. I should hold on to it.\n\n\nIt was summer and Mom wanted to check this garage sale out. It was just a few blocks from our place. I was a kid of course. I never thought that this would be my only memento of her.", "action_results": [null]}]}, null]}, {"action": "I could go get a drink from the fridge downstairs.", "result": "\"Wow, well if it isn't my old friend! The locked door!\"\n\n\nMy eyes stare blankly to nowhere as I stand here at the locked door. Heck, why am I even here?", "action_results": [null]}, {"action": "Laptop game time? Why not?", "result": "It's just another messy study desk. It's got four drawers and my sleek shiny black laptop on top of it. Yes, I do keep microfiber cloth for it.\n\n\nThis laptop is practically the only thing I'm proud of when it comes to my current belongings. It was dad who got it for me. I was finally starting to show promise when I got a pretty nice streak during my 5th-grade spelling bee. Of course, I was just looking at one of my classmates in the audience. That kid was Sid.\n\nOut of us three, Sid was the smarter one. Academically of course. which is partly why he skips class. He doesn't need to worry about school. \n\nHis story is pretty much a sad one but I don't feel like going about that now.\n\n\nGuess I'll play a game on my laptop. It might just help me cool off.", "action_results": [null, {"action": "One game. (we all know what that means)", "result": "I know that I said this laptop is my only prized possession but I really should've installed some new offline games recently. Turns out dad just plugged off the internet or something. Old bastard.", "action_results": [null]}]}]}]}, null, null, null]}]}