{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=13398", "context": "", "first_story_block": "The stench of rotten flesh creeps up your nose as you stand in front of the huge university complex. You have been here since the Outbreak began and settled in. Each day more people are coming in looking for protection. The military has the place locked down pretty tight but you doubt that there will be enough supplies for everybody if people continue to make their way here.\n\n\nSooner or later you will have to think about leaving the place behind.", "action_results": [{"action": "Head to your room", "result": "This is your own place. As you look through it you can tell that you could probably survive a few days on your own if it would come down to that. You got a bed and a wardrobe, somewhere in a corner you got a little fridge, but since the University's power is supplied by generators nobody is allowed to use any electrical devices.", "action_results": [{"action": "Access your secret stash", "result": "Below a stain on the carpet that looks like rust and in the floor you got a hidden stash that contains all your important belongings.", "action_results": [null, null, null, null]}, {"action": "Go outside", "result": "The stench of rotten flesh creeps up your nose as you stand in front of the huge university complex. You have been here since the Outbreak began and settled in. Each day more people are coming in looking for protection. The military has the place locked down pretty tight but you doubt that there will be enough supplies for everybody if people continue to make their way here.\n\n\nSooner or later you will have to think about leaving the place behind.", "action_results": [null, {"action": "Head to the gate", "result": "Somewhere between improvised guard towers, sandbags, barbed wire and brick walls guarded by five men in uniform, armed with assault rifles you can spot an improvised gate. It reminds you of something you have seen in some sort of apocalypse movie with all those spikes, you can spot a piece of flesh pierced on one of the spikes. Your creativity immediately pictures a desperate man trying to climb over as his hand slips leaving him lying on the spike.\n\n\nThe voice of a soldier rips you out of your fantasy: \"Sorry, got orders to let nobody leave. If you still want to give it a try, talk to the Captain.\"", "action_results": [null, {"action": "Head to the Captain's office", "result": "You enter a rather dark room, the air is thick and warm. Just the moment you enter, sergeant Miller is pushing the heavy curtains aside. A sunbeam lights up the sunglasses of the man on the other side of the room, he grins and looks towards the light, \"Good morning apocalypse!\".\n\n\nYou inspect the room quickly. You have been here once or twice since you arrived. The man on the other side sitting behind the heavy wooden bureau is the Captain. He wears his uniform and pilot's sunglasses, instead of a beret he is wearing the replica of an old Soviet Union general's hat. \"How can I help you?\"", "action_results": [{"action": "Ask him about leaving the courtyard", "result": "For a few seconds the Captain just stares at you through his sunglasses, you can almost feel his breath on your skin as your heart begins to beat faster. After a moment that seemed like an hour of intense staring he slowly begins to nod. \"Alright.\", he says, pushing his chair backwards as he stands up, \"I hope you know what you're doing. To be honest I was hoping for something like this to happen. It was getting crowded.\"", "action_results": [{"action": "Thanks.", "result": "The Captain looks at you, he now stands next to his desk, the sun is growing somewhat stronger lighting up the room just enough to see a few bloodstains on the dark carpet. Making his way around the bureau the Captain asks you:\n\n\n\"I take it you are ready to head out?\"", "action_results": [{"action": "\"Not yet, i still have to get some things.\"", "result": "Sooooo.... yeah. I have no idea how im supposed to make a loop of this. Oh shush! Well if you don't got the three items yet then you will have to restart it.\n\n\nDon't look at me like that it's not like I know how this works!\n\n\nBut here is good news! If you grabbed your stuff you can just head out! :D", "action_results": [null]}, {"action": "Hell yeah! Let's roll!", "result": "The Captain grins at you. \"Alright then.\" With a hand on your shoulder he accompanies you to the gate, as the guards see you approach they salute and step aside. The Captain lightly salutes and then just keeps going as the soldiers open the heavy gate for you.\n\n\nAs the gate opens the smell of rotten flesh hits you like a wave. A few dead infected are lying on the sidewalk, looks like the guards didn't have time to clean them up yet.\n\n\nNow you and the Captain stand in the remains of the once great city. He pats you on the back, \"This is it. Good luck. Oh and before I forget it. If you want to come back don't forget to bring some supplies. You never know when the system begins to break down... you know for real this time.\". He salutes you and wishes you luck one last time, then he gives the guard a sign and the door closes behind him.\n\n\nYou hear the loud sound of metal on metal and feel a light wind, now you're all alone. The remains of the once great City loom into the sky and just for a moment you feel even more insignificant.\n\n\nWhat started the Outbreak? How to fix it? And first of all how are you even going to survive the next day? All these are questions you might have to ask yourself sooner or later, because this is your story and it has just begun.", "action_results": [{"action": "On the road again", "result": "You sight. Here you are, all alone, just you and your gun. As you look down the street you wonder if that would really make a good story, nothing but a guy and his gun. You walk down the street and pass burned out cars and looted shops, here and there you can see what seems to be the remains of a once human being. At first you jump every time you see skin as your mind turns every shadow into a disturbing monster that seems to have been waiting just for you, but after a while you realize that everything in at least a radius of two miles seems to be as dead as a rock.\n\n\nAfter a while of walking straight you arrive at a crossroad, you might have known this place but even if you are sure that you wouldn't recognize it anymore.\n\n\nThis is your first choice to make now that you're all on your own, what way do you want to go?", "action_results": [{"action": "Turn left", "result": "You made your choice pretty quick and spend no second thought about it, does it really matter? You follow a few signs, turn a few times left, a few times right and then continue straight foreward. It doesn't take you very long to realize that you're lost. As you look around you see that you're in some small street, it is relatively clear of car wrecks however you can spot a few dumpsters nearby, you cannot spot a single body. You've got a bad feeling about this.\n\n\nThen you hear it. At first it is very quiet but it's becoming louder every moment. Somebody is singing. Surely it doesn't sound like he was very talented but you can tell that he got the text right.\n\n\nYou look to the dumpsters, then back on the street.", "action_results": [{"action": "Hide somewhere", "result": "You surely wouldn't survive for long by taking unnecessary risks like standing around out in the open. You quickly move over to the dumpsters, trying to stay as quiet as possible. As you open the dumpster an unspeakably disgusting smell hits you in the face and your eyes begin to tear, there's no way you can hide in there. You are about to turn around but you can still hear the singing. You look at the street another time and decide that hiding behind the dumpster must be enough.\n\n\nAfter a little while you can see a person. He is wearing a black beanie, a red scarf, a dark hoodie and a pair of jeans. He doesn't look like a raider to you, but on the other hand...\n\n\n ", "action_results": [{"action": "Decide to talk to him", "result": "As you approach him he reaches into his pocket, you already got a hand on your gun, but he pulls out his iPod and turns his music off. Two people just staring at each other. You feel kind of stupid, you deserve it by the way. So?", "action_results": [{"action": "Admit you're lost", "result": "He looks at you through his yellow eyes. They seem a little off but as far as you're concerned yellow eyes don't indicate infection. He scratches his neck:\n\n\n\"Yeah I also had my trouble. Stuff just doesn't look the same after it burned down you know?\", his eyes were constantly scanning the surroundings, \"You know it would be nice if you decided to tag along, I've been on my own since I started wandering the damn City, it would sure be nice to have some company.\".\n\n\nYou look at him closely, somewhere in his equipment you can spot a gun and a knife. He's armed so he might be a raider, on the other hand, so are you. \n\n\nYou look at him and your decision is clear...", "action_results": [{"action": "Alright buddy time!", "result": "You and your new friend head onwards together. You spend some time chatting and find out that his name is Bosnia. It didn't use to but he believes that nicknames are sufficient when it comes to the apocalypse and you have the feeling that he's right.\n\n\nWhile talking you realize that Bosnia seems to be a nice guy, although he refuses to answer any questions about his past. \"What's in the past is in the past. It wouldn't do any difference.\", however you aren't so sure what to think about the fact that he refuses to talk about his past.\n\n\nOccasionally you stop to check the description Bosnia got, it's a crude drawing with a few landmarks, however it is hard to identify them, some are burnt while others seem to be completely missing and a few times you even doubt their initial existence.\n\n\nAt some point you decide to take a short rest and after scanning the area for hostiles you decide to sit down in a destroyed coffee shop. As you realize that you have forgot to bring water and food Bosnia has already started to split up his supplies, he believes that it's the least thing he could do for a friend.\n\n\nAs you continue rested and well fed it still takes you half a day without any special encounters to reach your destination. Just as you turn around the corner you make a suprising discovery.", "action_results": [{"action": "What the fuck?!", "result": "Bosnia quickly drags you down besides him. You take a peak over the car you are hiding behind and see the settlement. An improvised wall made of furniture as well as wooden and metal parts has been partially destroyed, somewhat behind it wads of smoke are drifting into the constantly darker turning sky.\n\n\nYou can spot men in ski masks carrying bodies around, they dump them on a big pile, you can tell that not all of those bodies belong to adults and your stomach clenches at the thought of inhumanity. You look over to Bosnia, he has a gun out, his yellow eyes are focussing the raiders.\n\n\nBoth of you glide down with your backs to the car, he looks at you:\n\n\n\"Shit, got any ideas?\"\n\n\n \n\nSpoiler:                                                                                                                                                    Using items counts as idea", "action_results": [{"action": "Let's leave", "result": "You look at the way you came. A short look over your shoulder tells you that none of the raiders are looking. Just as you sneak around the corner you stare into the widely opened eyes of a guy wearing a ski mask. You wouldn't even need to see him, the smell reminds you of a dumpster that hasn't been cleaned in months if not years.\n\n\nHis shaking hand wanders to his back and you don't have to be a Harvard graduate to know that he is reaching for his gun. You can't wait for Bosnia to make a move.\n\n\nYou know you have to...", "action_results": [{"action": "Surrender", "result": "Hey, yeah this is your Conscience. I was just asking myself: Are you fucking kidding me?", "action_results": [null]}]}]}]}, {"action": "I think he can't be trusted. I will be on my way.", "result": "You are lost and alone. You have no food and no place to stay and all of this could have turned out nicely.\n\n\nMore and more you realize just how screwed you are, you can't possibly make it on your own and you wish you would have taken a different choice. But there's no way back now.\n\n\nAnd there ends the street, well...\n\n\n ", "action_results": [{"action": "Head right", "result": "Well good work. Good f-, yeah well great job. You didn't listen to me. Now were here, somewhere in nowhere with no food and no safe place to stay, if you make it through the night that would really suprise me.\n\n\nAnd you don't.", "action_results": [{"action": "You're Dead", "result": "I would say you had no chance in the first place, but that would be a lie.", "action_results": []}]}, {"action": "Head left", "result": "You reach something that looks like a ransacked little settlement of some sort. Improvised walls have been torn down and there are no traces of any inhabitants.\n\n\nYou spot something white in a small puddle of blood. As you pick it up you realize these are the earbuds from the guy you have seen earlier today. You don't see the people sweeping up behind you. But you hear the shots.\n\n\nYou feel them too.", "action_results": [null]}]}]}, {"action": "Wait for him to say something", "result": "For a minute you just stand in front of each other and say nothing. A light breeze picks up a newspaper and carries it through the invisible gap between you.\n\n\nWhen he realizes you aren't going to say something he decides to take the initiative, \"I haven't seen anyone else the entire day, are you lost or something?\"\n\n\nOuch, found your weak spot didn't he? You got two options...", "action_results": [null, {"action": "Claim to know exactly where you are going.", "result": "He looks at you and you can see something you suspect to be disbelief in his eyes. He shrugs his shoulders. Shortly afterwards he rubs his chin. \n\n\n\"What way are you headed?\"", "action_results": [null, null]}]}]}, {"action": "Stay in cover, you never know", "result": "The guy comes even closer, continuing to sing his song. You keep your eyes focused, watching his every move, yet you are starting to have doubts. What if he isn't dangerous? What if he is your ticket to someplace safe? You shake your head, that would be exactly what a raider wanted to think. On the other hand nobody would want to think you're a raider and normal people sure wouldn't try acting like one. You sight as you realize that there is only one way to find out....", "action_results": [null, null]}]}, {"action": "Look for the person", "result": "Nice another survivor! You're pretty excited and cast all common sense in the wind and you stand in the middle of the street trying to spot the guy singing.\n\n\nAfter a while you see the guy singing approach, he wears a black beanie and a red scarf with dark hoodie and jeans. As he comes closer you can also determine the earbuds that lead to one of his hoodie's pockets. When he sees you he at first seems a little confused and reaches into his pocket.\n\n\nYour hair is standing up, you are ready to react at any moment and your hand is already slowly wandering to your gun. Then, after the short moment of tension you realize that he merely turned off his iPod. He is now standing directly in front of you.\n\n\nAwkward silence, the one thing the Outbreak hasn't extinct yet.", "action_results": [null, null]}]}, null, null, {"action": "Shouldn't I be saving the game at some point?", "result": "In order to save your progress, you need to have an account and be logged into the site.\nTo logon, click here to open the logon screen in a new window. You can also create a new account on that page if you do not already have one.\nOnce you have logged on, you may close the window that was opened and click here to continue and save your progress.\nTo go back to the page you were just viewing, and not save your progress, click here.", "action_results": []}]}]}]}]}, null]}]}]}]}]}