{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=62617", "context": "", "first_story_block": "\"Shit.\" \n\n\nMumbling under your breath, you fumble with the keys to your beach rental's front door. It's not enough that it's pitch black out--of course your vision's gone blurry too, and the smell of cigarettes from the rooftop is making your head pound even more. God, the inside of your skull feels like wet smoke. \n\n\nFinally, the door unlocks, but your friend from high school is standing in the doorframe as it creaks aside. Well, not exactly friend. More like friend-of-a-friend, acquaintance kind of guy. Could you fit any more kids into a crappy shore house? You hardly know half the group with sleeping bags in your room. \n\n\n\"Thanks,\" you mumble, looking down as to avoid eye contact. \n\n\nHe doesn't move out of the threshold. \"You've been jangling your keys and cursing for ten minutes,\" he says flatly. \n\n\n\"Yeah, sorry about that. Remind me to never drink again,\" you trail off, pushing past the dirty t-shirt and boxers. He gives you a sour look, then trudges back to whatever room he was sleeping in. \n\n\n\"Piss off,\" you whisper. God, could he be any more patronizing? You practically hurl yourself onto the nearest couch in the living room, dropping the shoes and wallet you already had hanging from your hand as you walked home. Yeah, laying down is much better. But would this headache ever stop? \n\n\nDespite that, you feel yourself slowly drifting off, the sounds of passing cars, crashing waves, and barking dogs getting softer and softer by the second. \n\n\nAnd you close your eyes. \n\n\n ", "action_results": [{"action": "Wake up?", "result": "Deep in sleep, you're interrupted by someone's alarm. Slowly getting louder, the ringing in your head just reminds you of last night's headache... and brings it back again. Great. Would somebody just shut that off? You try to keep sleeping, but the blaring noise continues. \n\n\nRrrrr.\n\n\nRrrrr.\n\n\nRrrrr.\n\n\nIt won't stop but it sounds oddly... familiar. It puts a strange but well-known pit in your stomach.\n\n\nRrrrr.\n\n\nFuck, its so close, it's--it's--\n\n\nIt's the sound of your school bell. \n\n\nYou eyelids burst open as you quickly sit up straight in your desk. The bell immediately stopped, and it's silent. Your vision, still blurry, can make out a classroom. As your eyes adjust, you realize that it's your old senior homeroom, and looking around, you see that there's nobody here but you. \n\n\nYou look back down at the small puddle of drool on your desk. You didn't notice it before, but you're panting and your heart's racing. Calm down, you begin to tell yourself, it's just a dream. But it doesn't quite feel like a dream. \n\n\nPutting you head back down to force yourself asleep again might work, but all you can focus on is the sound of blood rushing in your ears. Finally, you decide to look around and see if this is a dream after all. \n\n\nThough, it's hard to ignore the pit in your stomach.\n\n\n\n\n ", "action_results": [{"action": "Check the windows.", "result": "You slowly shuffle towards the the windows lining the right side of the classroom. It's so bright from just having slept, you can hardly see outside of them. \n\n\nThe sky's a muted grey. It's eerily blinding, but the sun's not shining through any of the clouds. In the distance, you can make out tiny black dots--birds flying around in circles, but never landing anywhere. You hope they're not vultures. \n\n\nTo your left, you can make out the school's flagpole. It's the only other structure amidst the fog, and it gives off more of a sentient presence than just an inanimate object. The flag is fluttering in the wind, and likewise, you fight off chills in your spine. \n\n\nLooking down, the fog is obstructing the ground, making the second-story height seem taller than you remember it being. In fact, staring down is making you dizzy. \n\n\nYou turn around from the windows. \n\n\n ", "action_results": [{"action": "Check the teacher's desk.", "result": "You make your way to the teacher's desk inside the classroom. There's really nothing there, except for what look like stray blank papers. Reaching to open the drawers underneath the table top, you notice a small, silver keyhole on them, replicated on all the desk drawers and filing cabinets. \n\n\nTurning around, you see the large, familiar blackboard behind the desk. \n\n\nIn general, the classroom seems weirdly empty. You remember that there was just more in here from when you were a student, but you can't remember what. Posters? Decorations? People? Now, it's a shell of what's still inside your fading memory. \n\n\nThe incessant quiet still rings in your ears. \n\n\n ", "action_results": [{"action": "Open the drawer.", "result": "You try tugging at the drawers in the teacher's desk. They're all locked. \n\n\nYou let out a frustrated sigh. You don't know why, but you get the feeling that there's something important in one of the drawers. \n\n\n ", "action_results": [{"action": "Return to looking at the desk.", "result": "You're back at the teacher's desk. Nothing much has changed since you've last looked around. ", "action_results": [null, {"action": "Examine the blackboard.", "result": "Looking more closely at the blackboard, you see fading chalk markings smudged across the surface from last semester. It's been erased, so it's impossible to make out any words that were written on it, though it's clear that somebody wrote something. \n\n\nIn the bottom corner, there's a portion that hasn't been erased very well. Looking closer, you vaguely remember that this was the spot your homeroom teacher reserved for putting up schedule changes and announcements for your class. \n\n\nIt's difficult to read, but you can see the remains of a couple words. \n\n\n\"Stop... lying Assembly... ternoon\" \n\n\nUnderneath are more smudges, but they're too well erased to decipher. \n\n\nAssembly? You strain to remember any assemblies from the end of the year. Did you even go to one? \n\n\n ", "action_results": [null]}, {"action": "Leave the classroom.", "result": "You walk over to the door of the classroom. It's just barely cracked open, so you push it slowly--it seems heavier than you recall, as you strain to move it. The hallway seems bare, lined with rows of identical classrooms and doors. \n\n\nFaintly, you remember the loud, crowded movements of passing period, everyone cramming in the corridor to get to their next class. How your friends pulled you aside to relay the day's latest gossip, or how the sun shone at just the right angle on those rare days that you stayed for student council meetings. How it warmly hit your face and illuminated the whole west wing of school, as you and your friends laughed about--\n\n\nYou blink back to life. The reminiscence suddenly stops. All that's left is the empty hall with its single ghost peeking out of its old homeroom class. \n\n\nEnough. Focus. Now how to get out of this... Dream? Memory? Hallucination? To your right, you see the bathrooms at the end of the hall. To your left, you see a staircase in the mirrored spot. ", "action_results": [{"action": "Go south, towards the bathroom.", "result": "You head towards the bathrooms. The experience still seems so familiar, yet so distant--it must be the one thousandth time you've walked this same path, but it feels completely new, somehow foreign. The claustrophobic stillness of nothing but your clacking shoes against the linoleum floor makes you anxious. \n\n\nYou come to the bathroom door. You almost jump in surprise as you push it inward--not unlocked. The prospect of walking into the dark room makes your outreached hand shake a bit. Is it worth risking venturing inside? ", "action_results": [{"action": "Turn around and head back down the hallway.", "result": "You're back in the hall, the bathroom door at your side. You can't sit around forever... there must be a way out somehow. ", "action_results": [{"action": "Go north, towards the staircase.", "result": "You head towards the staircase. You can’t seem to shake the eerie feeling the hallway gives you--what if you never get out of here? It never felt like you left. It still never fully set in that you graduated from here. It never felt like your life ever officially started. All you’ve been doing is partying and drinking your summer away. You thought it would be the best time of your life, but you just feel… empty. It’s like you would give anything, anything to go back here--the real here, not the twisted alternate universe here--and start over. Maybe then you would have ended up happier. Not that you would have suddenly become a straight A student or become a saint or anything, but maybe--just maybe--you would have found something that actually fulfilled you.\n\n\nFuck, why are you rethinking your entire life right now? It’s like this place is reading your mind or some shit.\n\n\nYou come to the end of the hallway to the stairway entrance. It looks darker down the stairs--there aren’t any windows from here on.", "action_results": [{"action": "Continue down the stairs.", "result": "You wander down the stairs as your vision adjusts to the lower light. There’s nothing much around in the stairwell. At the bottom of the stairs are the doors leading into what you remember to be the cafeteria. To the left of those doors in the alcove under the stairs is another door for one of the custodian closets. Other than that, it seems to be a dead end.", "action_results": [{"action": "Examine the cafeteria doors ahead of you.", "result": "In front of you are the large double doors that lead into the cafeteria. They have big push handles and windows, but the glass seems to be covered up with black paper on the other side. \n\n\nYou try to push the doors, but they're closed shut. They seem to be locked from the inside. ", "action_results": [{"action": "Turn around.", "result": "You're back at the bottom of the staircase. Nothing much has changed since you've last looked around. ", "action_results": [null, {"action": "Examine the custodian closet doors to your left.", "result": "You turn to look at the door to the custodian closet. It's just a plain wood door. Except, instead of the knobs on all the classroom doors, there's a metal pull handle and a keyhole. \n\n\nYou pull on the handle. Locked. Isn't anything here open? \n\n\nYou faintly remember that the custodian doors are pretty easy to break into. You and your friends would break in pretty frequently with... something that you always had on you. What what it? Shit, you can't remember. \n\n\n ", "action_results": [null]}, {"action": "Head back up the stairs.", "result": "Heading back up the stairs, you find yourself back in the same spot you were earlier. You can't keep track of how long you've been here for--you can only see the fog ouside of the windows, and the light has not changed since you've arrived. You could have been here for minutes or hours. \n\n\nThere's only so many places you can explore--all the classroom doors except for your homeroom are closed, automatically locked from the inside. There not much else to look at in the hall. The school seems to be wiped clean of anything significant. ", "action_results": [null, null]}]}]}, null]}]}, {"action": "Head back into the bathroom.", "result": "Stepping carefully and nearly holding your breath, you slowly make your way into the upstairs bathroom. As the lights slowly flicker on, the door sluggishly creaks and shuts behind you. While the orange florescent glow still strobes, you look around the room. It's a typical high school bathroom--there are a couple of stalls and a sink with a mirror. It's dirty and has an unpleasant odor… you laugh. Just like you remember. It’s not exactly a place you want to stay inside of for very long.", "action_results": [{"action": "Examine the sink more closely.", "result": "You go over to the sink. The mirror is strangely fogged, so it’s difficult to see your reflection in it. Squinting, you can make out your general figure, your hair, some details on your face. It looks like yourself, big surprise. Though, at the same time, it’s relieving--you half expected to see a ghost or something.\n\n\nYou look down at the sink. It’s just a dirty sink. But wait a second, there’s something on the ground next to it--it looks like a small card of some sort. ", "action_results": [null, {"action": "Keep looking around the bathroom.", "result": "You’re back in the entrance of the bathroom. Nothing much has changed since you’ve last looked around.", "action_results": [null, {"action": "Look at the stalls.", "result": "Walking over to the bathroom stalls, you almost hope to find something--anything--to help you get out of the school. There’s nothing to pick up.\n\n\nThe first stall is bare. There’s a toilet, but there’s no water in it; the smell of ammonia is nauseating. Everything seems like it hasn’t been cleaned in… months? Years? There’s no toilet paper in the holder.\n\n\nThe second stall is much like the first--bare. The toilet has no water, but instead replaced with a black, inky liquid. Looking around though, there’s some graffiti on the walls. With sharpies scribbled all over the walls, the messages read:\n\n\n“…’s a worthless piece of shit”\n\n\n“Go die, fucker. You know who you are -T.S.”\n\n\n“What made you think anyone fucking liked you …?”\n\n\nPits form in your throat and your stomach. There are more written, but you can’t bring yourself to read them. You remember at the last bell of the day you and your friends would pass that look around and head down to this corner with a… target. Sometimes they owed you something, sometimes they were spreading stuff, and sometimes they were too weak to fight back. You remember how the group pulled them into the stall, eyes glazed over. The guy two rows behind you in chemistry was even known to hide a switchblade in his backpack. You just stood and watched from the back though when it happened, trying to avert your gaze but sometimes glued to the spectacle.\n\n\n“Motherfucker.”\n\n\nAnd with that, everyone dispersed. Everything went sunny again, and you laughed down the hallway with your friends. A silent agreement to never speak a word to anyone.\n\n\nA sharp intake of breath and you’re brought back to life. The pits are only getting deeper and deeper as you gag down vomit. There’s one last note that’s different from the others, and it's scratched in at the bottom of the door:\n\n\n“I’ve gone grey. I’m trapped. It’s payback. I’m sorry.”\n\n\nThat’s it. That’s what’s different about this place--there’s no color. Everything’s grey.\n\n\nYou don’t know whether to laugh out hysterically or burst into tears. Either way, letting yourself go insane inside a toilet stall is not getting you any closer to escaping.\n\n\n ", "action_results": [null]}, null]}]}, null]}]}, null]}, null, null]}]}]}, null, null]}]}]}]}