{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=26441", "context": "", "first_story_block": "You wake up, the morning is surprisingly warm for late October. Leaves cling to the trees and litter the ground. You look out, everything is wet, you slept through quite a storm. You stretch your arms wide and arc your back. You feel well rested. From downstairs you hear your mother calling for you, you:", "action_results": [{"action": "Go downstairs and go to school", "result": "Your mother smiles at you as you come down the stairs. Your hair is well combed today and she notices.\n\n\n\"Who are you trying to impress?\" She asks.\n\n\nYou, of course, being the teenager you are, don't answer her. She doesn't need to know about your love life (or lack thereof). She makes you toast with your favourite spread for breakfast and packs you a lunch. You trudge out the door and head to class without thanking her.\n\n\nWhen you reach your final block of the day you realize you have not finished your homework. Your psychotic 4th block teacher is going to murder you. Literally murder you and hang your head up on a metal spike for all who think they can get a good grade in his class.\n\n\nDown the hall you cower in fear at attending his class and go over your options in your little head:", "action_results": [{"action": "Go to town with your friends", "result": "Your friend gives you a ride to the city where you meet with a group of friends. You eat frozen yogurt and buy costumes for the upcoming Halloween parties you will surely be invited too.\n\n\nWhen you return home your mother is disappointed in you. You understand her and go to bed without dinner.", "action_results": [{"action": "Sleep.", "result": "You sleep well. You dream of strange, terrible things, by the time you wake they are nothing but distant memories of something that happened to someone else in another life. You let the dreams drift away, you carry on with your life.", "action_results": []}]}, {"action": "Go home", "result": "You go home and realize you stink. You slip into a nice warm bath.\n\n\nYou hear a noise to your left. You turn your head, slowly at first, but then once you see what is there you lurch.\n\n\nA clown is staring at you, his cruel face painted into an eternal smile.", "action_results": [{"action": "Bathe", "result": "As you scream you lurch away from the clown and your head dives below the water. Hot, sudsy water flows into your fragile lungs. You cough and it does not help.\n\n\nThe clown's hand is on your chest, it pushes you below the water, everything burns. You thrash, it is no help, the clown is stronger.\n\n\n\"I didn't want to hurt you,\" the clown says softly, his voice is low and raspy.\n\n\nYou push against him, naked and afraid you fight for your life.\n\n\nYou lose.\n\n\nThe clowns lips pull into a small smile.\n\n\nHe leaves your body in the bath.\n\n\nWhen, hours later, you are found, you are an almost unrecognizable prune of a body. It really is quite gross.\n\n\n ", "action_results": []}]}, {"action": "Attend the class anyway", "result": "You slink into the class and notice something written on the board. Your terrible little eyes can barely read it so you ask the girl next to you what it says.\n\n\n\"The assignment isn't due until tomorrow,\" she says.\n\n\nYou nearly cry from relief. It hurts you are so happy. You feel euphoria rushing through your bloodstream, you are so happy it smells like summer in the classroom, like campfires.\n\n\nYou are snapped out of your stupor by screams from down the hall. You then realize that flames are licking at the door. You are trapped.", "action_results": [{"action": "You try to escape", "result": "It is no use. You try to escape but you cannot. The flames tug at your clothes. They melt your fragile skin. You hear screams surrounding you, they are as hot and painful as the fire and you wonder if they are your own.\n\n\nThe pain is unbearable, you look down at your charred blackened fingers and try to move them, they crumble away and you collapse into eternal agony.\n\n\nAs the inferno begins to devour you you hear a noise, a strange noise above everything else.\n\n\nIn your dying moments, you cannot be sure, but it almost sounds like laughter.", "action_results": []}]}]}, {"action": "Go downstairs and go to work", "result": "You dress slowly in your nicest clean clothes. (not much is clean, so your clothes really isn't that nice, but you tried. That's what matters!) You brush your teeth and meander downstairs.\n\n\n\"It's already 8:02!\" your mother tells you. She hands you some toast and you run out the door to catch your bus.\n\n\nIt is a long day of work, when lunch time finally rolls around some office friends invite you out for lunch. You really want to go but you still have so much to do. A girl Amy offers to bring you back something if you'll run down to the storage room and grab some more printer ink while shes gone. You also remember that you have a cup o' noodles in your desk you could make.\n\n\nWhich do you choose?", "action_results": [{"action": "Go out for lunch anyway", "result": "You go to your favourite rooftop restaurant that serves greasy burgers and crispy fries. You lookout over the city, it is a crisp day, you are sitting outside.\n\n\nThere is a noise like someone popping the top off of a bottle of champagne, only it is so loud it reverberates in your bones and makes your stomach curl in on it self. You know something is wrong before you look to see your waiter-the kind teenager with warm eyes and spiked hair-laying on the cool pavement. His eyes are no longer warm, his life pools on the ground in a black puddle.\n\n\nBy the time you register what is happening 2 more people have fallen, metal lodged in their sides from the masked gunman's weapon. You run to get away, but there is nowhere to go. People hide under tables, the metal legs simply make a prison for them as they try to crawl away from the impossibly fast shots.\n\n\nYou see your friend, Amy, she is twisted so unnaturally, her light hair impossibly dark. It glistens in the early-afternoon sun. If you could remove her from the context, she would look beautiful.\n\n\nYou are curled in a corner, against the glass sheet of the railing. You look down, your heart pounds against your ribs, it is almost as loud as the gunfire.\n\n\nYou realize then that there is a balcony only 2 stories below, perhaps you could get help if you could land correctly.", "action_results": [{"action": "Take my chance with the gunman", "result": "You press yourself even closer into the glass as the gunman notices you. You cower in the corner and hope. He lines up the gun and shoots.\n\n\nIt misses.\n\n\nInstead of an explosion of pain you feel nothing. Part of you registers the sound of glass shattering so loudly it may as well be exploding from inside you.\n\n\nThat is when you realize what's happened.\n\n\nThe glass that held all your weight has fallen away. You are falling too.", "action_results": [{"action": "Scream", "result": "For a moment it feels as if you are floating. The air encompasses you gently and you drift.\n\n\nThe wind begins to rip at your clothes, your skin, everything hurts. You miss the balcony below you and continue to plummet downward at impossible speeds. The air presses against you so hard that you can feel your bones moving, your organs shifting in your flesh.\n\n\nPain erupts from inside of you as you scream. Your heart ;leaps into your throat.\n\n\nIn a moment, when you hit the cold pavement 11 stories below, it leaps 4 feet to your left.\n\n\nIt is awful for the cleanup crew.", "action_results": []}]}, {"action": "Jump to the balcony", "result": "You wait until the gun man looks away and scurry over the glass railing.\n\n\nYou take a deep breath.", "action_results": [null]}]}, {"action": "Go get the printer ink", "result": "You ask Amy to bring  you back a burger and fries and get back to work. After finishing some very very important task you decide to stretch your legs and get the printer ink.\n\n\nAs you run down the stairs Frank, the janitor, reminds you the door on the supply room isn't working very well.\n\n\nWith a big tug it opens, you jam a door stopper in it to keep it open and venture into the dim room.\n\n\nYour stomach lurches into your throat when you hear the door slam shut behind you.\n\n\nYou run to it and pry at the handle. It is no use, it is stuck. You scream for help. The hairs on the back of your neck prickle.", "action_results": [{"action": "You are afraid.", "result": "Spiders. Everywhere.\n\n\nBig. small. medium. hairy. slimy. opaque. translucent. on webs. on the floor. on the ceiling. on the walls.\n\n\nThe biggest is the size of a dog, (we're talking golden retriever not Chihuahua).\n\n\nIt crawls towards you, slowly at first, it's freaky-little eyes blinking at you in curiosity.\n\n\nWhatever was in your hands, you've forgotten by now, clatters to the ground.\n\n\nHundreds of smaller spiders begin to jump at you. The force of all of them paired with your blinding fear pushes you against the door, you scream for help, no body comes. The spiders begin to crawl into every hole they can find. They choke you nad blind you and they squeeze in through your eyes and down your throat. All you can hear is your own screams. Soon the spiders run out of holes to fill and begin  making their own.\n\n\nThey tear into your fragile flesh. They begin to eat your flavourful skin. By the time they return to their webs, there is no sign you ever existed except for the 83 cents that had been in your pocket stacked nicely by the door.", "action_results": []}]}, {"action": "Microwave some noodles.", "result": "You fish through your desk and below some crinkled papers and loose paper clips you find a cup of noodles. You head into the break room and put it in the microwave.\n\n\nYou get distracted thinking about that hottie from cubical 3C. You are so caught up you don't smell the smoke.\n\n\nYou don't notice the flames until they have trapped you.", "action_results": [null]}]}, {"action": "Fake being sick to get out of your obligations", "result": "You crawl back into bed and yell out that you are not feeling too well and can't go today. You cough (quite sadly I'll admit, is that really your best fake cough? Pathetic.) and wait until your family leaves.\n\n\nYou don't have any big plans for the day, but you realize you could make some:", "action_results": [{"action": "Marathon Netflix all day.", "result": "After 5 and a half hours of Orange is the New Black you remember your mother just did a costco run! You run downstairs and hesitate, in the freezer there are your favourite microwave burritos, in the basement there are boxes of mac and cheese. Which do you want to eat?", "action_results": [{"action": "Mac and cheese.", "result": "You jog downstairs and push a cobweb out of the way as you enter the basement. You don't bother with the light, you know exactly where your mum keeps the mac and cheese. You take two steps in and the door shuts behind you. You think it's strange but are not worried, until it won't open.\n\n\nYou flip on the light and, despite your better judgment you turn around.", "action_results": [null]}, {"action": "Burritos", "result": "You microwave a burrito and go back to bed. You sleep well with a warm full belly.", "action_results": []}]}, {"action": "Sneak out.", "result": "Now that the 'rents are gone you decide it's time to have some fun! Unfortunately there is no way of doing that in this big boring house alone.\n\n\nI hate to tell you this but...\n\n\nYou smell.\n\n\nHow do you fix that?", "action_results": [{"action": "I don't", "result": "Okay....\n\n\nno actually thats not actually an option. That's gross.\n\n\nYou are a gross little human okay?\n\n\nPlease clean yourself.", "action_results": [{"action": "Fine. I'll take a bath", "result": "You slide into the sultry, hot, steaming soup of your own filth. It feels quite nice.\n\n\nYou hear a noise to your left, you turn your head slowly.\n\n\nLooking you in the eyes is a clown with curly, rainbow hair, and a red circle nose.", "action_results": [null]}, {"action": "Fine. I'll take a shower.", "result": "You hop in the shower, a bottle of conditioner falls on your toe. You cry own in pain, after a deep breath you are alright.\n\n\nYou dry off and do your hair as nicely as possible. It still looks awful. I'm sorry. You did try though.\n\n\nSo you and your horrible hair style have to decide what to do today.\n\n\nYour friend Amy invited you out for lunch with some friends from work, some other friends invited you to go the city with them.", "action_results": [null, null]}]}, null, null]}]}]}