{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=23381", "context": "", "first_story_block": "As your walking down the twisted path, you overhear Paul and Dean talking about you becoming a demon. Those words keep bouncing in your head. A demon? They wanted you to become a demon? At first you remained quiet about it. Thinking it over. But then you decide it's time to ask.\n\n\n\"What did you mean you wanted me to be a demon?\" you ask boldly.\n\n\n\"Of course.\" Paul says. \"What did you think you were traded in for to be?\"\n\n\n\"Traded in?!\" You ask, your eyes wide. \"Wait a second.... Dean, I thought you told me I was dead.\" you say.\n\n\n\"You will be if you don't be quiet.\" He snaps angrily.", "action_results": [{"action": "You go quiet", "result": "You continue down the path with Dean and Paul quietly. So you were traded into Hell. That must mean you're not dead..... In that case, you really are a human. God hasn't turn his back on you yet. It had been someone else's fault you were down here. You feel fury run within you. How could someone send you to Hell? For a trade off?! What were they trading?!\n\n\nWait! The gang must've done it! The Vipers! People had always said they were demons, but really? Were they? You'd never believed in demons until now. Now that you were in Hell loaded with demons everywhere.\n\n\nSuddenly you get to the end of the path. You gasp in surprise and fear at what your next task is. Killing..... You've never killed before. Dean gives you a pleasant smile, like a child at Christmas.\n\n\n\"Good luck.\" he says moving towards Paul to let you in the ring.", "action_results": [{"action": "You enter the ring", "result": "You decide to enter the ring. You've come this far. Maybe it will be quick and painless. Maybe it's just a fight and not really killing someone? You hope it's like that anyway.\n\n\nYou're in a huge ring, where there's a barbwire gate all around you. The floor is cracked and unsteady. There's lights above you making it hard to really see because they're so bright. For a moment you're all alone. Suddenly a hand grabs you from behind and turns you around. You shriek in fear, but then realize it's just Paul. He looks a bit concern.\n\n\n\"Look,\" he says. \"In about 12 seconds, someone will enter from that door over there.\" He points to the second entry door. He then slips something cool and hard into your right hand. You look down and see it's his knife that he'd had earlier. \"I'm not supposed to be helping you. So don't pull this out unless you need it.\" He tells you. He guides your hand to slip the knife in your pocket. \"Now, little ones will be fast, but probably not as strong. Large ones will be strong, but not fast. Medium builds will have average speed, average strength. They'll give you 3 seconds to observe the other player. Assess them and do it quickly. Then attack first. No matter what you do, kill the person and don't die.\"\n\n\n\"Paul!\" you hear Dean shouting his name as if looking for him.\n\n\nPaul looks up then quickly whispers. \"I've got to go. Good luck.\" Then in a blink of the eye he's gone. You stand there and look for him a moment but the door behind you closes and locks so you look towards the other door, mentally preparing yourself. You're hoping a large one doesn't come in. You're not sure you could kill someone large.\n\n\nSuddenly the other door opens and a small, Asian girl, around the age of ten enters the ring frighten.", "action_results": [{"action": "Assess as the opponent she is", "result": "You assess her as the opponent she is. She's very small, even for a ten year old, and is crying. She will be fast, if she plans to fight. You see she's already got a slip limp, which you observed when she came in. You also notice the fear in her eyes. No doubt, she's scared and doesn't want to be here. Maybe you'd be doing her a favor to kill her? Or maybe you'd be killing an innocent little ten year old. Maybe you're just making excuses to justify your next move.\n\n\nThe bell rings signaling for you to start.", "action_results": [{"action": "You strike her in the head to knock her out before you kill her", "result": "You strike the girl in the head hard to knock her out so she doesn't feel any pain when you kill her. The demons boo, but a kill is a kill to them. You stare at the girl and start crying. This is your first kill. You feel immensely guilty for killing a ten year old girl. You're screamed at to step away from the girl and go back to your corner.", "action_results": [{"action": "You go to your corner", "result": "You go to your corner. You've clearly won this round. Do you have to face another round or will they let you out now? Demons come in and whisk the child you've just killed away. You still feel an overwhelming feeling of guilt and sadness. But it seems you will have to kill another to get out.\n\n\nThe second opponent is pushed into the cage and the doors slam shut again. This time it's a boy. He's around your age.", "action_results": [{"action": "You take the three seconds to observe him", "result": "You take the next three seconds to observe him. He is a medium build. He looks rather strong, or about as strong as you. Like the last girl, he looks terrified but unlike the girl, he also looks prepared. Perhaps he's been in fight before. You note you should be careful. You look him up and down as he does too. He's Caucasian. You notice all the scratches all over him, particularly his right arm that he seems to be holding close to him. He must've been through the briars too. You conclude your best option is to start with his arm. Perhaps if you broke it, he'd go down quickly.\n\n\nThe bell rings signaling for you to start.", "action_results": [{"action": "You immediately kick his right arm", "result": "You immediately kick his right arm, seeing that's your best option. As expected, he doesn't see this coming and falls back against the barbwire crying out in horrendous pain as his foot gets caught.", "action_results": [{"action": "You stop and help him out of the barbwire", "result": "You stop and help him out of the barbwires knowing how painful that must be for him. He suddenly sees you have a dagger and takes it from you holding it in the air.\n\n\n\"We've got a cheater!\" He screams.\n\n\nChaos erupts and the demons start screaming about how you're going to die. Suddenly both Dean and another demon enter the cage. You back over to Dean feeling much safer oddly enough with Dean than with the second demon. The demon takes the knife and both him and Dean look over it. Dean's face is hard to read but his eyes flutter to the corner where Paul is. So, he knows who's dagger it is, but does the other demon?\n\n\nThe other demon stares long and hard before turning to Dean. \"Is this or is this not, Paul's dagger?\" He says seriously.\n\n\nDean pretend to look back over it with a hard line on his face. But before he can say something, Paul enters the ring.\n\n\n\"It is.\" He says frustrated and sadly.\n\n\nDean clenches his jaw together and hands the other demon a special knife. You see the knife is made of iron. Dean turns furiously towards you but won't look at Paul. \"You come with me.\" He says to you. You have no choice but to come. Dean takes you outside the cage. You hear Paul's screams from inside the cage, but don't want to look back. Dean flinches every time Paul screams and makes his hold tighter and tighter until you're sure he's going to break your arm. He leads you down so many paths, that you've lost the way long ago. It's a long walk that you endure in silence. You notice Dean has suddenly started to cry.", "action_results": [{"action": "You ask him what's wrong", "result": "You ask Dean what's wrong. His hold on you suddenly increases tenfold and you hear a 'snap' of your arm being broken. You scream in pain falling to you knees and he stops glaring intensely at you.\n\n\nYou!\" he practically screams. \"Why would he help you?!\" Dean demands.", "action_results": [{"action": "\"I don't know!\" you cry", "result": "\"I don't know!\" you cry, tears flowing down your face. This only makes Dean angrier. He begins beating you senseless before finally killing you.\n\n\nSorry, but you've lost the game. Please try again by clicking \"The Second Test\" below. Also, please rate and leave comments. Thanks for playing!", "action_results": [{"action": "The Second Test", "result": "As your walking down the twisted path, you overhear Paul and Dean talking about you becoming a demon. Those words keep bouncing in your head. A demon? They wanted you to become a demon? At first you remained quiet about it. Thinking it over. But then you decide it's time to ask.\n\n\n\"What did you mean you wanted me to be a demon?\" you ask boldly.\n\n\n\"Of course.\" Paul says. \"What did you think you were traded in for to be?\"\n\n\n\"Traded in?!\" You ask, your eyes wide. \"Wait a second.... Dean, I thought you told me I was dead.\" you say.\n\n\n\"You will be if you don't be quiet.\" He snaps angrily.", "action_results": [null, {"action": "You press the subject", "result": "\"So I'm NOT dead?\" you press the subject more.\n\n\n\"Do you look it?\" Dean snaps turning around quickly. \"Look, you've made it this far, do you really want to test me right now? Because I won't hesitate to kill you, so you're permanently in Hell.\"", "action_results": [null, {"action": "You press the subject again", "result": "\"But if I'm alive, that means....\" you press the subject again.\n\n\n\"Absolutely nothing unless you pass the tests.\" Paul says seriously. \"Now unless you really want a pissed off Dean, stop asking questions.\" You feel as if he's genuinely trying to give you advice.", "action_results": [null, {"action": "Decide to ask another question", "result": "\"So, who sent me to Hell then?\" you ask.\n\n\n\"Me!\" Dean says suddenly attacking. You scream. Paul suddenly pulls Dean off.\n\n\n\"Please Dean. The human's clearly stupid, but we can train it.\" Paul says.\n\n\n\"Fine.\" Dean huffs. \"No more questions!\"", "action_results": [null]}]}]}]}]}, {"action": "\"Please let me go!\" you scream", "result": "\"Please let me go!\" you scream.\n\n\n\"NO!\" Dean howls. \"Paul is dead because of you!\" He hisses out before continuing to drag you along.\n\n\nHe takes you to a building known as the torture building, and leaves you there to die.\n\n\nSorry, but you've lost. Please click on \"The Second Test\" to start over. Also, comments are definitely welcomed, and thanks for playing!", "action_results": [null]}]}, {"action": "You remain quiet", "result": "You remain quiet. Dean takes you to a torture building and leaves you there to die.\n\n\nSorry, but you've lost. Please click \"The Second Test\" to try again. Also, comments are welcomed. Please rate and review. Thanks for playing!", "action_results": [null]}]}, {"action": "You kick him in between the legs", "result": "You kick him in between the legs. He's a guy, it's got to hurt. The guy falls down still tangled in the barbwire and so you continue to kick him giving him a bloody nose on top of it. You hear the guy begging for you to stop.", "action_results": [{"action": "You pull out your knife and kill him", "result": "You pull out your knife and kill him. He collapses in a blood mess. All the demons go silent a moment before a huge commotion is made.\n\n\n\"You've cheated!\"\n\n\n\"A demon has helped you!\"\n\n\n\"Disqualified!\"\n\n\n\"Kill! Kill! Kill!\"\n\n\nYour heart starts to beat faster. What are they yelling about. Aren't they happy you killed someone?\n\n\nSuddenly the door opens in front of you and Dean enters looking in a hot fury. He glares at you, his eyes blazing red.\n\n\n\"Where did you get that knife from?!\" He demands.", "action_results": [{"action": "\"From Paul.\" you answer", "result": "\"From Paul.\" you answer honestly. You're not about to risk lying to Dean.\n\n\nThe crowd hisses and shout all at once. Suddenly Paul's forced in the cage too. He looks terrified but angry at you for betraying him. Dean take the knife from you and observes it. He then looks angrily to Paul.\n\n\n\"Why did you do this?\" He asks Paul furiously, but you can hear some hurt in his voice.\n\n\n\"The human was going to die and you know it!\" Paul shouts. The demons all boo and hiss again, but Dean waves his hand and silences them.\n\n\n\"Why would YOU care?!\" Dean demands.\n\n\n\"It doesn't matter now. Just kill us and be done with it.\" Paul says bowing his head submissively.\n\n\n\"No!\" Dean shouts pulling out a blade wrapped in plastic. He slowly removes the plastic and you can see it's an iron knife. Paul looks very afraid now, but he doesn't move away. Instead he goes to Dean and kisses him softly before stepping back and standing submissively again.\n\n\n\"Do it, Dean.\" He says quietly.", "action_results": [{"action": "You just stare in shock", "result": "You just stare in shock. Suddenly Dean strikes Paul with the knife. The knife cuts open Paul like a laser. He screams out in horrible pain as blood gushes to the floor from his body. He clenches his teeth and continues staring down at the ground submissively. You're so confused. Weren't they a couple? Isn't that why Paul had just kissed him? Yet, here Dean was, abusing Paul.\n\n\nAnother slash is made and another and another. You want to do something but you're not sure what to do.\n\n\n\"Look at me.\" Dean says quietly. Paul looks up. He's crying. Dean clenches his jaw as if having a hard time with this.\n\n\nDean then hands him the knife. Paul's lips pinch together tightly before he aims the knife towards his own heart. Dean looks away. And suddenly, with a loud cry, Paul commits suicide.\n\n\nYou stare in utter shock as the demons cheer. Dean then turns towards you and begins taking out all his pain of loosing Paul on you. Eventually, after a while of torture, he kills you.\n\n\nSorry, but you've lost. Please click \"The Second Test\" to try again. Otherwise, leave your comments, and thanks for playing!", "action_results": [null]}, {"action": "You say, \"Leave him alone!\"", "result": "You say, \"Leave him alone!\"\n\n\nBoth Dean and Paul looks over to you. \"You! You be quiet!\" Dean demands harshly.  \"You're the one that's got him into this mess!\" He hisses.\n\n\n\"I'll do it....\" Paul says quietly. Do what, you wonder? But it becomes all too clear when he takes the knife from Dean. He turns to you and next thing you know, the knife is through your heart.\n\n\nSorry, but you've lost. Please click \"The Second Test\" to restart. Otherwise, comments are always welcomed. Thanks for playing!", "action_results": [null]}]}, {"action": "\"I had it when I came to Hell\" you reply", "result": "\"I had it when I came to Hell.\" you reply. It's a complete lie and you can see neither Dean nor any of the demons seem to believe you. They throw a huge commotion yelling at you to tell who gave it to you. Some even shoot some flames at you, which you jump back from.\n\n\n\"Who gave it to you?!\" He yells again.", "action_results": [null, {"action": "You say nothing", "result": "You say nothing, afraid to give Paul away and afraid they'll catch you on any lie you do. Dean suddenly grabs the knife from you to observe it. You can't read his face very well but he looks pissed!\n\n\n\"Who's knife is this?!\" He demands again from you.", "action_results": [{"action": "You look around and point to a random demon", "result": "You look around and point to a random demon. You're not going to call Paul out. You're not sure what will happen to the demon, but you're pretty sure it won't be good. You're not even sure if you're going to survive this.\n\n\nThe crowd of demons go wild and force that demon you've pointed to into the cage.\n\n\n\"I didn't do it!\" the demon shouts in fury. \"The human's lying!\"\n\n\n\"I swear to all of you, that's the one!\" you cry out.\n\n\n\"Guilty or Clean?!\" Dean yells to the crowd. Everyone in the crowd starts yelling 'Guilty' together. The demon turns in circles in panic before resting it's eyes on you.\n\n\n\"YOU!\" The demon hisses and growls. The growl is unlike any fury noise you've ever heard. It scares you. With sudden speed, the demon is upon you ripping you skin to pieces. You scream, but suddenly Dean pulls the demon off of you and stabs him with a different knife that looks to be of pure silver besides the handle.\n\n\nThe demon howls in pain flaring on the ground. Everyone cheers around you. You watch the demon slowly die. Then Dean turns to you with his eyes blazing.", "action_results": [{"action": "You scream in terror", "result": "You scream in terror.\n\n\n\"Guilty or Clean?!\" Dean yells to the crowd over your screams.\n\n\n\"Guilty!\" cries the crowd without a doubt.", "action_results": [{"action": "You beg for him not to kill you", "result": "You begin to beg for him not to kill you. Dean hisses at your weakness and begins stabbing you repeatedly with his original knife before finally just killing you.\n\n\nSorry, you've lost the game. Please click \"The Second Test\" to try again. Otherwise, comments are always welcomed and thanks for playing! Hope you enjoyed!", "action_results": [null]}, {"action": "\"Wait!\" you scream", "result": "\"Wait!\" you scream. But there is no waiting in Hell. Dean kills you.\n\n\nSorry, but you've lost. Please click \"The Second Test\" to try again. Thanks for playing and please leave your comments!", "action_results": [null]}]}, null]}, null]}, null]}, null]}, {"action": "You decide he's had enough and kill him", "result": "You decide that he's had enough f your cruelty and so you kill him. The crowd again cheers for you before telling you to go back to your corner. You wonder who's next.", "action_results": [{"action": "You go back to your corner again", "result": "You go back to your corner once again and the body is removed. Dean calls to you telling you this is your final opponent. Just make it through this kill and you're done. The thought relieves you and you feel guilty immediately. You shouldn't be killing! This is sooo wrong! Yet, a small part of you enjoys the adrenaline rush you get from it.\n\n\nSuddenly your next opponent enters the ring. He's a boy around your age. You can tell that immediately.", "action_results": [{"action": "You take the three seconds to observe him", "result": "You take the three seconds to observe him. You immediately can see how large he is. He's at least a foot higher than you and twice as big. You start observing for any weaknesses, but he seems to have none that you can see. He is also very buff, meaning he will hit hard. But you remember Paul telling you, the larger they are, the slower they are. She he may hit hard but he will be slow. You feel intimidated. This guy is huge and you're not sure you can take him. You look to find Paul in the crowd who is sitting there relaxed in the chair beside Dean, holding his hand. However, in his eyes, you can see a trace of concern.\n\n\nThe bell rings signaling for you to start. You look back to your opponent.", "action_results": [{"action": "You punch him in the stomach", "result": "You punch him in the stomach. It's like hitting a rock wall. Your hand seems to almost vibrate from the blow. He grins at you, and suddenly throws you back against the barbwire and it slices you back up. You scream in pain, but you can hardly get it out before he's pounding you hard. He punches you in the jaw breaking it no doubt, and blood immediately drips to the ground.", "action_results": [{"action": "You try to kick him between the legs", "result": "You try to kick him between the legs. It worked for the other guy, right?! So, you attempt it on this guy, however, he grabs your punch and lifts you into the air by your leg before throwing you to the center of the ring. He then body slams you with all his weight, which is a lot. The breath is knocked out of you and a ringing goes off in your ears. Your vision blurs a bit.", "action_results": [{"action": "You look to Paul on weither to use the knife or not", "result": "You find Paul in the crowd as the other guy is pounding you again and look at him begging him to look back and give you a sign to use the knife. This seems like a life or death situation. You find Paul and stares right at you before giving a sideways look to Dean, who is looking right at you too, before giving a slight almost unnoticeable nod.", "action_results": [{"action": "You pull out the knife and kill the guy", "result": "You finally decide to pull out the knife and use it. You'll die otherwise. You're sure of it. The guy is sitting on top of you just punching as hard as he can. You manage to get the knife in you hand and hide it as best as you can before pretending to punch him in the head one good time using the knife to stab him. You have to do this at least three more times, but you're careful not to really show the knife even though blood is now pouring from the guy's head.\n\n\nThe guy eventually goes limp and falls to your side. The crowd is silence a moment as you get up. A demon enters the ring and checks for a pulse. When she can find none, she turns to the crowd and raises her hands as if to say 'touch down'. The crowd explodes into cheer, everyone but Dean who looks pissed.\n\n\nYou try not to look his way and limp out of the cage as you were told. Demons congratulate you as you exit giving you evil smiles and then guide you to Dean and Paul. You can see Dean putting on a fake smile for the crowd that almost leaves you convinced he wasn't mad in the first place. But then you see Paul's eyes which are strained. You see their linked hands and it looks as if Dean is crushing Paul's hand in his own.\n\n\nWhen Dean beckons you to walk towards him, you obey without a word. You're limp and injuries are noticeable. Dean pulls on your arm to guide you away from the ring. As soon as his back is turned to the crowd, the smile turns into a hard line of fury. You look at Paul who tells you not to say a thing with his eyes. So you focus on trying to keep up with Dean and Paul's pace and don't say a word.\n\n\nCongratulations. You've made it through Chapter Three. Look out for Chapter Four, coming out soon. Please rate it and leave your comments below! Thanks for playing!", "action_results": []}, {"action": "You give up", "result": "You decide this isn't worth it. You're going to get killed anyway, there was no point of you getting pounded if you could just lay down and die peacefully. You give up.\n\n\nThe guy immediately takes advantage of you and snaps your neck.\n\n\nSorry, but you lose. Try again by clicking \"The Second Test\" at the bottom. Otherwise, comments are always welcomed and thanks for playing the game!", "action_results": [null]}]}, null]}, {"action": "You punch towards the face", "result": "You punch towards the face. He's a strange one, as he blocks your punch he bites your arm until it bleeds. You cry out in even more pain. What the hell are you supposed to do with this one?", "action_results": [null, null, null]}, null]}, null, null, null, null]}, {"action": "You decide you're done and don't want to kill anymore", "result": "You decide that you're done and don't want to kill anymore. Too bad, because the other guy does. And so you die.\n\n\nSorry, but you've lost the game. Please click \"The Second Test\" to start over. Thanks for playing and please leave your comments!", "action_results": [null]}]}]}]}, null]}, null, {"action": "You try to hit him in the head to knock him out before you kill him", "result": "You try to hit him in the head with all your strength to knock him out before you kill him, so he won't feel the pain. However, he seems to be expecting this and grabs your arm throwing you back towards the barbwires. You feel the spikes slice across your skin and you cry out in pain. He takes advantage of your weakness and kicks you hard in the stomach. You double over in pain. He slaps you across the face but pauses a moment when you fall.", "action_results": [null, null, {"action": "You beg him to stop", "result": "You beg him to stop. You can't possibly take much more. The demons are displeased with your weakness and cheer the boy on to kill you, and so he does.\n\n\nSorry, but you've lost the game. Please click on \"The Second Test\" to try again. Otherwise, thanks for playing and please leave comments!", "action_results": [null]}]}]}, {"action": "Decide you're not going to fight him", "result": "You decide you're not going to fight him. That's too bad. Because when the bell rings he immediately attacks you and kills you.\n\n\nSorry, but you've lost the game. Please click \"The Second Test\" to try again. Otherwise, leave your comments and thanks for playing!", "action_results": [null]}]}, {"action": "You numbly stand next to the girl", "result": "You numbly stand next to the girl as tears stream down your face. She never had a chance. She was so young. You can't help it. You break down and cry next to the girl. You can't believe you've just taken a life, not just any life, a TEN YEAR OLD's life.\n\n\nDemons come in to take the girl's body away and they again yell at you to get to your corner.", "action_results": [null]}]}, {"action": "You immediately pull out the knife and stab her heartlessly", "result": "You immediately pull out the knife Paul gave you and stab her in her heart. You are heartless about it, and usually demons love that. However, everyone around the cage, stops yelling and just stares at you as the girl dies. There's a huge muttering all of the sudden, and then Dean enters the cage.\n\n\n\"Where did you get that knife from?!\" He demands", "action_results": [null, null, null]}, {"action": "You run at her and kick her in her bad leg", "result": "You run towards her and kick her in her bad leg. She cries out in a child like cry of pain and falls immediately to the ground. The demons hoop and holler for you to keep going.", "action_results": [{"action": "You kick her in the stomach while she's down", "result": "You kick her in the stomach while she's down. This is not a little girl, this is your opponent. You have to start thinking like a demon, in order to get out of here. However, how can you find it in your heart to kill this small thing?", "action_results": [null, {"action": "You kick her in the head to knock her out and then kill her", "result": "You've decided she's had enough pain. So, you kick her in the head to knock her out before killing her so she won't feel the pain of the kill. The crowd seems to enjoy this with cheers of excitement. Once the girl is dead, you are yelled at to go back to your corner.", "action_results": [null, null]}, {"action": "You continue to kick her while she's down", "result": "You continue to kick her while she's down. Her cries get weaker and weaker, but you know you have to do this to get out of here. The crowd is going absolutely nuts at your ruthlessness.\n\n\nShe starts begging you to kill her.", "action_results": [null, {"action": "You snap her neck quickly", "result": "You snap her neck quickly and she dies. The crowd hoots and hollers. You are victorious this round. Once the cheering goes down they tell you to go back to your corner.", "action_results": [null, null]}]}, {"action": "You stop fighting", "result": "You stop fighting. She's clearly had enough. After a few moments, the demons start yelling at you to continue.", "action_results": [null]}]}, null, null]}]}, {"action": "Gasp and plan not to fight her", "result": "You gasp and plan not to fight her. When you hear the bell three seconds later, neither of you move too frighten. After a few seconds of you two just standing there, the demons surrounding the gate start to hiss and boo, screaming at you two to fight.", "action_results": [{"action": "You tell everyone no", "result": "You tell all the demons 'no' and that you're not going to fight. The hisses and boos get louder. Finally a door opens and hell hound are send in to rip you both to pieces.\n\n\nSorry, but you've lost. Please click on \"The Second Test\" to try again. Comments are welcomed! Thanks for playing!", "action_results": [null]}, null, null]}]}, {"action": "You run away", "result": "You run away. You're not killing anyone! No way!\n\n\nDean catches up to you and stand in front of you, blocking the path. \"If you don't do this, this will show you are a coward. And I will not take a coward in!\" He says angrily.", "action_results": [{"action": "\"I don't care!\" you yell", "result": "\"I don't care!\" you yell.\n\n\n\"Then I should kill YOU!\" Dean says seriously.", "action_results": [{"action": "\"Do it!\" you say", "result": "\"Do it!\" you say. And with his knife, he does.\n\n\nSorry, but you've lost. Please try again by clicking \"The Second Test\" below. Otherwise, comments are wanted and much appreciated. Thanks for playing!", "action_results": [null]}, null, {"action": "You don't say anything", "result": "You don't say anything. So he pulls out his knife placing it to your throat.\n\n\n\"CHOOSE!\" He demands.", "action_results": [null, null]}]}, null]}]}]}