{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=8097", "context": "", "first_story_block": "“SHUT UP! SHUT YOUR GODDAMN SCREAMING YOU BITCH! I’M TRYING TO CONCENTRATE!” you yell at the woman strapped to the table.\n\nNormally you don’t mind the screaming, indeed it can even bring a smile to your face, but right now you’re trying to write a love poem to your sister and it’s very difficult to focus when someone’s screaming for help. You have no idea why either, it should be painfully obvious to her by now that nobody’s going to come in to play white knight.\n\n“Alright I can’t take this anymore. Some people are so inconsiderate!” you say taking your scalpel and turning on your camcorder on the tripod. “Subject number: 483, proceeding to dissect vocal cords.”\n\nWith a couple of quick flicks of your wrist and cuts with your scalpel and it’s done. No more screaming. As you sew her throat back up, you giggle a bit since your patient looks a little funny attempting to scream, but nothing coming out. You remember back in the old days you didn’t have such skill and you resorted to cutting out their tongues. Very messy! But medical school paid off eventually. Sometimes you can forgive ol’ Mom for pushing you into becoming a doctor, when she wasn’t beating you with a ballpeen hammer that is.\n\nNow back to the matter at hand, your love poem to your beautiful sister. Your anniversary is coming up and Hallmark just doesn’t make cards for this occasion. Ah, just thinking about her gives you a big pink boner. You begin to grab yourself in a naughty way.\n\nDING DONG!\n\nFuck! There’s the doorbell! It’s probably those fucking Mormons again!", "action_results": [{"action": "Answer the door naked with a human vagina on your face!", "result": "Well whoever it is you got something that’ll make them think about ringing the doorbell again! You take off all your clothes and grab your rusty chainsaw. You answer the door to a cute little girl scout. Due to your outlandish appearance she doesn’t even have time scream before you take your rusty chainsaw and chop her head clean off causing the neck to spurt blood like a geyser. You take the vagina off your face and begin to do the “Mexican Hat Dance” around the body (that’s surprisingly still standing) as the blood squirts all over you.\n\nYou my friend are one sick fuck!", "action_results": [{"action": "Drink the blood to give you power!", "result": "You begin to drink the blood like a water fountain, just then the mail man sees you, and he immediately pulls out a gun from his mail bag!\n\n“Hold it right there you crazy motherfucker!”\n\nYou don’t even bat an eye, you just whistle, at which point your two pit bulls, Lucifer and Damien come running out from around the house and attack the mailman before he even gets a shot off. The dogs proceed to rip open his stomach and run off with part of his intestines, as the mail man gasps for help; you grab the axe by your front door and cut off each limb as the life flows out of his body.\n\nWhile this is all good fun for you, you suddenly remember you’re supposed to be writing your love poem to your sister.", "action_results": [{"action": "Wallow in your sick violent endeavors", "result": "You drag the corpses of the mailman and Girl Scout into the house and put some clothes on. You play with the bodies for a bit, putting them in obscene poses, when you kind of realize you REALLY should be writing that poem for sis. Then you get a cunning plan!\n\nYou take the mailman’s remaining entrails and begin to decorate the front room with them like crepe paper! You then rip a bone out of his rib cage and dip it into the blood and begin to write poetry on a blank wall of your house. Oh won’t she be so thrilled to see the effort you put into showing how much you love her!\n\n“Hmmm, what rhymes with decapitate?” you think.\n\nSuddenly you hear some noise coming from the kitchen. Damn! It’s that teenage girl you captured along side the road, you thought you had her firmly tied in the attic, and you thought cutting her tendons would prevent any escape attempts. As she’s trying to crawl out the back door, you grab a mallet and smash it into her spine, shattering it! She howls in pain, at which point you take a fillet knife and begin to skin her alive, finally after about a half hour of this you get tired of her screaming and take a mallet and smash her so hard in the back of the skull that the mallet goes straight through where upon her brains come oozing out. Hmmmmm tasty!\n\nWell you wasted a bunch of time and never finished your poem. Your sister just pulled up in the drive way and you’ve got bodies in the hallway, a body in the kitchen, entrails on the walls and blood all over the place.\n\nShe’s not going to be pleased about this mess you’ve made.\n\nHow do you want to handle this?", "action_results": [{"action": "Try to make up an excuse", "result": "You quickly wash your hands and try to think up an excuse, but there just simply isn’t time, when sis comes in, you just come off sounding like your retarded cousin Billy.\n\n“Um…hey sis, I uh…did you see the poem I wrote on the wall? I know it’s not finished, but uh…”\n\nYour stuttering excuses are not well received.\n\n“Goddammit! Y’know I don’t expect much from you, but it’s our fucking anniversary today and you can’t do ONE nice thing for me? What the fuck, you leave bodies in the hallway for me to clean up and blood all over the fucking place? And what’s dinner doing on the fucking kitchen floor? I told you a hundred times USE THE FUCKING TABLE! Christ, we’re not fucking animals!”\n“But baby, she almost escaped, I had to…”\n“I don’t want to hear it! I’ve had a hard day, but do you care? No, you all you think about is yourself! Shit, you’re like a fucking child sometimes! I’m going to sleep. And I mean SLEEP! You come sniffing for a little something in the bedroom tonight and you’ll have to use a strap on in order to fuck me in the future!” and with that warning she storms upstairs and you hear a door slam.\n\nOuch. You really screwed the pooch on this one. Better stay out of her way for a little while. You quietly return to the basement and find that your patient has died. Apparently, you didn’t sew that incision up as good as you thought and while she was still attempting to move her throat to scream, she split the stitches and bled out. Wonderful, now you’ll have to get another live subject. Still, no sense in wasting a perfectly good body.\n\nYou fuck the corpse, but it just isn’t the same as fucking your sister, she’s so much livelier. After you finish up, you decide to go get that live subject. You spend the rest of the night driving around in your car attempting to pick up a hooker. Strangely the streets are devoid of them tonight. Typical, Never a hooker around when you need one. Finally you strike lucky and one comes up to your car.\n\n“You lonely honey? I bet I can put a smile on your face.” she asks.\n“I bet you can. I bet you can…” You say with a sinister smile.", "action_results": []}, {"action": "Act like nothing happened", "result": "You decide to act nonchalant and cool. You grab the girl you were skinning and throw her on the table and continue to cut her up like you’re cooking dinner.\n\nSis comes in.\n\n“Hi honey! How was your day today?” you ask cheerfully.\n“Ugh, I don’t want to talk about it! Is that our mail man?”\n“Yeah, had to do it, he pulled a gun on me.” You answer.\n“Are you alright?”\n“Oh I’m fine, don’t worry about it.”\n“Is that what we’re having for dinner?” your sister asks pointing at the girl on the table.\n“Yeah, sorry about not having it ready yet, but as you can see I had a lot of visitors today.”\n“Hm. Well I’m tired anyway. I’m going to bed for a little while. I trust you’ll keep dinner warm. And as much as I adore the thought you put into the entrail decorations I trust that it, and the mess you left in the hallway will be cleaned up.”\n“Of course sweetheart.”\n\nYou kiss her before she heads upstairs, but before you pat yourself on the back too much, you hear her yell one last thing at you.\n“And if you’re going to write me a poem, use a fucking pen and paper! Don’t ruin the goddamn walls!”\n“Will do dear! Sorry!” you say.\n\nWell it wasn’t as bad as it could’ve been. Of course now you’ve got a lot of work ahead of you. You were hoping for a little action tonight, it being your anniversary and all, but instead you spend the rest of the day and part of the night preparing dinner and cleaning up your mess. By the time you’re finished, you’re very tired and rest on the couch eating some dinner while watching the history channel. Sis comes down at this point stating that something smells good, but you’ve already fallen asleep, with a bit of brains hanging from your mouth as you snore.", "action_results": []}]}, {"action": "Get back to your sick romantic endeavors", "result": "No more time to play around, sis will be home soon! You drag the bodies in the house and into the basement where you put them aside for later use. You put your clothes back on and check on your patient who is now unconscious. Good, you now have peace to work on your poem.\n\nYou begin to put your feelings to paper as quickly as you can. As you write you think it’s curious how you can easily write nice things about her. You have don’t really have good feelings at all towards most people; all you have is distain, and a wish to hurt them badly.\nIt’s basically as if you save all your pleasantness for her and why not? She’s the only one who’s ever stood by you. Right from the beginning…\n\nYou remember when you made your first kill, back in high school. You killed your so called best friend Johnny because he was annoying you and being unbelievably stupid. You two were in your room arguing over music. He claimed that Poison was the best band in the world, and you were insisting that Motely Crue was the best band in world! Then you he called you a faggot for liking them and then you ended up taking a straight razor that you’d been using on a cat the day before, and slashed him across the goddamn eyes! As he was screaming you turned up “Dr. Feelgood” really loud to drown it out and started to carve his face off! Naturally this noise attracted your sister who was in the house trying to study and she came in to tell you to turn it down. You can only imagine that you looked like a deer in the headlights when she opened the door to find you butchering your best friend, but she didn’t run, scream or even ask why you did it; she just said you needed to get rid of the body before mom got home. You and her dug a hole in the back yard and did a little cleaning and that was the end of it. As you dumped Johnny’s mutilated carcass into the hole together, that’s when you knew you found your soul mate. You can’t imagine life without her.\n\nAs you think about these things, you remember something else.\n\n“Wait a minute, why the hell was I defending Motley Crue so much? I listened more to AC/DC…. oh well, he was still pissing me off.”\n\nYou just finish up your poem as you hear sis come in the front door upstairs, now to present it to her.", "action_results": [{"action": "Do it in a romantic way", "result": "You run up stairs quickly to read the poem to her. She looks tired.\n\n“Hey baby, listen to what I wrote for you!” you say with the paper in your hand.\n“Hm? Can it wait? I’m really tired.”\n“Yeah, but it’s our anniversary and I put a lot of thought into this and everything.” you say with a hurt look.\n“Oh alright.”\n“Great! I really hope you like it!” you say excitedly and begin.\n\n“Oh my beloved, how I adore your long blond hair and beautiful face as much as I adore the pleading of my patients when they beg for their pathetic lives.\nOh my beloved, how I love your luscious red lips, which reminds me of the blood that drains from a hitchhiker’s artery after I slash their throat open.\nOh my beloved, how I’m obsessed with your perfect body and the smooth feel of it, not unlike that of newly polished child’s skull. But also its softness like that of intestines when I pull them out of a cheerleader’s corpse.\nYou are everything to me; I only go on living because of you. If you were ever to depart from this world, I would soon follow, in a bloody shoot out with the police after I sniped as many people as I could from a bell tower.\nI love you my dear sister, my lover, my life.”\n\nThen you gently caress her face.\n\nOH SHIT YOU ARE ONE SMOOTH MOTHERFUCKER!\n\nYou made your sister so fucking wet that she practically had Niagara Falls occur in her fucking panties. Her previous fatigue is suddenly gone when she jumps on you and fucks you right then and there on the floor.\n\n“Ahhh, flesh of my flesh, you’re still as tight as the day I broke your virginity.” You say as your dick slides into her.\n\nTwo hours later, sis is sleeping with her head resting comfortably on your chest, as you both lie there naked in the living room. With the smell of sex, blood and death still lingering in the air you smile.\n\n“Ah life is good.”", "action_results": []}, {"action": "Strip as you read it to her!", "result": "You run up stairs quickly to read the poem to her. She looks tired.\n\n“Hey baby, listen to what I wrote for you!”\n“Hm? Can it wait? I’m really tired.”\n“Yeah, but this is different, I got something special in mind!”\n“Oh alright.”\n\nYou begin to read your poem, while clumsily attempting to take off your clothes. It’s a half assed attempt all the way around. By the end of all of it, you’re standing butt ass naked in front of her. If you had chosen to do one or the other, your sister might’ve been more impressed, but instead she’s more amused than anything. Still, that’s at least a step in the right direction.\n\n“Okay, well that was a very sweet attempt to be romantic and I appreciate the effort, but I’m very tired and I’m going to sleep.”\n“Wait! Didn’t that do anything for you?”\n“Well other than laugh, not really.”\n“But it’s our anniversary, I thought we we’re going to…” you begin grinding up against her at this point.\n“Oh alright, if you must have your way with me you can, but don’t expect me to do anything except lay there.”\n“That’s okay, I’ll just pretend you’re a dead body!” you say and pick her up to carry her off to the bedroom\n“Wow, you really know how sweet talk a girl.” Your sister says half-asleep.", "action_results": []}]}]}, {"action": "Chop up the body and make cookies!", "result": "Not wishing to linger too much outside without any clothing on you quickly take the girl scout’s body inside and put your clothes back on. You then carry it to the kitchen and get out your cookbook of some of your favorite recipes. You swear if Mom hadn’t beaten you into to becoming a doctor, you could’ve been a world famous cook. Life can be so unfair sometimes.\n\nYou effortlessly chop up the body and begin taking some choice parts to put into your gruesome idea of cookies. You add dough, yeast and an unhealthy amount of chocolate and sugar and mix the mess together. Since you also have the idea that this can be something you and your sister can share you thoughtfully shape the “cookies” into hearts. (Awww!)\n\nWhile you’re waiting for them to bake in the oven, you take this opportunity to work on your poem again. When of course the fucking doorbell rings again! You grab an axe and make your way to the door.\n\n“I swear if these are those fucking Mormon…” you mutter as you open the door.\n\n“Howdy Doc! Mmm mmm! You got something cooking? Sure smells good! Hey me an’ Hugo got some new patient’s for ya in our truck! We’ll bring ‘em in!”\n\nWell it’s not Mormons, but it’s almost as bad, it’s your low life “assistants” Jed and his equally dim brother Hugo. They occasionally show up with some quality stock that they provide for either prescription drugs or money. Such distasteful characters, but sometimes it’s unfortunately necessary to associate with such individuals. Of course that doesn’t mean you have to like it.\n“Oh for fuck’s sake Jed, bring them around the back! We don’t need the world to fucking know. Christ you’re a pair of fucktards.” You say.\n\nYou head back to the kitchen and open the back door, as Jed and Hugo bring in a young man writhing in pain due to his arms and legs being completely broken and sticking out of the flesh. They dump him on the floor while you check on your cookies. You grab one and taste it. Hm, still needs some more time.\n\nIn the meantime your assistants seem to be having trouble with the other patient they brought. A young pregnant woman comes running through the kitchen not even noticing you and into your living room nearly tripping over her boyfriend, with Hugo and Jed in pursuit.\n\n“Get that bitch Hugo, get that bitch!” Jed shouts.\n“You don’t stand a chance girlie! How about you just give up now, and we’ll show you a good time before the Doc performs his experiments!” Hugo says as the girl swings a poker at him that she got from the fire place.\n“Woohoo! This one’s a fighter! I like that!” Jed says.\n“Get away from me you inbred pieces of shit!” the girl screams.\n\nYou sigh and shake your head as you watch this demented Laurel and Hardy routine from the kitchen. You grab your mallet and stealthily sneak up behind her and smash her in the head knocking her unconscious.\n\n“Shitfire Doc, you ain’t no fun. Hugo here might be dumber than a pile of shit bricks and twice as smelly, but least he knows how to make them squawk first. Especially when they gots a bun in da oven!”\n\nOf all the impudence! How dare this inbred peckerwood tell you who’s the MASTER at inflicting pain!", "action_results": [{"action": "Show him", "result": "You immediately grab a machete hanging above the fireplace and chop off Jed’s hand, at which point the stump spurts bright red blood all over the place!\n\n“ARRRRRGH! What the hell you do that for doc?” Jed shouts.\n“To remind you fucktards who the fuck I am! You and your brother have disturbed me and made a mess out of my house with your incompetence for the last time!” you say swinging again at Jed.\n“Hugo, get this crazy Yankee offa me!” Jed says running away.\n\nHugo hits you over the head with a vase. It barely fazes you. You respond by back kicking him in the face, knocking out what little teeth he has and knocking him to the ground. You then take the fireplace poker and shove it into one of his eyes and pull out the bloody orb, while he’s screaming on the floor begging for mercy, you do the same to the other eye!\n\nWhile you’re doing that, Jed comes back in with a shotgun, still bleeding profusely.\n\n“I’m gonna blast yer fuckin’ ass away an’ then I’m gonna feed yer fuckin’ corpse to the goddamn hogs!” Jed says trying to point the gun at you with only one good hand.\n\nAt this point the pregnant woman is just regaining consciousness and standing up, but unaware of her surroundings. You duck behind some furniture and push her towards Jed, who fires wildly. The blast kills her instantly and splatters her unborn fetus into a bloody mess all over the room! This gives you enough time to charge Jed who’s having a lot of difficulty trying to reload. You knock him to the floor, pick up the shotgun and blow off one of his legs.\n\n“AAAARGH! FUCK YOU DOC!”\n\nYou then grab the dismembered leg and beat him repeatedly with it until his head is an unrecognizable heap of gory mush resembling oatmeal. Hugo’s still screaming in agony clutching his hollowed out eye socket, you stop his screaming by jamming the poker through his mouth. Finally the young man who’s limbs were broken was attempting to drag his way out the back door, but you drag his ass back inside, slam the door and proceed to pull at his broken bones until you rip them out completely. He doesn’t even scream, he just dies, lying there as a partially boneless piece of flesh.\n\nThen you smell smoke. Shit! The cookies! You quickly pull them out giving yourself a good burn and dropping them all over the floor.\n\n“FUCK! SHIT! GODDAMMIT!” you yell.\n\nYou’re hot, you’re sweaty, you’re covered in blood, the house is a mess and there are dead bodies everywhere. And sis has just stepped in the front door.\n\n“Having fun?” she asks surveying the carnage.", "action_results": [{"action": "Try to explain", "result": "“Baby, I had everything planned out to make this day special and…other things just kept getting in the way…um you want a cookie? I made them for you.”\n“You mean those things on the floor? I’ll pass. Look, I don’t EVEN want to hear it right now. The only reason why I’m not pissed off as much I could be is because I see you killed those two fucktard assistants you had that I hated so much. Plus I’ve had a hard day and I’m too fucking tired right now. But I’m going to BED and when I come down, this shit better be fucking cleaned up and don’t expect to be playing “Stranger and Catholic School Girl” with me tonight because any attempt to do so, will result in severe pain to your most valuable players.”\n“Yes dear.” You say, protectively putting your hand on your crotch.\n\nYou spend the rest of the night cleaning up, which initially consists of you taking all the bodies into the basement and shoving them into your oversized freezer. You check on your patient, who is unconscious, but still alive. You won’t get to work on her though since you still have to mop up all the blood and pick up the meat chunks still littering the floors. It really just sucks all the way around.\n\nOh well at least you got to kill a bunch of people.", "action_results": []}, {"action": "Weep", "result": "You fall to your knees in defeat and hold your head in your hands.\n\n“Baby I tried so hard to do something special for you when you got home, I had a poem that I didn’t get to finish, I tried to cook for you and I fucked that up, and I made a mess of the house. Then all these worthless pieces of shit kept ringing the doorbell…I didn’t want this day to be like this.” You weep.\n\nYour sister goes over to comfort you.\n\n“There, there, its okay. I know you probably tired your best. Don’t worry. If it makes you feel any better, I always hated those two assistants you had, so I’m glad you killed them. You could consider that your anniversary gift to me if you want.”\n“Really?” you say\n“Sure.” She says and kisses you, which seems to make everything better.\n“Thanks, (Sigh) I guess I have a lot of cleaning up to do though.”\n“Oh don’t worry about that, leave it for tomorrow, its not like they’re going anywhere. Come upstairs with me.”\n“Alright!” you say and begin to grope her.\n“Down boy, I’ve had a hard day and I’m actually very tired and going to sleep, but I just want you to lie beside me and hold me.”\n\nNormally you’d complain about not getting any, but after the hard day you’ve also had, you wouldn’t mind getting some rest yourself, so you comply and you both sleep throughout the night holding each other.", "action_results": []}]}, {"action": "Let it go", "result": "You resist the temptation to chop your assistants and decide to just verbally abuse them instead.\n\n“Don’t fucking tell me how to inflict pain, I know things that would make you shit your trailertrash pants. Now you and your fucking brother get these patients down in the basement and fucking tie them to the extra tables.”\n“Even the one we broke his limbs?”\n“What the hell did I just say? YES! HIM TOO! GO!” you yell and smack Jed in the head with your mallet as an added emphasis. “And gag them too! I don’t want to be disturbed!”\n\nWhile Jed and Hugo follow your orders, you work on your poem again. After you finish it, you check on the cookies which are now done.\n\n“Ah yes! Some sweets for my sweet and a love poem to go with it! What better way to show that I care?” you say to yourself. You’ve always enjoyed the fact that your sister has never expected too much from you in the romantic gift department. She’s always been content with your constant obsessive love for her; for she knows if there was anything she desired you’d make no hesitation to get it for her.\n\nYou remember one time when you were in the mall and she wanted this really expensive ring she saw in a store, and you couldn’t afford it at the time, but she didn’t mind. However you could tell she really wanted it, especially when some old bat with too much money came in a few moments later and just bought it and left like it was the easiest thing in the world to fucking do.\nYou excused yourself and told sis that you were going to look in the bookstore for awhile. You then followed that old rich bitch to the parking lot, put on some gloves (You’re glad it was dark at the time) and choked the fucking shit out of her until her face turned fucking blue and purple. Then you took her keys, opened up the trunk of her car and threw her old ass in there and took the ring from her, returning back to the mall with nobody ever seeing anything.\nAnd that year on your sister’s birthday you presented that very ring to her, she was very surprised and overjoyed by it. She didn’t ask how you got it (Though she probably had an idea) she was just glad that you cared enough to get it for her.\n\nAnd isn’t THAT what love’s all about?\n\nWhile you reminisce about that day, sis steps in the front door. You immediately present her with your gifts.\n\n“Happy anniversary baby!” you say\n“What the hell are your inbred assistants’ truck doin’ here? You know how much I can’t fuckin’ stand them! I don’t even know why you insist on working with such people.”\n“Oh they just brought over some new patients and tying them up in the basement. Those fucktards will leave soon. Just think I won’t have to go out myself and get new patients for awhile, which means I can spend more time with you.” You say holding her.\n“I don’t give a fuck. I’ve had a hard day, I’m tired, and I don’t want them here. Get rid of them NOW!” your sister demands.", "action_results": [{"action": "Get rid of them", "result": "Well whatever sis wants, she gets.\n\nYou go down into the basement to get rid of your assistants; they’ve been taking way too much time tying up your patients anyway. When you get down there Jed and Hugo seem to be taking “liberties” with your patients!\n\n“What the shit?! GET THE FUCK OFF OF MY PATIENTS! These are to further science, not for personal pleasure! Well not for YOUR personal pleasure anyway! Get off!”\n“I was tryin’ to doc!” Jed says trying to avoid your beatings to his head and attempting to zip up his pants at the same time.\n\nYou prod them both back up the stairs and out the door, when Jed and Hugo get in their truck, Jed suddenly asks for payment.\n\n“Hey doc! What about our payment for bringing you the patients?”\n“Jed you’re lucky I even let you fuckin’ live! My sister just came in and pitched a bitch about you fucktards being here. Fortunately I’m in an unusually generous mood and you’ve proven yourselves useful today despite your idiocy.” You grab a variety of pills from your pockets and shove them into Jed’s hand. “Here! Take these as payment you goddamn junkies and I hope you fuckin’ choke on them!”\n\nJed shakes his head. “You’re wrong doc. You ain’t right.”\n“Get the fuck outta here!” you yell and kick their truck as they leave.\n\nYou go back in the house only to find sis asleep on the couch. She looks so peaceful and lovely; you don’t want to wake her up. You give a little smile when you see she has your poem in her hand. You give her a kiss on the lips and head back to the basement. You check on your patients, they all look very terrified as they continue to squirm for freedom. Muffled yelps come from the new patients and of course no sound at all comes from your old one.\n\n“No need to fret, the two dirty hillbillies are gone. There won’t be any more molestations from them, just pure research. Really that was no way to treat a woman in your condition. You could’ve had a miscarriage over such a traumatic event.... hmmm, that’s an interesting concept. Let’s test that.” You grab a wicked looking electric saw.\n\n“Ah yes this will do nicely, not to kill, but just to maim a little, perhaps starting by cutting some meat off the shoulder.” You look at your other two patients. “Oh don’t worry, I haven’t forgotten you, everyone will get their turn to provide for science in their own way.”\n\nAs the saw hits the bone, a muffled scream is emitted. You wish you could hear it in its pristine state, but dear sister is sleeping and you are always considerate to her.\n\nSometimes sacrificing one’s own pleasure is necessary to appease the ones we love.", "action_results": []}, {"action": "Get rid of them...permanently", "result": "You’re a little hurt that your sister didn’t appreciate your gifts and just bitched you out for no good reason. You have feelings and while they don’t manifest themselves in the normal way, you do have them.\n\nYou angrily storm down the stairs to get rid of the two dickheads who got you into trouble in the first place, they should’ve been done by now anyway. When you find them, they’re taking liberties with your patients. Typical. No imagination. You’re out tolerance for their low life antics. They’ve spoiled your day by even showing up. You grab an electric saw and flip the switch. Jed turns around and stops his debauchery for a moment to see you.\n\n“Hey Doc! Hope you don’t mind, you ready to join the fun?” Jed says\n“You could say that.”\n\nYou then lunge at Jed with the saw and drill it right between eyes! He lets loose a shout and falls off the table, with blood and brains leaking out of the hole.\n\n“MY BROTHER!” Hugo yells and attempts to grab you, but you cut off some of his fingers in the process. While he’s screaming about that, you kick him in the balls and when he falls you run the saw across his back and pull out his fucking spine dripping of spinal fluid and blood, killing him instantly.\n\n“THERE! I GOT RID OF THEM! YOU HAPPY NOW?!” you yell at the top of your lungs.\n\nTotally immersed in blood lust and still angry about being scolded and feeling unappreciated, you begin to attack your tied up patients as well, cutting them up into bloody chunks, until nothing except you is still breathing in the basement.\n\nFeeling spent, but still mad, you pant heavily as you climb the stairs, to tell your sister you carried out her wishes like you ALWAYS do. That’s when you find her asleep on the sofa, looking the very personification of beauty. Your previous anger is leaving you, and when you see that she has your poem in her hand, it leaves you completely.\n\nYou feel a euphoric joy. She did appreciate your gifts.\n\nYou kiss her on the lips without waking her up, and go change your clothes. You then head up to the attic, where a young woman you picked up from along side the road not to long ago, is tied to a chair. Looks like she’s been trying to get free too, she wouldn’t get far though considering the first thing you did was cut her tendons.\n\n“Well it appears an opening in my patient roster has occurred. I can see you now. And I can assure you; it will hurt, A LOT.”\n\nYou turn on your saw…", "action_results": []}]}]}]}, {"action": "Ignore it; you forgot where you placed the vagina anyway!", "result": "You can’t let anything distract you from your task at hand. You let the doorbell ring and whoever it is goes away eventually.\n\n“Okay, let’s see, what rhymes with disembowel?” you think. You continue to write with a focus that’s often only unleashed when you’re immersed in your murderous activities or fucking sis. Actually it’s amazing how often those two can overlap sometimes.\n\nYou remember one time you and sis were in the car on top Lover’s Point, with nobody else around looking at the moon and stars. You two were getting hot and heavy with the kissing, you felt up her tits, she grabbed your dick and she was just putting her luscious lips on your sperm syringe when this FUCKING BUM came knocking on the window begging for fucking change! Man, were you fucking PISSED! You couldn’t think of anything else except doing this piece of shit scum lots of bodily harm. You got out of the car and the first thing you did was throw the shitbum to the ground and started smashing his face into the pavement! His whimpers of mercy meant nothing to you. You then beat his nutsack into a bloody mush to match his face! When you were sure he wasn’t breathing anymore, only then did you look around to see your sister standing nearby leaning against the car, playing with her clit the whole time you were beating this piece of shit to death. God that was a fucking major turn on! You immediately bent her over and fucked her good and hard on the hood of your car and didn’t stop until you (and her) were fucking spent.\n\nAh good times…\n\nDING DONG!\n\nFUCK! There’s the doorbell AGAIN! You can’t resist this time, you HAVE to answer it and take care of fucking business. You grab an axe and head upstairs. When you answer the door you’re met by 2 young men in white shirts and black ties.\n\nFucking Mormons…", "action_results": [{"action": "Chop them up right now!", "result": "You can’t contain your hatred! You can’t stand Mormons, they come to your fucking door, you kill them, and fucking MORE show up! AARRRGH!\n\nBefore they can even say, “Do you know the teachings of Joseph Smith?” you swing your axe and split the skull of one of them, causing a spray of blood to gush from his head and fall to the ground! As the other turns to run, you push him forward causing him to lose his balance and trip down the stairs, breaking his neck…but not killing him. A gruesome display of bone just barely sticking out of the flesh makes you laugh.\n\n“I can’t feel my legs! I can’t feel my arms!” the Mormon screams.\n“No shit, your neck’s broken, bitch!” you say and carefully carry him in the house and lay him on the sofa. Pity he can’t feel pain anymore below his neck, but you’ve got plans to do experiments. You drag the other one with the axe in his head in the house and close the door.\n“For God’s sake kill me and put me out of my misery!” he screams.\n“I thought you guys were against assisted suicide.” you say.\n“That’s Catholics!”\n“Oh yeah that’s right. I had a couple of those a few days ago. They were begging for death too, after I removed their intestines through their assholes. You know I told them that I would end the agony with a quick death if they renounced God. And guess what? They did. Funny how easy people throw away what they believe in when under terrible pain. Hmmm I wonder if you’d do the same…”\n“You…monster! God will punish you for your inhumanity!”\n“Perhaps…but not today. Now how to get you to feel pain, after you went and broke your neck? Ah! I got it! Now don’t you go anywhere!”", "action_results": [{"action": "Go get some fish hooks from the basement", "result": "You run down to the basement and grab some fish hooks, before you leave, you check on your other patient who is now unconscious. You take time out to admire your previous snip and sew work. When you get back upstairs you find that your sister is home surveying your work.\n\nUh oh, you just realized you didn’t finish your poem to her.", "action_results": [{"action": "Continue your experiment", "result": "Well if you’re in trouble, you’re in trouble, might as well continue what you’re doing.\n\n“Hey baby! How are you?” you say getting ready to put the fish hooks into the man’s eyelids.\n“I’m very tired and I had a hard day.” Sis replies\n“Yeah, I know the feeling, I was working on a poem for you, and THESE fucktards, interrupted me.”\n“Hm, so you didn’t finish it?”\n“No, but I almost did, I’ll give it to you tomorrow…”\n“AAAAAAAAAGH! NO! STOP!” the man screams.\n“Just as well, I’m a little too tired to appreciate it right now anyway, but I want it finished by tomorrow!”\n“Oh you got my word on that baby!” you say and jam the hooks in the lower lids which results in more screaming.\n“Okay well I’m going to bed. Remember to eat something; I know you can get really focused when you do this sort of thing.”\n“Will do sis.” You say as she kisses you on the cheek and goes upstairs.\n\nAs you continue to torture the shit out of your religious patient, you think how lucky you are to have such an understanding woman. You just thought of how to finish up your poem, you’ll comment on her accepting nature.\n\n“AAAGH! NO STOP! PLEASE! THE PAIN IS UNBEARABLE!”\n\nYes, you certainly are a lucky lucky man you think.", "action_results": []}, {"action": "End your experiment", "result": "If sis thinks you’ve been fucking around all day, she gonna be pissed, you quickly go over to the Mormon and finish breaking his neck by twisting it just a little more. Unfortunately she already thinks that.\n\n“So I take it, this is what you’ve been doing all day?” sis asks.\n“I HAD a poem written out for you and then these dicksnots showed up and distracted me!”\n“I don’t want to hear it! Look, I’m tired and had a hard day. The only reason why I’m not fuming right now is because like I said I’m tired, and you didn’t make a big fucking mess for me to clean up. Not that I’d be doing it anyway, in fact I trust that you’ll be cleaning all these corpses up RIGHT?”\n“Of course dear.”\n“Good. Now I’m going to bed and when I wake up, I want that poem finished. AND don’t even think you’re getting anything tonight, you come sniffing around and I can think of interesting things to use those fish hooks you got.” She says and gives your balls a slight squeeze to emphasize her point. After you wince and nod, she then kisses you, biting down on your lip, drawing blood and goes upstairs.\n\nAs you start to drag the two bodies down into the basement, you still feel the ache in your scrotum and your lip is still bleeding and you realize how love can really hurt sometimes.\n\n“But it’s a really good hurt.” You say to yourself, licking the blood from your lips.", "action_results": []}]}, {"action": "Get a lighter from the kitchen", "result": "You grab a lighter from the kitchen and return.\n“Here, have some fire Scarecrow.” You say dryly and apply a flame to his cheek causing a suitable scream and smell of burning flesh.\n\nYou continue to apply flames to his face until it’s a burnt and blackened mess of tissue. He’s still alive, but just barely. You’re a little disappointed he hasn’t renounce his faith yet, but the smell of burnt flesh is making you hungry.", "action_results": [{"action": "Continue to make him beg", "result": "“SAY IT! RENOUNCE GOD YOU PIECE OF FUCK!” you say angrily, but your ranting doesn’t do any good, he just groans pathetically at this point and in your raving you accidently light his hair on fire which then spreads to the couch!\n\n“SHIT!” you say and run into the kitchen and quickly fill a pot with water and throw it on the burning couch and body. Just in time for sis to come in and see.\n\nYou don’t even get to speak.\n\n“You stupid fucker! What the hell are you doing? I come home from a hard day’s work and I find you nearly setting the house on fire? Ugh, it stinks too. Get all this shit outta here NOW! I don’t want any excuses or to hear anything from you! Just do it! I fucking swear you’re a goddamn child! And sex is fucking out of the question so just put that out of your mind right now!” Your sister then storms upstairs.\n\nFucked up big time, your experiment failed and sis got pissed at you. You take the bodies down into the basement, and then drag the couch out to the curb for the garbage collectors to pick up.\n\nYou make a note in your research journal to never use fire as a means of persuasion again.", "action_results": []}, {"action": "Kill him and cook him up proper", "result": "You’re getting bored anyway, you decide to end this experiment and give his neck a twist to finally kill him. You then take him to the kitchen and start preparing him for dinner. Sis just happens to walk in at this point. You take advantage of the situation, since you realize you never finished the poem.\n\n“Oh hi dear! How was your day?”\n“Ugh. I don’t want to talk about it. Is that dinner?”\n“Yeah, I would’ve had it done sooner, but you know how it is. Sorry babe.”\n“Well it smells good.”\n“He’s a Mormon, they generally take care of their bodies, no toxic substances to worry about, might have to add some spices though, they can be a little bland.”\n“Well, I know you know how to cook, just keep it warm for me, I’m very tired and I’m going to sleep.”\n“Will do sis.” You say as she kisses you and heads upstairs.\n\nAs you pull out the entrails and put them in a pot, you suddenly think up something that rhymes with “disembowel” for your poem you were trying to finish earlier.\n\n“Blood soaked towel!” you say. “Man, I’m a doctor, a cook AND a fucking poet.”", "action_results": []}]}]}, {"action": "Bide your time and invite them in", "result": "You toss the axe behind the door, before they realize you even were carrying one.\n\n“Do you know the teachings of Joseph Smith?” one asks\n“Why no. No I don’t, how about you come in and tell me all about it?” you say with a smile.\n\nAs they come inside you guide them over to sit on the couch and insist on getting them something to drink,\n\n“We really don’t require anything.”\n“But I insist!” you say a little intimidatingly.\n“Erm…okay I guess milk or water would be fine.”\n“Great! I’ll be right back!” you say and head to the kitchen.\n\nYou sure wish they drank something a lot darker, because its gonna be a bitch trying to mix pills in the shit without it being noticable. You check the fridge and fortunately sis remembered to get milk, you can work with that somewhat. You take some pills out of your pockets and mix it in the milk good, then you return and urge them to drink.\n\n“Mm, this milk tastes…different.”\n“Yeah, its goat’s milk, so what were you saying about Joseph Smith?”\n\nThe two Mormon don’t get to bore you with the details with their faith for too long before they begin to feel drowsy. You take advantage.\n\n“Ah, so the pills are working, nope nope don’t try to get up, you’ll never make it to the door.”\n“Wha…what have you done?”\n“Isn’t it obvious? I drugged you! Hey where the hell do you think you’re going?! No you don’t!”\n\nYou grab the one staggering to the doorway and trip him up. While he attempts to get off the floor you kick him in the face, and take the axe by the door and chop his fucking feet off! Then you clot the stumps with a hot poker from the fireplace to stop the bleeding. He screams and then passes out from a combination of the drugs and the pain. The other one has also passed out.\n\nNow you decide what to do with them.", "action_results": [{"action": "Take them downstairs as new patients", "result": "You drag them both downstairs and strap them to the remaining tables, and then you check on your other patient who is now unconscious. As you’re admiring your previous snip and cut work. The other patients are waking up.\n\n“Ah, you’re up. Good, now you can find out just in how much shit you’re in. Anyway I have two of you and I only really need one to conduct my research. I’m going to give one of you the chance for release if you do something for me.”\n“What do you want of us?” one asks.\n“Well I’ve always had a particular distain for you religious types. I’m a man of science after all. So I take great pleasure in proving belief is fleeting and under the right circumstances ANY belief can be destroyed, I don’t care how strong. It’s amazing how just a little pain and fear can cause this. I’ve done this with many different faiths. Strangely Catholics seem to flip the easiest, but I’m sure you’d rather not hear about my work so I’ll get to the point. My proposal is the first one to renounce his faith and God; I will release him from the ordeal of excruciating pain which I will inflict on the other.”\n“You are mad if you think we’d do that! We are strong in our faith!”\n“Are you sure? Because when I turn the bonesaw on and start lopping off your fingers one at a time, you’ll probably be changing your tune and it’ll be too late then.”\n“Do your worst! God will protect us!”\n“I’ll do it! I renounce God and my faith in the Mormon church!” the one with no feet shouts.\n“JACOB! You weakling! You have to stay strong in the face of evil!” the other shouts.\nYou smile and load up a hypodermic with some sort of heavy duty tranquilizer.\n“I’m sorry! I can’t do it! He’s already taken my feet off! I’ll do anything to get out of here!”\n“Who said anything about letting you out of here?” you ask rhetorically. “I said I would release you from the pain.”\n“Wha…”\n“I’m gonna keep you doped up silly and alive, while I extract your organs and sell them on the black market! What? You think I do this purely for fun? I gotta make a living you know and next to Buddhists you Mormons keep your bodies pretty pure leaving your organs usually in excellent condition. Besides where the fuck were you gonna run to? I chopped off your fucking feet you dumb bastard! Nighty night!” you then inject him and his face goes from realized terror to asleep within seconds.\n\nYou then hear your sis come in upstairs. Shit you were having so much fun; you didn’t finish your poem!", "action_results": [{"action": "Quickly finish it and run upstairs", "result": "You scramble for the paper you had your poem on and just write some half assed and seems to rhyme well. Then you run upstairs.\n\n“Hi baby, how was your day?”\n“Ugh, I don’t want to talk about it…why is the milk left out?”\n“Uh, well some people came over an they wanted milk and I guess I forgot to put it away, after I drugged them and dragged them into the basement. Sorry.”\n“Y’know I hope you haven’t been fucking around all day, I don’t expect much from you, but it IS our anniversary and…”\n“I didn’t forget! Here, see? I wrote a poem for you!” you say and hand it to her.\n\nYour sister reads it quickly and smiles a bit, but you only JUST got yourself out of doghouse. You can tell she expected more when she gets to the end of your poem. (Which you’d just slapped together)\n\n“Hmm, well I’m going to sleep, I’ve had a hard day and I’m very tired. Don’t expect anything tonight.”\n“Well I have a lot of work to do downstairs anyway, I got some cash cows down there that could bring in a lot of money, and then I can buy that necklace you wanted.”\n\nThis seems to please your sister a bit as it shows you’re making an effort. She kisses you and then goes upstairs where upon you head back downstairs to your patients\n\n“Damn, it appears I won’t get to do that research I wanted, I gotta buy my sister an expensive gift to make up for today and I’ll need to sell both of your organs. Guess you get to live for a little while longer.”\n“You’re a psychopath! And while I’m unconscious I’ll be praying to God in my dreams for punishment to be brutal.”\n“Unconscious? Who said I’m going to render you unconscious? You still never renounced your faith. I’ll be keeping you fully awake while I extract your organs; I think I’ll start with one of your kidneys.”\n\nYou grab a scalpel and carve into the soft flesh, and the screams begin to commence.\n\n“PLEASE GOD MAKE IT STOP!”\n\n“Hmm, he doesn’t seem to be listening, maybe he doesn’t care about you. Guess you should’ve renounced him.” You say calmly and cutting deeper.", "action_results": []}, {"action": "Continue your work", "result": "You’re too focused on making this sorry sack of shit beg for mercy and to renounce his faith. You start by shoving saxophone reeds under his fingernails! When he refuses to give in, you start putting straight pins into his ball sack! Unsurprisingly, all this screaming soon causes your sister to come downstairs.\n\n“Hey! Didn’t you hear me come in?” she asks.\n“Uh yeah, hi honey.”\n“Don’t fucking hi honey me! It’s obvious you’ve been doing nothing, but fucking around all day, but you didn’t even take the time to at least acknowledge me and ask how my day was? You inconsiderate bastard! Y’know I don’t expect much from you, but shit, I at least expect you to put in the fucking effort! Fuck, this is pointless. I’m too tired, and I’m going to bed. And while I know you seem to be REALLY engrossed in your research to even care, don’t expect to be fucking me anytime soon, because you’ve fucking pissed me off severely!”\n\nYour sister storms upstairs and you hear a door slam. You stab your scalpel deep in the thigh of your patient in anger.\n\n“You see what the fuck you did?! You got me in fucking trouble! If you fuckers hadn’t come around, I wouldn’t have gotten distracted! She’s fucking pissed at me and probably won’t speak to me in weeks! Do you know how much it hurts being separated from someone or something you love? I’m gonna make sure you feel the same fucking pain I feel right now. What I’ve done so far is nothing compared to what I’m gonna do!”\n\nYou begin to do a series of tortures that would be too long to list here, but needless to say, he feels more pain than you do and definitely more than he could’ve ever imagined.", "action_results": []}]}, {"action": "Do something else", "result": "You have a cunning plan! You quickly tie the two Mormons up in some dinning room chairs and then head downstairs to get your other patient, who is now unconscious. You untie her and carry her upstairs and tie her to yet another chair beside the Mormons. Finally you go upstairs to the attic where you’ve got another patient tied up. A young runaway you picked up hitchhiking along side the road. She’s wide awake though.\n\n“Come on girlie, I got plans for you.” You say and drag her downstairs and put her in the last chair. Due to all the movement and some slaps to the face, now ALL your patients are awake and rightfully afraid. You like that fear.\n\n“Wha…? What are you going to do?” one of the Mormons asks.\n“Silence!” you say and punch him in the face with some spiked knuckles, breaking some teeth and putting some gashes in his face. “Now then, it is my sister and my anniversary today, and I want to do something special. So what I’ve planned is for all of you, is to sing happy anniversary when she gets home. Okay, now let’s try it, uh…I don’t know your names…okay you’re Girlie, you’re Gashface, you’re Stumpy and you’re Voiceless. Damn, I forgot you won’t be able to sing seeing as I cut your vocal cords…alright fuck it, just mouth the words. Okay go!”\n\nAll your patients are too frightened to do anything, they don’t comply, well at least not until you slice off a nipple from Girlie!\n\n“NOW FUCKING SING GODDAMMIT! Don’t make me command you again! And Voiceless I wanna see you mouthing the words, causing if you ain’t puttin’ in the same effort as them, I’m gonna make you sightless as well!” you shout.\n\nAs they all begin caterwauling “Happy Anniversary” you work on you poem.\n\n“And I would burn a baby in its crib and eat the crispy brat, just for a hint of your love…goddamn I’m a fucking genius!” you say finishing up the last line. You look outside and see your sister drive up. You quickly get prepared.\n\n“Alright shut the fuck up! Here she comes! Do exactly what I said and your death will be a lot quicker. Piss me off and you’ll be learning a whole new meaning of agony.”\n\nAs soon as sis steps in the door, your choir of the tortured begins to sing (Well three of them anyway) and you read your poem to her as they sing. Your sister is VERY touched by this grand display of love.\n\n“Oh baby! You’re so thoughtful!” she exclaims and hugs and kisses you, while you squeeze her supple ass.\n“Oh shit, I wanna fuck you you so bad right now, my dick is about to detach itself from my body and just live in your fucking pussy for about a week!” you say.\n“Ohhh, you’re so specific. Well I’m ready if you are, but I think you need to take care of them first, you know I’m shy and I don’t like crowds.”", "action_results": [{"action": "Kill 'em quick and get to fucking!", "result": "You take your scalpel out and approach your patients.\n\n“Well you’re in luck! You all did well and get a quick death! You can be first Nipple Girl!” you then slash her throat open causing an arterial spray of blood to drench you. You then do the same for Gashface, Stumpy and Voiceless. By the time you’re done, you’re covered in blood, but your sister rather likes that. You then proceed to fuck your sister on the blood covered floor, (Which only makes the licking portion of the sex even hotter for you two) until some other bodily fluids are released.\n\nAfterwards, your sister goes to wash up and go to bed, while you realize you have to get another patient seeing as you killed all your current ones.\n\nBut it was worth it, anything for love.", "action_results": []}, {"action": "Say you want you and her to kill them together", "result": "Your sister has no words. She’s beyond touched. Never have you ever asked her to share in a kill. She always assumed it was something you liked doing by yourself, that’s why she always would leave you to it. This truly is a momentous occasion! You give her a scalpel and motion her over to Nipple Girl while you go over to Gashface.\n\n“Now baby, you just put the blade across her neck like so and…” you then quickly run your own blade across Gashface’s neck and the blood comes flowing from it like a gushing river. “See! It’s very easy! Now you try it!”\n\nSis does so, and she doesn’t quite kill her subject instantly on the first try, but that hardly matters, in fact you like it even more when sis slashes her throat again this time killing her.\n“Yay! I did it! Whoo, this is fun!” she says as blood sprays on her.\n\nYou smile at this remark and you and sis take care of Stumpy and Voiceless in the same manner. Never before have you felt such a close bond with her, the way she uses the scalpel it’s almost like an extension of her hand. You don’t know why you never thought of this before. You look at each other and your hearts beat as one, while your patients’ beat no more. You then make mad passionate love on the blood soaked floor, amidst the death and gore.\n\nWhen you two are finally finished, you sleep and lie in the blood holding each other, like you’ve both just been born from your mother’s polluted womb. It’s so serene, so peaceful, even the voices in your head have silenced for a moment.\n\nThis is truly paradise.", "action_results": []}]}]}]}]}