{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=61749", "context": "", "first_story_block": "I went to the graveyard. What did I bring?", "action_results": [{"action": "A knife", "result": "The air was warm and damp. The world was decaying from the thick pressure against it. Trees that framed the headstones were being devoured by moss and fungus. The parasites were languid and indulgent. Their fleshy skin only growing as the bark below decayed. It made me want to be sick. \n\n\nEven now with the moon in the sky, in the time when the sun had disappeared to let the world recover, it was as if you could see the water steaming off the backs of the marble slabs and angels. \n\n\nBut the darkness was still dissipated by her calm light. The flickering of candles dimly glowing beside some headstones cast a gentle softness, like fireflies dancing. It was thrilling. Romantic.\n\n\nI thought of the message that I'd seen that morning and a slight smile touched my lips. \n\n\nMeet me in the graveyard. I'll make it worth your while;)\n\n\nEver since we first met, this graveyard had been our special secret. The first time here with him... it had been sparks. It had been infinity. Just thinking about it made my skin grow hotter, even in the boiling air around me.\n\n\nI couldn't imagine life without him. And now- \n\n\nWait. I saw a figure walking. Did I hide?", "action_results": [{"action": "Yes, I hid", "result": "I ducked behind a headstone and hoped the motion didn't catch the person's eye. People, it turned out. I heard two voices bounce across the stones. They were walking closer as a woman's voice assaulted my ears.\n\n\n\"Oh my god. Seriously. This is fucking terrifying. Why did you want to meet here?\" The words were softened with a girlish panic and a small nervous squeaking laugh at the end.\n\n\nVapid bitch. \n\n\nOf course she wouldn't understand. \n\n\n\"Trust me. It's worth it. Look, there's no one around. Just you, me, a bit of moonlight.\" He stopped moving, they sounded close. Maybe only two rows away. Our place.\n\n\n\"Hold on,\" he said.\n\n\n\"What is it?\" the girl said in a terrified whisper.\n\n\n\"Nothing... I just caught a glance of you in the moonlight. God, Tili, you're stunning.\"\n\n\nI could practically hear her twirling her hair around her finger and batting those dumb, glued on eyelashes as she said, \"You really think so?\"  \n\n\n\"You don't believe me?\" There was a pause, then he spoke so softly I almost didn't hear, \"Then let me prove it to you.\"\n\n\nThen they were kissing. Loudly. Smacking lips. She moaned loudly. Whore.\n\n\nI was patient. If I was going to catch him 'in the act' then I would wait until he was good and active. Not that I had to be very patient. There were clothes were off faster than you could say \"cheating bastard.\" Yeah, sure, they could talk about romance and moonlight but seriously? In our place? Hell, he was rutting away in her on the grave I'd fucking picked out. When I glanced around \"Tili\" was gripping the rose colored marble scrollwork that had caught my eye back when it had just been Luke and me. He was panting and thrusting away while she made enough noise I was surprised the dead were still sleeping.\n\n\nThis isn't a porno, you little cunt. I hefted the knife. More like a snuff film.\n\n\nI stood up and walked towards them. They didn't even notice even though she should have seen me clearly. I guess her eyes were too far back in her head. When I raised the knife above his head- that she noticed. The blood that came bursting from his neck all over her bare chest might have caught her attention too. She was screaming, but, well, she'd already established people wouldn't hear that. She tried to scramble back, but his body was heavy on top of her.\n\n\nI got close to his face, he was weakly trying to hold the blood inside him. \n\n\n\"Uh-uh,\" I said. \"That's not going to work. You're going to die with your little bitch. Don't worry I'll make sure you're buried together.\"\n\n\nThe light was already leaving his eyes. Tili, underneath him was trying to push away, scramble back, anything. She was pleading and crying and screaming. I drove the knife into her gaping mouth just to shut her up. She clamped her teeth down on it, as if that would defend her, and tried scratching at my face with the hand that wasn't pinned beneath his body. I moved aside and grabbed a small angel statue placed beside the grave nearby, bashing her in the skull until her grip on the knife slackened. I delivered a final stab to the ribs to ensure I was rid of her. \n\n\nThe night was quiet again. Their blood, all mingled, was splashed against the headstone. I could practically see the steam rising off of it.\n\n\nThat's right. I went to the graveyard with a knife and I killed those two cheating fucks.", "action_results": [{"action": "Do you have another story?", "result": "I went to the graveyard. What did I bring?", "action_results": [null, {"action": "A casket", "result": "Yes. I felt the casket jostle around me. For a moment I didn't understand that's what it was. My body didn't tell me how the silk around me felt. My eyes were closed, and even if they hadn't been this space had no room for light. Nevertheless, in an instant I knew it was a casket in the same way I knew I had a body even if I couldn't feel it. \n\n\nI laid still as a stone. I had to after all. Even if I could move there was nowhere for my limbs to go, no way to stretch out of the silk-lined interior that kept my hands folded as if in gentle repose.\n\n\nI wasn't supposed to be awake. That's not how this was supposed to play out. I could feel a scream building up inside me, but it didn't feel like it usually did. There was no flutter of it against my throat, there was no clenching of it within my stomach. It was only the emotion of a scream. Without feeling it like this, I never would have known a scream is more feeling of the spirit than it is of the body.\n\n\nI had held my lover's hand what had only seemed a few moments earlier. Hers were warm, mine cold. The world had glimmered though I knew it was, in actuality, dim and fading. It was extinguishing before me and I thought it would have been the silent smothering of a flame, but instead it was paper curling brightly, consuming itself in its thirst to blaze. \n\n\nHere was different. It was not bright. There was no color. I had never been more alone. The feeling of her skin to mine was a dull memory, one I couldn't even trick my flesh into replicating.  \n\n\nAnother jostle. I recognized it now as the thud of something falling on the lid above. Dirt. I was being buried.\n\n\nPerhaps I fell into a dull haze at the horrifying realization, perhaps I fell unconscious. Either way the world blurred like fever and when I came back to myself the march of soil reclaiming its place had long since been dismissed into the snuffling, shifting, soundless sounds of earth making itself comfortable.\n\n\nI quickly realized what had stirred me from the haze. A voice trembled over me. Loud enough to hear over six feet of packed dirt. It was a mournful cry. It meant something. It stirred my interest.\n\n\nI knew what I had to do... It was... \n\n\nIt was...\n\n\nWhat was it?\n\n\nWhat did I do?", "action_results": [{"action": "I waited", "result": "As I listened to the voice above me, I started to regain some of the feelings around me. My chest started to pound heavily as my heart responded to the close darkness. With an effort of will, I made myself breathe slowly. I wasn't sure if my arms and legs would respond to my command, but I would not test it. Feeling my surroundings would only make them more stifling. \n\n\nThe muffled voice above grew somewhat clearer and I realized that if I listened very clearly I could hear the soil above being shifted. \n\n\nI saw things in the darkness as I waited: hands that reached towards my face only to vanish before they could touch it, spiralling worms tumbling on top of me and eating at my clothes and hair, the ghosts of the graves beside me laying on their sides and observing me. \n\n\nI wanted to sing back to the voice above. Inside the casket had already started to feel warm and thin, however. Whenever I thought about how much air remained before I would start to sputter and twitch, I had to restrain my lungs from taking in great unrestrained gulps and try to smooth the red-hot heat that rose up over my face and throat.  \n\n\nOnce or twice I thought about who stood outside the grave, pushing the earth aside. An image of someone swinging the casket open then promptly burying a shovel's head into my skull to ensure I was dead played on loop for a short while. That can't be, I told myself. How would they know the song. But the voice was muffled beyond recognition and I knew there were ways to gain secret knowledge. \n\n\nInches from my face, there was a loud scrape as metal dragged across the wooden lid. \n\n\nMy body jumped involuntarily. At least I know my muscles still work. \n\n\nThe voice continued softly singing and with each note I grew less certain. That note wasn't quite right. Was that as deep as his voice had been? He would never sing it that way. Surely it wasn't simply the casket's distortion. They were ensuring I was trusting and subdued before they got rid of me for good. My head was dizzy from the strained oxygen and I felt weak. I didn't have a way to defend myself. I didn't have anyhing. \n\n\nMaybe they were just trying to play some sick joke. Maybe they knew I couldn't fight and wanted me to spend my last moments in helpless terror.\n\n\nMaybe bystanders were snickering as they drew close. \"They're gonna kill her. They're gonna kill her and she thinks she's gotten free. This'll teach everyone not to mess with the Argonovs.\"\n\n\nThe digging above stopped. The singing stopped. There was a scrabbling against the side of the casket as whoever it was tried to pry it open. Probaby with the shovel. \n\n\nIf I was quick. If I was ready... Maybe I could grab the shovel and yank it away. I had never been one to go down without a fight. If they thought they had gotten for good this time, I would put their man in the very grave they'd laid out for me and walk away unscathed. \n\n\nI allowed myself a few deeper breaths as the scrabbling continued, though by now taking in more still felt nearly empty. \n\n\nThere was a louder scrape and a crack appeared to my right. Whatever light poured through was nearly blinding after the dark though I could tell it wasn't as bright as day. I took a stunned second as the fresh oxygen hit my lungs then scrambled after the blurry outline of the shovel's head. I managed to clench the metal edge in my bare fingers. It was unexpectedly sharp as it was quickly withdrawn with a startled gasp. My fingers stung, and the casket lid slammed down on top of them. I pushed against the heavy wood, howling.\n\n\nI was gonna get this fucker. \n\n\nI couldn't get the casket open, I was still angled oddly and couldn't lift my head enough to get it out of the formed head rest which confined it. \n\n\nA set of hands curled around the edge and started to pull the lid open.\n\n\n\"Hey, hey, hey.\" A calming voice sounded, almost drowned out beneath my combative snarls. As the lid swung open, his face came into view. Ivan. \n\n\nAll the strength seemed to flood out of me. Off course it was him. I fell into his arms and leaned in hard as all the tension was replaced with relief. Tears filled my eyes.\n\n\n\"Hey... Hey... I'm here.\" He stroked my hair for a few gentle moments.\n\n\n\"Do you think you can move?\" he said eventually. \"I'm sorry, my love, but we need to get you somewhere safe and make this all look normal by morning.\"\n\n\n\"Yeah,\" I said. When I tried to stand my legs buckled beneath me. The drugs apparently hadn't left my system. He ended up having to fill in the grave by himself then lead me, waveringly, to the car in the early hours of the morning. \n\n\nI apologized for thinking he was someone else, but he wouldn't hear of it.\n\n\nI was half asleep at his shoulder as we trudged out of the graveyard. He was gently humming our song.\n\n\nI went to the graveyard with only my casket. I left in the arms of the man I love.", "action_results": [null]}, {"action": "I tried to reach it", "result": "I listened to the singing for a few moments. Something sad and vaguely familiar. Oddly enough I tried to remember who it was singing but no one came to mind. \n\n\nI strained to listen closer: something so haunting and close bit at the edges of the sound. I tried to push my cheek against the wood to hear better, forgetting my body would not move. It just laid there, stiff and unwieldy.\n\n\nI, however moved a few inches away.\n\n\nI froze for a moment. Then tried to move my hand against the wood. I didn't see my fingers in front of me, I didn't feel wood. Even so, I was certain I had moved. I pushed harder against the coffin and felt myself move upright into the cold dirt beyond it.\n\n\nEasy as breathing had been before all this, I pushed myself upright and burst into a world above.The motion carried me forward and when I stopped to get my bearings, I was startled to find myself a few inches above the fresh-turned dirt beneath me. I was dressed in a familiar way, though I didn't remember dressing. When I looked out sideways, my hair was streaming in a wind I couldn't feel. Beneath me was a grave. My grave. Sunk beside the dirt was a woman all dressed in black. She sat weeping beside, singing a tremulous, mournful song.\n\n\nI stood above watching her. This strange state of being-- without body, without complete control-- seemed to have left me bewildered as well. I knew I loved her. I knew she was important to me. I could not discern why.\n\n\n\"It's strange, isn't it?\"\n\n\nI turned to see a woman sitting cross-legged on a grave a stone's throw away. I knew her immediately. \n\n\n\"Addie!\" I cried. I tried rushing to her side, but my faculty of movement was not entirely in my control yet so I remained hovering in place. \"Addie, it's so good to see you again. I missed you so much. Please come to me.\" \n\n\nShe smiled as she rose to her feet. The grave beneath her was still newly turned as well. She strode until she was just beneath me than took my hands in her own, looking up at me lovingly. I felt the touch of her though I knew I had no body. I suppose she had no body either. Gently she tugged me down until my feet were closer to the ground.   \n\n\n\"I missed you too, my love,\" she said from behind the sad smile she wore. \"But tell me what it is you did to join me so soon. Tell me it is not as gruesome as it looks.\" \n\n\n\"What do you mean?\"\n\n\nShe didn't say anything, simply reached out and rubbed the material of my sleeve between her fingers. It was then I noticed the dark stain that ran across me. Both sleeves clung close to the image of my arm. I hadn't felt it before, but as I grew more attuned to my not-body I became aware of the sensation of cold and wet at my wrists, across my chest, running down my skin and in rivulets down my legs.\n\n\nAddie's hand fluttered up against my neck and came away black. Her eyes were full of grief. \"Did my death do this to you?\"\n\n\nMemories started to return in hazy waves. Addie had lain in her deathbed, hand burning in mine. She was bursting with fever, it burning her skin, lighting her eyes. When her life had faded so had my own. She was cold in her grave, I was unmoving in my home. I could not rise, I could not eat, I could not live. So I stopped living. \n\n\n\"I.. I did this to me. The wrists weren't bleeding enough so I took a letter opener and...\" It had entered my neck with a swollen, ripping kind of pain that makes you think you can't feel anything else. But I did feel it when I yanked it away. I had felt the blood spitting outward, the world growing thin and bright: paper consuming itself in the ecstasy of the blaze... \"I wanted to be with you.\"\n\n\nThe smile at her lips remained sad. She leaned in close and I felt her lips press against mine, gentle and insistent all at once. \"However it came to be, we are together again. I will show you the place beyond.\"\n\n\n\"Wait. Who is she?\" I looked across to the woman weeping.\n\n\nAddie looked down. \"That is you're mother. You're death must have been a great shock to her.\"\n\n\nThe music was still winding out between convulsive sobs as my mother knelt at my grave. I went to her. Yes. How could I forget her. She had loved me deeply. I felt the slightest uncertainty about my death. I stopped beside her and kissed the top of her head, even if it was like kissing a breeze.\n\n\nHer sobs seemed to slow and the song dissipated. She looked up and around with her tear-stained eyes. She never quite found me. I heard her say quietly \"If... if you can hear me. I love you. I'm sorry I couldn't save you. I will always love you, my sweet child.\" She sat there a short while and I sat beside her, aching and taking comfort from her presence all at once.\n\n\n\"I'll come back to visit,\" I said. I didn't know if I could, but I knew I would find a way.  \n\n\nEventually she got up, straightened herself into the practical woman she most often showed to the world, and strode down the path. As she disappeared into the distance, I turned back to Addie, our reunion slightly more solemn than when I had first caught sight of her a short while ago. \n\n\n\"Let's go,\" she said, and took my arm. \n\n\nI can't tell you where we went. It isn't your time for that. \n\n\nBut I do know that I went into the graveyard bringing only my casket and left my mortal bonds with the one I love.\n\n\n ", "action_results": [null]}]}, {"action": "Flowers", "result": "The daisies hung downward in my hand, their small heads bobbing. I had heard somewhere that holding flowers upside down made them last longer. I didn't know if it was true, but they were going to die anyway, might as well try to preserve them. \n\n\nDaisies were her favorite. I walked past the mausoleum, it's bronze doors dulled with age. The first time I had visited this graveyard at eight years old I had stared at those doors for the longest time. They hadn't been kept up with, however, and the scenes that once shown were now hidden in a smudgy, monotone brown.\n\n\nThe little path led slightly downhill. All the small candles around were unlit. The Spring sun was bright enough to make up for it, however. No candle could give more homage to the dead.\n\n\nNear the bottom of the hill was a fresh-turned grave. That's where she was. Right where I expected to find her.", "action_results": [{"action": "She was standing", "result": "Yes, she was standing. Standing at the foot of the grave, tears in her eyes. Her shirt was the traditional black, but she was wearing a pair of blue jeans underneath that. Perhaps she didn't love him all that much? Of course she didn't. Therir love hadn't been real.\n\n\nI fixed a sympathetic smile on my face as I called her name. \"Julia?\"\n\n\nShe turned to face me. Her eyes were that heart-broken red and she was shaking, even in the warm Spring air. So lovely. So vulnerable. Just waiting for someone to comfort her. I folded her into a hug. \"Oh Julia, I'm so sorry.\" \n\n\nShe sobbed into my shoulder. Just as I imagined she would. Those delicate shoulders of hers shaking, that blonde hair, warm from the sun, tucked softly against my cheek, while my hand smoothly glided against her back. \"I'm sorry, Daryl,\" she snuffled. \"This is-\" she choked on a sob. They kept finding their way from her chest, interrupting each word she tried to say. \"I'm. Being. Stupid.\"  \n\n\n\"Hey. Hey.\" I spoke softly, running my fingers through her hair. \"None of that. You didn't deserve this. Oh, Julia. If there was anyone who should never have to go through something like this, it's you. All you've ever done is care for the world. And this certainly isn't what Arthur deserved either.\" He deserved much, much worse.\n\n\nHer sobs subsided to sniffles. \"Thank you, Daryl. You've been so kind with all this. You're honestly the first person that's been there for me since Arthur died. Everyone else doesn't know what to do. People are nice. they bring me casseroles and stuff. You're the only person who will really talk to me though.\"\n\n\n\"Of course. If you need anything, I'll always be here for you. Always.\"\n\n\nShe pulled away to look into my eyes and I felt my whole world glow. The admiration in her expression was everything I had wanted it to be. \"That means a lot, Daryl.\" She squeezed my hand.\n\n\nI could feel a grin wanting to spread across my face, but I kept my expression somber and supportive. She hadn't said it outright, but the words were pressed into everything she did. How she leaned forward, how her lips were slightly parted, the way her hips moved as she turned to pick up her purse from the bench from beside her. I Love You. she said. I love you, I love you, I love you. \n\n\n\"I brought these for you,\" I said, extending the flowers. \"They just looked so happy, and I figured you could use something bright in your life.\"\n\n\nShe smiled as she took them. \"Daisies. These are actually my favorite,\" she said. \n\n\nI know. You posted about it last June.\n\n\n\"Really? Mine too. They just make the world seem better.\"\n\n\nShe nods. \"I should get these in some water... I wouldn't mind some company though. The house just seems so empty these days... You don't have to. I get it, it's weird to go to the house of the dead guy. But if you're free, I can put on some tea.\"\n\n\n\"Hey. Don't worry about it. You know... Um...\" I was careful to cast my eyes down. \"My brother was murdered. The guy was never caught. I, um. I get what you're going through.\" I stepped slightly closer and squeezed her hand. \n\n\nHer eyebrows drew together in concern. \"I'm. I'm so sorry. I had no idea, Daryl-\"\n\n\n\"-It's alright. It was years ago. I've had time to heal. I just want to be there for you, because, well. I remember what it was like. How about we talk about it over some tea though. We can meet at your place then? My car's just up the hill.\"\n\n\n\"Sure.\" She looked relieved, more at peace. Of course her heart was still aching, but now I was here. Now she would know what love actually looked like.\n\n\n\"I'll see you in a few then.\" I gave a small wave as I turned to leave.\n\n\n\"Wait, don't you need my address?\" When I turned back, she had a playful smile.\n\n\nI tapped my head \"Oh yeah! Stupid me. I would've walked up this hill just to get lost.\" \n\n\n\"I would've caught up, I'm parked up that way anyway.\"\n\n\n\"Well then let's head out together.\"\n\n\n\"Um. Yeah. Do you mind if I... If I just take a moment by myself. You know. With Arthur.\"\n\n\nMy smile felt a little stiff. It's not her fault, I had to remind myself. She just doesn't know what's good for her. \n\n\n\"Of course,\" I said. I patted her gently on the shoulder, caringly, \"I understand. I'll see you soon. Bye, Julia.\"\n\n\nI spared the grave a glance. As I turned away I let a satisfied smile find its place. And goodbye, Arthur. You and Julia are finally both where you belong. You in the grave and her in my arms.\n\n\nAs I pass the mausoleum, I send a silent prayer to my patron. The one who guided me here and ensured I could guide Julia to true love.\n\n\n\n\nThat's right. I went to the graveyard with flowers and won over the girl I love.", "action_results": [null]}, {"action": "She was lying", "result": "I maneuvered my way between the weeping willows slender arms, and there I found her. My child, lying in her grave. She couldn't be dead. She was dead. There was no avoiding or scraping or pleading. The dirt could be moved, the coffin upended, but the cold corpse wouldn't jolt to life until Judgment Day. Other flowers were already heaped along her headstone. A small daguerrotype of her face had been been encased in glass then pressed into the headstone. In it, her eyes were closed peacefully, her lips upturned. I wonder if they had sewn her lips to stay in such a shape. \n\n\nMy beautiful daughter, forever enshrined here. And I hadn't even been present to mark those sacred, final moments. \n\n\nThere was a rustling behind me. I turned to see a woman there, dressed all in the mourning weeds of a mother whose child is buried. My wife, her face still recognizable beneath her mourning veil. \n\n\n\"Helen, my love. I stopped here before I returned home. The carriage is waiting. I had hoped to see you soon, and here the Lord has brought you to my arms in a time when I am deeply in need of comfort.\"\n\n\n\"Edward.\" She stepped forward between the branches of the willow that leaned over our little girl's resting place. Her serving girl lingered behind, giving us a moment of peace together.\n\n\nHelen hooked her arm through mine then lifted her veil up to give me a kiss. It was gentle and quiet. A broken kiss like the broken heart we shared. She leaned her face against my shoulder. \"Oh Edward, our sweet child is in Heaven now. How am I to go on living here when so great a piece of me is absent.\"\n\n\nI squeezed her hand, \"We will manage together, my dear.\" We both turned our attention back to the grave in front of us \"After all, we must.\"\n\n\nI felt her presence beside me. The world was broken. We were forced to live through it. But with one another, we could survive. The solemn acceptance and gentle assurance of Helen's pressure was more romantic to me than any past candlelit dinners or late night advances. She was my life, and with her by my side, death could not stop me.\n\n\n\"You know, my dear, there is a group I have heard of. Spiritualists they call themselves...\" I hesitated. It had been on my mind since the moment I had heard of dear Cynthia's death. I did not know how my wife would respond to it. \"They say... they say there is a way to part the veil between life and death. To speak with the departed.\" \n\n\nI felt her stiffen in my arm. She leaned slowly away and gave me an unreadable look. \"Truly?\"\n\n\n\"Gregory Hammond spoke to me of it when I heard of Cynthia's passing. He said he has since spoken to his own departed Elaine.\" I took her hand in my own \"I would not say something of this nature if I did not hold some small degree of faith in Gregory's testimony.\"\n\n\nHer expression did not change. She pulled her hands away and turned to look once more at our duaghter's grave. \"Then I suppose we must at the very least try.\"\n\n\nI felt a small degree of relief fill me. I at least did not wirry that my love for my duaghter would drive away my wife. \n\n\n\"Well then,\" she said. \"What must we do?\"\n\n\nI went to the graveyard with flowers and convinced my wife we would rejoin our little girl.\n\n\n ", "action_results": [null]}]}, {"action": "A Bell", "result": "That's right. The light came filtering through the branches of the old willow tree as I walked past it. It painted the leaves. I remember... What color was it?\n\n\n \n\n ", "action_results": [{"action": "Silver", "result": "Silver on black. The leaves picked up the moonlight and held it against the dark sky behind. I steadied myself beneath the stretching, sweeping branches as if the silver light could protect me just as well as the cross in my pocket. In an hour it would be midnight. I already had the circle drawn, the compass points staked. I needed everything else prepared by the darkest hour.\n\n\nI set to work putting up the small altar beneath the branches of the willow, behind their living curtain. Only one small grave sat at the base of the tree, some unknown child's resting place from ages past. When I stepped back onto the path outside, my construction was hidden- there was nothing to be seen of the white linen cloth all spread out with spellbook, censor, bell, and holy water. From the grave of Amelia Albright, the altar was only a few steps away. \n\n\nNow it was only a matter of waiting. I sat cross-legged at the base of the grave, my heavy bag beside me. \n\n\nThe church bells did not ring at midnight. The pastor lived in the cottage nearby, but did not stir to ring the bell throughout the time when reasonable souls were sleeping. Perhaps that's why Amelia and others of her kind felt so comfortable stirring in those hidden hours between light's death and resurrection. \n\n\nNo man-made sound marked the passage of man-made time. Even so, a loud stirring of sudden wind pushed it's way between the graves.  It tossed aside the willow branches and for the briefest moment I thought I saw a figure between the parted branches. My head turned that direction but there was nothing there. \n\n\n\"Well you don't leave a lady waiting or wanting. Mmmm. I can smell the wormwood from here.\" The voice came from deep within a throat and instantly set my spine to tingling.\n\n\nI turned back to the grave and met the sight of Amelia Albright in her newest body lounging against her own headstone. Though the moon was blocked by a sudden spat of clouds, Amelia shone with some internal light that left no corners or planes of her scantly clothed flesh to linger too deeply in the imagination. She was a beautiful a woman. The image of her was like a steady pressure against all my senses. Whatever the poor bitch she rode had looked like before, all the pleasantness of her features had been magnified.\n\n\nSome part of me wanted to let my eyes endlessly trail those long strands of hair from crown, past full, smiling lips, down past the neck where her shirt parted... But she wasn't really here. This was only a disattached mind rattling a shell. The woman I had fallen for was a construct.\n\n\nEven worse. She was some dull remnant that would happily kill others. Who had deceived me so I could make her stronger. What stood before me was a tragic, bloodthirsty shard.\n\n\nHer grin grew as if around the thought of a laugh and I saw a tinge of curiosity and hurt touch her eyes. I realized I hadn't responded to what she had said.\n\n\n\"Ye- yes. I brought wormwood, myrhh, and a bundle of chervil. Just as you asked.\"\n\n\n\"Lovely. Of course that only does me good if I can bind to the body.\"\n\n\n\"Of course.\"\n\n\nShe leaned forward in a hungry sinuous way, her grin growing further than it should have been able to. \"You've found a spell then? One that will let me stay in this body?\"\n\n\nI had to gamble here. Some spirits could sense lies. \"I- I have.\"\n\n\nShe inhaled and I could see her body relax as if she had just taken a nosefull of a pleasant bouquet. \" She leaned forward and dragged a hand across my face in a way that forced my eyes to meet hers. They were endless and glimmering in the dark. They each had two pupils. \"I knew I could rely on you, my little spellworker.\"\n\n\nShe was only an arm's length away. I felt my pulse quicken for several reasons.\n\n\nHer smile faltered. \"Do I smell silver on you, my dear?\"\n\n\nMy stomach fluttered. \"Yes, I'm sorry. My ring. I didn't even think about it.\"\n\n\nShe shuddered. \"Ugh. Take it off.\" \n\n\nI slid my ring off and set it on a tombstone behind me. This wasn't ideal, but I had other ways to defend myself should it come to that.  \n\n\n\"I will be glad mean things such as that no longer affect me. Now then,\" she continued, \"let us begin. When this done I will thank you in the most wonderful way.\"\n\n\n\"Alright. I- I set up over there though. I was worried someone would see us from the road. It isn't too far or anything I just wanted to be out of the way-\"\n\n\n\"-that will do. Show me.\"\n\n\nShe stood and her hair fluttered pleasantly against her hips she walked next to me. I led her around the skirt of the willow branches so we would not stumble directly into my makeshift altar. I parted the branches, allowing her to walk ahead of me. She knew she was beautiful and attempted to flaunt the smooth curves od her waist, the lines of her back, the roundness of her ass as she walked forward. Walked ahead of me. Walked into the circle I had carved. \n\n\nPride comes before the fall and all that shit.\n\n\nWhen she was ahead of me I grimly nudged aside the leaves I had used to break the edge of the circle. \n\n\n\"Spirit of adversity, I bind you.\" I started. \n\n\nImmediately she turned to me with a shriek and threw herself against the edge of the circle. I braced myself, but she couldn't reach out.\n\n\nI circle held.\n\n\n\"From the North, I call upon thee. Bind this spirit-\" all sound was drowned out in her shrieks of anger. She threw herself again and again. \n\n\nI did not flinch. I could not leave the spirit to ride this poor woman's body any longer. \n\n\nI went to the altar where I picked up the censor and shook the censor gently causing ripples of the scented air to billow out. Sage was in it rather than promised Wormwood, though I had put a sprig within my coat. As the smoke rippled across the boundary, her screeches diminished into hisses. The area flooded almost unnaturally making her outline blurry\n\n\n\"From the South I call upon thee. Witness and serve...\"\n\n\nI reached down to where the holy water was and when I turned back she was gone. \n\n\nI continued the incantation. She could be hidden in the smoke.\n\n\n\"-that which is darkness and of darkness bred-\"\n\n\nWhere was she? I flicked the holy water into the circle. No hisses returned. No sound at all actually...\n\n\nIf she was playing games it wouldn't matter. There was only one verse left in the incantation.\n\n\n\"Spirits all, in faith I worship. Come to me and restore balance. Bind-\"\n\n\nWith a howl she rushed through the circle straight at me, and this time she was not caught. I was thrown to the ground and she landed heavily on top, her forearm pressed to my throat. I holy water fell uselessly from my hand spilling into the eager dirt below. I tried reaching into my pocket but her free hand found mine. \n\n\nThe world was growing black.\n\n\n\"Die. You LIttle. Bitch,\" I heard her say as the thumping in my ears seemed to slow. The heat of the violent blood in my neck seemed to prickle into absence. The jerking of my body, stilled....\n\n\nA soft chiming sound came from nearby and I sucked in air as she pushed back. My vision was still dark.\n\n\nA gruff voice said, \"Finish your blasted spell.\" \n\n\nI gasped and tried twice to make my voice work. As my vision flooded back I saw her slinking back. The old pastor was holding the bell from my altar. \n\n\n\"B-bind this spirit's evil and let mortal soul depart in peace. Return to what is right. So mote it be.\"\n\n\nThere were no fireworks or scampering dark clouds like there were in movies. Her body just dropped. \n\n\nI wheezed. Air was still not coming easy and my voice had come out weak. \n\n\n\"Is she... alright?\" I managed. \n\n\nThe pastor threw the bell aside with a look of disgust. \"Had enough of fucking bells around here.\"\n\n\nHe walked to the girl and felt for a pulse. \"Dead,\" he said matter of factly. \"But you aren't. Let's get you to the hospital.\"\n\n\n\"How.. do we explain...?\"\n\n\nThe pastor shrugged. \"Strange things happen here. She doesn't have any since of a struggle or nothing. Police know well enough not to question dead in a graveyard.\"\n\n\n \n\nThat's right. I went to the graveyard with a bell and I left having removed an evil spirit.\n\n\n ", "action_results": [null]}, {"action": "Gold", "result": "The golden light fell through the silken curtain of willow leaves to dapple the path beneath my feet. The day of the wedding could not have been more perfectly illustrated if I had set each detail myself. Only two rows or so separated the tree from the small iron fence that separated the graveyard from the church beyond. The flowers planted along the border were in full bloom, the church itself surrounded by a flurry of petals from the lilac bushes beside. I hummed to myself as I shifted the package in my arms and envisioned the beautiful woman who would walk down the path all wreathed in white in just a few hours.\n\n\nAmy. My fiance and, soon, my wife.\n\n\nIt was bad luck to see a bride before the wedding, but we had decided to take the chance anyway. She needed to see her wedding gift before the ceremony or it was pointless. There was a bench in between a few graves on my right so I sat there. It was sheltered under a bower of wisteria which was considering blooming. The smell of the lilacs swept over the place.\n\n\nIt was calm, quiet, and private. The perfect place for two lovers to meet.\n\n\nI caught sight of Amy a few moments later, darting from the church and casting her eyes about like a convict on the run. Her hair seemed to be in a pile of curlers and she was in some sort of slip. She bounded nimbly and reached the gate in a few moments. She opened and shut it behind her as noiselessly as she could. \n\n\n\"Amy! Over here!\" I stage whispered. She ran over to me with a smirk on her face. Her face was flushed from the short sprint and a giggle escaped her. Delight showed in her eyes.\n\n\n\"Well hello there!\" she said. \"What's a handsome fella like you doing in a place like this?\"\n\n\nHer hands were around my neck and she leaned down to steal a kiss. She leaned over the heavy package in my arms pressing it's weight between the two of us. When she pulled away she was smiling.\n\n\n\"Now. What did you want to show me. I hope this wasn't some bad attempt to seduce me before my wedding night.\" A knowing sparkle shone in her eyes \"After all, you know how pure I am.\"\n\n\n\"Oh. No. I would never dream of sullying your honor. You know, not the way I did yesterday. Or the time before. Ow! Or that one time in the bathroom at your sister's baby shower. Ow! Ok, I'll stop! I surrender!\"  \n\n\nShe swatted at me a few more times. \"Alright, if you didn't call me out here to bend me over a headstone, what do you want?\"\n\n\nI held up the package. \"Open it. Here.\" I scooched over and made a spot for her on the bench. \n\n\nShe eyed the bench. \"Sorry, I can't get the slip dirty.\"\n\n\n\"Alright, take a seat.\" I patted my lap. She smiled and sat against me, crushing my leg in the most pleasant way possible. \n\n\nShe picked up the package and eyed it. It was wrapped in brown parchment paper like an old timey parcel. \n\n\nShe ran a fingernail under the tape that held the paper then started to gently unfold it. She'd always been of the 'unwrap, don't tear' persuasion. Something we disagreed on. \n\n\nAs the paper fell away, there was a cardboard box beneath it. The tape was alreay slit open so she opened it easily. There was fitted styrofoam inside. She gave me a puzzled look as she struggled to pry the form fitting material away. \n\n\n\"Here, you hold the box and I'll pull,\" she said. As she got the foam free and pulled it apart, something metal glinted in the sunlight. She gasped.\n\n\n\"I know how you like old ritual things and-\"\n\n\n\"It's lovely!\" The bell had to be held in two hands. It was about the size of a head. There was a pattern etched in of a wedding scene or some similar ancient revelry. beneath that was an inscription in unknown script. \n\n\n\"Mr. Gambel helped me find it. It's supposed to be used for weddings to bless them. I pulled some strings and Mark's going to ring it from the church after we say our vows.\" \n\n\n\"I... I love it so much.\" Tears started to fill her eyes she laughed as she wiped them away. \"It's a good thing I haven't put on my makeup yet. Thank you, babe.\" \n\n\n\"Of course. I'm glad you like it.\"\n\n\n\"I, um, I need to go get ready. I'm gonna go back all teary eyed and their gonna think I'm having second thoughts and it'll be your fault for making me cry on our wedding day,\" she said with a playful smile. She leaned over and kissed me again. \"I love you.\"\n\n\n\"I love you to.\" \n\n\nShe was bounding back to the church. I put the bell back in the box to carry it up to the chapel. \n\n\nMr. Gambel had helped a lot in finding it. It had only come in yesterday.\n\n\nHe had immediately advised against using it when he saw it, but what did he know. \"The symbols aren't right,\" he'd said.\n\n\nThat's the sort of thing Amy would catch though. I was almost completely certain...\n\n\nEven if it wasn't, what harm could it do. It would sound beautiful and Amy simply loved it. \n\n\nI waked to the church. And if I wasn't confident than it could be explained away by pre-wedding jitters. \n\n\nI went to the graveyard and brought a bell for my bride as a gift.   ", "action_results": [null]}]}]}]}, {"action": "No, I didn't hide", "result": "\"Hey!\" I stage whispered loudly, waving enthusiastically.\n\n\n\"Hey!\" Chase called back. As he approached I saw a grin on his face. He was ducking slightly and looking around in a conspiratorial way. That's just what this was to him. Two kids sneaking outside with the cookie jar and enjoying the thrill of it. \n\n\n\"Glad you could make it\" I said with a shy little smile \"I have something really special planned.\"\n\n\n\"Does it have to do with the bag?\" he asked with that doofy grin of his. \n\n\nSure enough, I was carrying a large tote bag. I could name each and every item in there as easily as I could say my ABCs.\n\n\n\"Actually that's for later.\"\n\n\n\"What do you have planned then?\"\n\n\n\"You'll see!\" I stepped away slightly and started walking between the paths. I tried twirling a little and giving him a teasing look over the shoulder. Further securing his interest wouldn't hurt.   \n\n\nHe followed along behind me. I looked back then with a playful giggle started to run. \n\n\nHe laughed back \"Dani, wait!\" \n\n\nI kept right on running occasionally giving a quick glance to make sure he was still laughing, still confused, still following like a devoted little lamb. I let him get close and when he almost reached out and touched me I gave a little 'Eek!'\n\n\nI dodged away easily, dancing behind a tombstone then making a beeline to the mausoleum one row over. The doors were open. I had attended to that earlier. \n\n\n\"Dani, don't go in there! We'll get in trouble!\" he said. But there was laughter in his voice and his feet pounded up the stairs. The moon framed his face in the door as he barreled in.\n\n\n\"Dani-\" my name trailed away with a choked gasp as the knife found his chest. I covered his mouth with a piece of cloth. He tried to step away like a deer jerking from the hunter's grasp. It would have been foolish to stop the animalistic reflex, instead I redirected it towards the door beside him, carrying him sideways with his own energy, bouncing that pretty head of his against the brass and stone by letting go of the knife and grasping a fistful of those lovely brown curls. He fell in a stunned heap against the door. I knelt down, waiting for him to slow. When I saw the fight leaving him, I pulled the knife out once then reapplied it for good measure. There was a slight jerk in response but no sound. I pulled the cloth away and was pleased to find an even spotting of blood turned black in the moonlight.   \n\n\nChase was dead. I pushed the hair away from his eyes. I heard Him drop lightly onto the floor from the stone resting place that was set into the back of the wall. \n\n\n\"Well done, Danielle.\" \n\n\nI turned to Him with a smile. He reached out and took the cloth from me then licked the blood there. A grin split His face.\n\n\nThat's right, I went to the graveyard with a knife and brought a present to the one I love.", "action_results": [null]}]}]}