{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=18800", "context": "", "first_story_block": "You and a group of friends decide to go on a little vacation. Your group consist of:\n\n\nRose- Tall blond, not very smart but all the guys like her.\n\n\nTyler- Tall and tan. Thick black hair that hangs near his ears. All the girls have a crush on him. Rose and Tyler are dating.\n\n\nCyrus- tall surfer blonde, also your best guy friend.\n\n\n \n\nAs you drive you find what looks to be an abandoned circus. Do you:", "action_results": [{"action": "Check it out.", "result": "\"Let's go check it out!\" Rose says. She's sitting in the back with Tyler, with her hand tangled in his and his other hand around her shoulder.\n\n\n \n\nYou pull into the vacant parking lot and make your way to the entrance. Out of no where a man in a funky out fit shows up. \"Welcome! How may we help you today?\"\n\n\nYou:", "action_results": [{"action": "\"What is this place?\"", "result": "The tall man looks down on you and smiles. His lips spread apart to reveal many grey-ish teeth. \n\n\n\"This my dear is the best circus you will have ever been too! But it's not your typical circus, no. This place is something very special. Would you like to stay and enjoy your evening?\"\n\n\nRose bumps into you from behind and clings to your arm. \"Let's stay! Please can we?\" Her nails dig into you until you're forced to say yes. Do you:", "action_results": [{"action": "Go together.", "result": "\"I think we should stay together.\" Cyrus says. The man walks towards a booth and comes back with a few bags of popcorn. Rose practically downs her bag within a few seconds.\n\n\n\"Enjoy your stay.\" He grins again then disappears. \n\n\nRose and Tyler start to wonder off so you and Cyrus hurry to catch up. \"This place gives me the creeps.\" You whisper to Cyrus.\n\n\n\"You can hold my hand if you get scared.\" He smirks and you both giggle. Up ahead you see what looks to be like a little stadium. Rose starts to run towards it, dragging her boyfriend with her, as you two just waddle your way behind them.\n\n\nAt the entrance is a little ticket booth. \"Welcome to our show. Please, enjoy.\" His smile is just as creepy as the first man you met. You walk inside and take a seat. The show immediately begins with the lights shutting off. You jump into Cyrus' side and he laughs at you. Fire starts to form in the middle of the arena then starts to move in a circle. The circle slowly gets bigger and bigger until it is a few feat away from you four and you can feel the heat. The fire disappears then reappears to reveal the same face as the man you met when you first got here.\n\n\n\"Welcome.\" He says in a deep voice. \"How are you liking your stay?\" Rose bounces up and down with excitement and claps her hands. \"Very good. For my next act I will need two volunteers.\" Rose instantly jumps up with Tyler by her side, and runs towards the man. \n\n\n\"Very, well. Son, I'm going to need you to hold this.\" The man hands over the fire (which was not on a stick or anything. It looked as if he had been controlling the fire.) Tyler hesitates a moment before accepting it with wide eyes. \"Now you, miss.\" He wrapped his arm around her waist.\n\n\n\"Hey!\" Tyler yelled in anger.\n\n\n\"Oh, shut your mouth.\" The man moved his fingers as if zipping his mouth shut, and then Tyler couldn't speak. He moved his fingers near Rose's face, chest and stomach without touching her, and whispering something in a different language until her body became limp and fell on the floor. Tyler jumped around in envy and trying to scream but didn't know what to do. Just then the fire in his hand grew bigger until it engulfed his entire body. Do you:", "action_results": [{"action": "Get out of there as fast as you can.", "result": "Cyrus urgently grabbed your hand and you two booked it out of there. Seeing your two friends hanging from a rope made your heart thump out of your chest. You both jump into the car and drive away as fast as you can. You drive to the nearest police station and explain in as much detail as you can about the circus. When the police go to check it out, they find an empty field with only two bodies with their necks snapped. Your friends are dead and you and Cyrus are taken in for questioning.\n\n\nPlay again?", "action_results": []}, {"action": "Try and stop the man.", "result": "Both you and Cyrus jump into action and make your way towards to the three. Cyrus grabs ahold of the mans neck, but before he could get a grip, he falls to the ground in a seizure and wiggles dramatically until foam forms in mouth and he chokes on his own spit.\n\n\n\"Cyrus!\" You turn towards the man, and the last thing you see is his face illuminated from Tyler's burning body. \n\n\nThe next day a young couple drive by an empty field and find four dead bodies on the side of the road.\n\n\nPlay again?", "action_results": []}]}, {"action": "Separate.", "result": "Tyler and Rose head off hand in hand on their own immediately while you and Cyrus stand with the creepy guide. \"What is there to do around here?\"\n\n\nHe turns with another grin and starts to walk towards a booth. You and Cyrus follow behind him. He whispers something to the worker behind the booth and then is given two bags of popcorn. He hands the bags to you two and says, \"Please enjoy your stay.\" before disappearing again.\n\n\n\"Well, that was weird.\" Cyrus says as you both chew on a few pieces of popcorn. \"What do you want to do?\"", "action_results": [{"action": "Find the others.", "result": "You search and search the place but find no site of Rose or Tyler. \"I'm sure they found a quiet place to go make out or something. Don't worry about it.\" Cyrus said. \"Look! There are some games, lets go play!\" You walk over to an eerie booth that is quite dark. \n\n\n\"Welcome.\" Says the short man at the booth. \"This game is like hang man. I think of a word or two and you guys have to guess letters. Do you want to play?\" You both nod and guess the letter C. \"Wrong.\" A light shines into the darkened booth and shows what appears to be a sack leg.\n\n\n\"A?\"\n\n\n\"Good, There are 2 A's. Your word now looks like this. _ a_ _ _ _ a _ _ _\"\n\n\n\"L?\"\n\n\n\"Wrong again!\" Another light shines to show another leg. \n\n\n\"D!\"\n\n\n\"Wrong again.\" this time the light shows the stomach of the sack doll.\n\n\n\"K.\"\n\n\n\"Good. Your question now looks like this. _ a _ _ _ _ a k _ _.\"\n\n\n\"M?\"\n\n\n\"Wrong again!\" A disgusting smile appears on his face. The light shines again to show an arm.\n\n\n\"E!\"\n\n\n\"Good. Your question now looks like this. _ a _ _ _ e a k e _.\"\n\n\n\"N!\"\n\n\n\"Wrong!\" The light shines to show the second arm.\n\n\n\"O?\"\n\n\nThe smile gets bigger and he starts to laugh maliciously. \"WRONG!\" The light shines on the face and your heart sinks into your chest as you look at Rose's face with a rope around her neck. \"You guessed wrong and killed your 'stickman'. Do you want to try again?\" He pulls down a curtain to reveal Tyler in the same position as Rose.\n\n\n ", "action_results": [null]}, {"action": "Check the place out.", "result": "The two of you find the entrance to a maze as well as a custodian. \"The rules of the maze are you cant cheat by cutting the paths, and you must finish together. You are not allowed to leave the maze unless you two are together.\"\n\n\nYou both nod and make your way inside. The walls are 10 ft. tall thick bushes and the paths are very narrow. You hear screaming and other noises somewhere in the distance. \"Cyrus?\"\n\n\n\"Yeah, what is it?\" \n\n\n\"I have a really bad feeling about this place.\" \n\n\nHe stops and faces you. \"We'll be just fine. As long as we stay together we'll make it out.\" His hand slips into yours and you instantly relax. You turn corner after corner for what felt like hours before hitting a dead end.\n\n\n\"I think this was a bad idea. I told you this place wasn't good!\" You start to shake and tears come out of your eyes. Cyrus squeezes your hand tighter and kisses your lips. Do you:", "action_results": [{"action": "Kiss him back.", "result": "He pulls you in and kisses you harder as you do the same. His hands move up and down your body as you quickly unbutton his shirt. His hands find your pants zipper and your pants fall to the ground. you both simultaneously lay on the ground and he is lying on top of you. He moves from you lips and starts kissing your neck. Your hands find his zipper and fumble with his pants. You both have the most amazing hour or so you have ever had and end up falling asleep in each other's arms. \n\n\nYou awake in the morning in an empty field and find a note next to your head. the note reads; \"Congratulations! You have obeyed the rules and are allowed to leave.\"\n\n\nYou both get up and put on your clothes and walk hand i hand towards the car where Rose and Tyler are asleep in the back seat.", "action_results": []}, {"action": "Pull away.", "result": "You push him away gently and look at your feet.\n\n\n\"I'm sorry, i shouldn't have done that. I was just trying to calm you down.\" When you don't reply he takes a step back. \"Um, I'll go on ahead and try to find the way out.\" Before you could say anything he vanishes. You slowly walk the way he left and you feel as though the path way has changed. \n\n\n\"Cyrus?\" You hear him scream somewhere up ahead and you run towards it. \"Cyrus!\" You turn every corer you run into until you find him laying on the ground bleeding from a crushed skull.\n\n\n\"I told you that you couldn't leave the maze unless you were together.\" Came a voice from behind. You feel a sharp pain in the back of your head before everything goes black. On the news the next day is about an investigation of two bodies found on the side of the road.\n\n\nPlay again?", "action_results": []}]}]}]}, {"action": "Turn and leave.", "result": "You get a bad feeling of the place and leave. You stop by at gas station a few miles down the road. Inside the gas station you find a cute couple. You talk for a little while and they mention the circus. They say they're giving to go check it out and you wish them luck.\n\n\n \n\nYou see on the news the next day that the same couple had been found dead on the side of the road where the circus had been but was no longer there.\n\n\n \n\nPlay again?", "action_results": []}]}, {"action": "Keep driving.", "result": "You get a bad feeling of the place and drive away. You stop by a gas station a few miles down the road. Inside the gas station you find a cute couple. You talk for a little while and they mention the circus. They say they're giving to go check it out and you wish them luck.\n\n\n \n\nYou see on the news the next day that the same couple had been found dead on the side of the road where the circus had been but was no longer there.\n\n\n \n\nPlay again?", "action_results": []}]}