{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=64216", "context": "", "first_story_block": "Bill Ingersoll\n\n\n© 2020 All Rights Reserved / Published October 2020 / Photos by the author", "action_results": [{"action": "BEGIN", "result": " \n\nMany miles away there's a shadow on the door\n\nOf a cottage on the shore\n\nOf a dark Scottish lake—\n\n\n—Many miles away.\n\n\n—— The Police——", "action_results": [{"action": "Next page.", "result": " \n\n \n\nBASED ON A REAL CABIN.\n\n\nBY A REAL LAKE.\n\n\n \n\n ", "action_results": [{"action": "Next page.", "result": "he last thing either of you expected to find at this remote lake was a cabin.\n\n\n\"Are you sure we're still on state land?\" Amy says.\n\n\nThere is doubt in her voice — not in the existence of the structure, because obviously there it is about a hundred feet away. The accusation behind her question is that you've strayed off your intended course and made an unplanned detour onto someone's private preserve.\n\n\nBut you know better than to be baited by that; the two of you have hiked so deep into the Adirondack wilderness that there is no private property to wander into. \"No, this is Shingle Shanty Lake,\" you say, \"right where the GPS app says it should be.\"\n\n\n\"I thought there weren't supposed to be any cabins on state land, though.\" Your girlfriend is clearly tired and short of patience; it has been a long hike, with the threat of rain looming closer. Both of you had known you'd need to find shelter soon, or be caught outside in a potentially torrential downpour, therefore the last few miles had been completed under pressure to finish as early as possible. The stress of the last hour is now reflected in her tone.\n\n\nThat being said, Amy does have a point about the cabin. \"There's not supposed to be,\" you agree.\n\n\n\"What does your phone say?\" Amy says, referring to the GPS-enabled hiking app you've been using to navigate.\n\n\nWith your thumb you activate the screen. You already know what it says, so you extend the phone toward her so she can see for herself.\n\n\n\"It just says there is a lake at the foot of Deadman Mountain,\" you explain. \"And here we are.\"\n\n\nThe lake is just a short distance away from where you're standing, but so far it has barely captured your attention; the unmarked spur trail that led you here, and which had clearly once been an old driveway, has brought you first to the edge of the clearing where the old camp stands unexpectedly. This is hardly some rustic old log cabin of the kind Abe Lincoln might call home, though: it is sided with evenly-cut lumber, painted a mineral shade of red, with square cinder blocks forming the chimney. It is a humble but otherwise modern structure, made with materials bought from a lumberyard.\n\n\nAmy barely glances at your phone; all day she's been more than happy to critique your choice in routes for this year's big October backpacking trip, but she clearly did no research of her own. You know perfectly well she has been merely following your lead, indulging your desire to spend the long weekend on a forty-mile loop through the wilderness. Her only requirements, vaguely stated and implicitly understood, were that this trip be an escape from current affairs: at no time should an antiviral face mask be required, and never should the word \"trump\" be uttered unless someone is playing a game of Pitch.\n\n\nNevertheless, ever since the two of you left her old, black Jeep Liberty back at the Deep Creek trailhead seven hours ago, she has been letting you know the many subtle ways your choices have been disappointing her. And to be fair, the first ten miles of your planned loop have not been well maintained, and you have not seen any people since the hike began. \"Social distancing\" is one thing, but the complete absence of people is disturbing in ways you hadn't anticipated. Usually there are footprints in a wilderness trail, no matter how remote; this one, though, has seemed completely abandoned and forgotten, cluttered with fallen logs and overgrown with saplings. It gives you the impression you're the first two humans to venture this way in at least a year.\n\n\nThus the presence of a cabin, however humble, seems all the more anticlimactic. You put your phone away to avoid draining the battery more than necessary.\n\n\n\"Do you suppose anyone is here?\" Amy says, shrugging under the weight of her Osprey backpack. You presume even this adjustment of her shoulders is intended as a rebuke: the two of you have been standing in this small meadow, overhung by a half-dead crabapple tree and shaded by the puniest of poplars, for several minutes, unsure of what to do or whether you should even be here.\n\n\n\"I don't see any smoke coming out of that chimney,\" you say.\n\n\nThe old driveway splits at the point where you're standing. The way to the left leads down to a spot where you can see a marshy corner of the lake. Right leads to the cabin, perched atop an open knoll. It is late afternoon, and this is the time of year when you need to continuously adjust to the ever-shortening days. Still, the clouds beyond the cabin to the west — the direction from which storms frequently pounce in the Adirondacks — are disturbingly dark. Rain is imminent.\n\n\n\"Shall we go up and check out the cabin?\" you say.\n\n\n\"You mean go inside that thing?\" Amy turns to you so you can see her disapproving expression, the furrowing of her long face framed by dark hair.\n\n\n\"Sure,\" you say. \"I mean, unless you want to stay out here and get wet when those clouds open up.\"\n\n\n\"Isn't there a campsite or something?\"\n\n\n\"I don't know. I've never been here before.\"\n\n\n\"We could look around,\" she says.\n\n\n\"Yeah, but that's a pretty mean-looking shower slipping over that mountain,\" you say nodding toward Deadman, which rises like a black silhouette above the cabin. \"And that roof looks pretty inviting right about now.\"\n\n\nAmy sighs but says nothing further. Again, it's a non-verbal signal that the sum of your plans so far today has led to this unsavory consequence.", "action_results": [{"action": "Next page.", "result": "Between the two of you, there is a reliable two-man tent at your disposal; its fly is rolled up near the top of her backpack, and yours contains its body and poles. If the threat of inundation weren't so immediate, then yes, the plan had been to scout out a place to set the tent up. After all, that's the standard operating procedure for any backpacking trip, especially at a lake where no state-maintained lean-tos are available. Being public land — protected under the aegis of a constitutional amendment no less — the presence of a cabin should be a legal impossibility. The fact that one exists here at a place named Shingle Shanty Lake makes even less sense, especially when this cabin is sided with dimensional lumber and roofed with metal sheeting, with not a shingle in sight.\n\n\n\"We should at least check it out,\" you say.\n\n\n\"I dunno. Maybe we could camp right here.\"\n\n\nYou look around at this patch of open ground, where the untended driveway diverges. No vehicle has wheeled its way here in years, if not decades; the driveway is overrun with the browning stalks of goldenrod, already dying for the season. The ground beneath you is hard, and there is no sign anyone has camped here before. It is not the typical woodland campsite, shady and redolent with the sweet scent of balsam fir, you had anticipated for this region of the Adirondack Park.\n\n\n\"Those clouds will be here before we get the tent set up,\" you say. \"When the shower passes, we can look for a better place to camp then.\"\n\n\nYour girlfriend looks at you long enough to see the skeptical raising of her eyebrows. \"Well all right then. Let's check out this cabin by the lake.\"\n\n\nYou soon learn the cabin has three doors, not one of which seems frequently used; the path to the door closest to the cinder-block chimney is blocked by a knot of goldenrod and red-stemmed dogwood. A tall growth of weeds surrounds the entire structure, and upon closer inspection you discover the grounds are littered with pieces of hardware: rusted sections of plumbing, twisted bits of roofing, the shattered remains of a white plastic barrel (the original purpose of which is not immediately apparent). A section of sheet roofing, partly bent and spotted with patches of rust, lies flat on the ground, daring you to step on it to reach the side door. You don't discover the third entrance until you peep around the font corner of the cabin; it is gaping wide-open onto a weather-beaten deck, sagging unhealthily under its own weight.\n\n\n\"It looks like somebody was tearing it down but then gave up,\" Amy observes.\n\n\n\"They didn't get very far,\" you say.\n\n\nCuriosity compels you to see the inside of this place. You step gingerly across the sheet metal to the side door, which is accessed by two wooden steps. The first droops slightly when you place your weight on it. A storm door with an aluminum frame pulls freely outward, and the wooden door behind it offers no resistance when you gently push on it.\n\n\n\"It's not locked,\" you say, although what you see inside is sure to skeeve your companion.\n\n\nPerhaps you came to this place seeking wild scenery and the primitive experience: wave-broken waters lapping at the foot of spruce-shrouded slopes, the last loons of the year wailing from distant corners, the smoke from burning maple infiltrating your flannel shirt. This cabin, though, is an unexpected curiosity, and despite its deplorable condition you are drawn to explore it. Without hesitation you cross the threshold, entering the ransacked remains of a bunk room. Four bunks still remain, with a pair each to your right and left, but pale spots on the floor and walls show where more once stood. Clothes hangers dangle uselessly from a bar, and the faux-pine wall paneling has been smashed as if by a sledgehammer.\n\n\n\"Honey, you should see this,\" you call out, but so far Amy has declined to join you.\n\n\nA hall leads out of the bunk room, bisecting the cabin's floor plan. There were once rooms on either side, but now only bare two-by-four studs define the edges of these spaces: the room on your right was completely smashed, its floor now strewn with plaster, wood chips, a rotting tree branch, a bucket with a rusted-out bottom, and (most curiously) a decapitated water faucet from a bathtub. The room to the left was clearly once the kitchen, but only because the sink fixture remains. Whatever stove haunted this space in years-gone-past is now vanished; the sink itself is full of discarded hardware and rusted cooking utensils that will never again be washed.\n\n\n\"George? Sweetie, you in here?\"\n\n\nIt's Amy's voice, coming from somewhere up ahead. You complete the trek down the hall, your boots grinding on pieces of shattered paneling. The passage ends at a large room occupying the entire far end of the cabin, capped by a floor-to-ceiling picture window overlooking a growth of young balsam trees. Two picnic tables mark the half of this room that once served as a communal dining area, and a ratty recliner marks the half that used to be the den. Beside the Naugahyde chair is an open door, and beyond lies the sagging deck you saw a few minutes ago. Amy is standing in the door frame, the dark clouds over Deadman Mountain behind her.\n\n\n\"Isn't this place cool?\" you say, kicking aside a piece of broken window glass.\n\n\n\"Go to hell,\" Amy says.", "action_results": [{"action": "Next page.", "result": "Behind her you can hear an odd swishing sound as the approaching shower rushes across the lake. The storm that had been chasing you past the foot of the mountain is now making its lunge.\n\n\n\"You better get in here!\" you say. \"Unless you want to get soaked.\"\n\n\n\"There's moss growing on the floor!\" Amy protests.\n\n\n\"I'm not saying we make an offer to buy the place!\"\n\n\nWhen the shower reaches the deck, she overcomes her last hesitation and steps into the large room with you. The door is wedged wide open behind her, and one of the windows has been shattered, but the walls seem sturdy enough to hold the watery beast at bay.\n\n\n\"It smells dank!\" she says.\n\n\n\"Let's sit over here until the storm passes,\" you say, gesturing to the picnic table farthest from the door. Amy steps tentatively toward it, watching as you unbuckle your backpack and drop it gently onto the floor beside the table. She is about to do the same, but then stops mid-action.\n\n\n\"Are those mouse turds?\"\n\n\n\"Probably,\" you say. \"You can't expect absolute cleanliness. This is just a shelter.\"\n\n\nAmy is not buying it, but she looks around and sees there are few other options. She sees the smashed walls and all the debris strewn across the floors. \"What is this place?\"\n\n\n\"Somebody's old hunting camp, I imagine.\"\n\n\n\"But way out here?\" she says, fishing her water bottle out of a side pocket of her pack. \"And what happened? It looks like somebody took a sledgehammer to the place and then ran.\"\n\n\nIndeed, that seems as plausible an explanation as any. The storm outside is a real soaker, and though the cabin is disgusting and worthy of condemnation for any number of code violations, you're glad for the temporary convenience of its roof. Amy, of course, is seeing only the negative. This is the way your relationship has been for several months now: you thankful for what few lucky breaks you can find, your girlfriend of six years afflicted by a feedback loop of pessimism, as if doing everything in her power to drive a wedge between you, just to watch you squirm.\n\n\n\"What happened to your leg?\" you say.\n\n\n\"My leg?\"\n\n\n\"Yeah. You're bleeding.\"\n\n\nShe looks down and sees the two spots of blood soaking into her pant legs as if for the first time.\n\n\n\"It looks like something bit you on the calf,\" you say, shuffling down the bench of the picnic table to be closer to her, negating the fact she intentionally seemed to put a few feet between you when she sat down herself.\n\n\n\"I can't imagine what,\" she says, lifting up her pant leg to examine the skin underneath. Something has pricked her twice, less than an inch apart.\n\n\n\"Looks like a snake bite,\" you say.\n\n\n\"What snakes? It's too cold this time of year. Right?\"\n\n\nShe rubs the spot, smearing the blood with her fingertips.\n\n\n\"Does it hurt?\" you say.\n\n\n\"No.\"\n\n\n\"That's odd.\"\n\n\n\"I have no idea what could've done this.\" She drops the hem of the pant leg, dismissing the wound. \"Wait— I hear water dripping. Does this roof leak?\"\n\n\nYou hear the sound too — not the splashing of water hitting water, like a bucket placed as a quick remedy to a pesky leak, but the dull thud of water falling on a flat, wooden surface. And almost as soon as you notice this sound, the trickle becomes a continuous stream waterfalling onto the patch of moss on the floor. It is not difficult to find the source: above the moss is a gaping hole in the ceiling, revealing the roof rafters above.\n\n\n\"There's hole in the roof about the size of a grapefruit,\" you report, craning your head under the collapsed portion of the ceiling and seeing the breach above the rafters.\n\n\n\"That figures,\" Amy says.\n\n\n\"At least it's dry where we're sitting.\"\n\n\n\"I hate this place.\"\n\n\nYou don't respond; it was only by chance you found this cabin, and you claim no responsibility for its condition. Amy's complaints aside, seeking refuge in here is infinitely better than trying to set up the tent in the middle of a downpour.\n\n\nLoath to return to her side, not in her current mood, you decide to inspect your surroundings more. The first place to draw your attention is a shelf beside the picture window, just beyond the indoor waterfall.\n\n\n\"This is quite the collection of whiskey bottles,\" you say, stepping carefully around the puddle on the floor.\n\n\n\"I don't suppose any of them are full?\" Amy says, rummaging inside her pack for something, not looking at you.\n\n\n\"Nope. Bone dry,\" you say. \"But recent — not nearly as grody as anything else I've seen so far. Do you suppose someone else has been here?\"\n\n\n\"Like who?\"\n\n\n\"I don't know. Somebody must know about this place besides us; maybe hunters come here.\"\n\n\n\"I would think hunters would have higher standards than this.\"\n\n\n\"Some people would find this place kind of cool,\" you say. \"To them it would be like a giant lean-to.\"\n\n\n\"Men are gross, then,\" she says, pulling out a wool sweater and holding it carefully so it doesn't touch any part of her surroundings before she pulls it over her head.\n\n\nYou ignore the taunt, wishing to do anything but argue now, not this weekend. This was supposed to be four days of happiness, maybe even a resurrection of the glory days when the two of you felt comfortable in each other's company and eagerly sought out adventures such as this. You watch her putting on the sweater, but when she sees you she looks crossly back at you, as if you are invading her privacy. Instead, you look for something else to occupy your curiosity.\n\n\nThe diversion your attention settles upon turns out to be yet another room, this one a small closet-sized space near the picnic tables. The floor is cluttered with debris, leaving no room to stand. But there is a mirror affixed to the wall, edged in chrome, and the shattered remains of a porcelain toilet.\n\n\n\"Do you remember the comedian Gallagher?\" you say.\n\n\n\"Who?\" Amy says from her spot on the picnic table bench.\n\n\n\"You should look him up on YouTube.\"\n\n\n\"Um, sure.\" The flatness of her response seems calculated to you, like she is intentionally resisting your efforts to pique her curiosity.\n\n\n\"He used to smash things on stage, as part of his act,\" you say. \"He called it the 'Sledge-O-Matic' or something. Judging by the looks of this toilet, Gallagher's been here for sure.\"\n\n\nNothing else you've said so far has provoked much of a reaction, but Amy's eyes widen at this news.\n\n\n\"So where am I supposed to go?\" she says plaintively.", "action_results": [{"action": "Next page.", "result": "s it turns out, Amy meant this as a serious, pressing concern.\n\n\nAt the mention of the toilet, which sat in pulverized pieces inside what had apparently once been the bathroom, she professed an immediate need to use just such a facility.\n\n\nThis one hadn't been usable for some time, you pointed out.\n\n\nBut hadn't you seen an outhouse? she asked, her voice almost imploring you to give the correct answer.\n\n\nYou hadn't noticed, but if this place had running water back in its heyday, why would they need an outhouse?\n\n\nBut she needed to go now, she insisted.\n\n\nYou weren't exactly sure what it was she wanted from you.\n\n\nHer needs couldn't wait, though, and with a huff she fished out her toiletry bag from the top of her pack. She informed you she was heading out into the rain to take care of business, and her tone suggested you were somehow to blame. You sat beside your two packs on the picnic table bench, watching her don her rain jacket and venture down the hall toward the remains of the bunk room. The aluminum storm door banged shut behind her, the looseness of the sound suggesting a lack of tension on its spring.\n\n\nThis was nearly half an hour ago now, and there has been no sign of Amy since then. Obviously, you are growing concerned — even despite her attitude problems of late. There was a time you loved her, and she seemed to return the favor without placing barriers between you. There was even a time when a situation like this — taking shelter from a fall shower inside a creepy cabin in the woods — would've been a shared adventure. Your girlfriend may now act like your relationship has grown toxic, yet she clings on; as for yourself, the best you can do is coast on the inertia of your love and hope your patience wins her back.\n\n\nYou had hoped the shower would just be a passing thing: coming, going, and then allowing you to enjoy a peaceful night in the woods as intended. It might be convenient to spread out the sleeping bags on some dry corner of the floor, but clearly Amy wouldn't consent to such a plan. Not that it couldn't work: you've been pacing the cabin while you wait for Amy to return, and while the ceiling in that one corner has collapsed, and while you've found another section of ceiling in the bunk room that has become discolored by moisture, there is plenty of dryness elsewhere. The picnic tables, for instance.\n\n\nAmy's failure to return, however, is puzzling. It's not like she chose now to just abandon you and walk away from your relationship: this lake is too remote, and she left her pack on the picnic table bench. All she took with her was a bag containing a weekend's rationing of toilet paper and some hand sanitizer. This leaves other, no less disturbing options: Is she sick? Did something happen to her? Your imagination conjures an image of Amy tumbling headfirst into some ancient well she never saw in the darkness.\n\n\nThe course of your nervous pacing brings you to the old deck and its soft, weather-beaten boards. The rain is beating against it, abating somewhat but still a solid shower; you step out onto the deck anyway to see if there is any information that can be gleaned from it.\n\n\nOnce this might've been a scenic spot, with views across Shingle Shanty Lake in two directions. The cabin was built on a knoll high above the water, at a spot that had probably been chosen for its view. Deadman Mountain rises to the west, its spruce-forested top raking the dark clouds and perhaps teasing more rain out of them; turning ninety degrees to the left, you can see the peaked silhouette of Cloudcap Mountain several miles away. Only a few glimpses of the lake itself can be seen in either direction, though; in the years since this camp has been abandoned, the balsam trees edging the knoll have shot upwards to obscure the views.\n\n\nMore importantly, however, is the fact there is no sign of Amy from this deck. And if she doesn't return soon, then it may be too dark to find her way back.\n\n\nYou step back inside the cabin before the rain has a chance to seep into your clothing. The two backpacks are still sitting next to each other on the picnic table, currently enjoying a greater measure of closeness than the people who should be bearing them. You have been resisting the temptation to open your pack, knowing you should be ready to leave this place the moment Amy returns and the rain lets up. The fear, though, is that by then it might be too dark to seek out a proper campsite: Amy's own delay may force you to stay here, the one option she'll want to refuse outright.\n\n\nIn fact, the daylight has already grown quite dim. Maybe you don't want to preemptively unpack, but you are going to need your headlamp. As you paw through the upper pouch in your pack you hear footsteps across the panel of sheet metal outside the bunk room door. Finally! Amy is returning.\n\n\nBut the door never opens.\n\n\nYou stretch the headlamp around your skull and turn toward the cruddy hallway, slowly stepping down toward the bunk room. The wooden door was left open, only the storm door closed when Amy left, and this is what you find now. Being careful not to step on one of the exposed nails left carelessly behind when the bunks were ripped out, you step up to the door and crack it open.\n\n\n\"Amy? You out there?\"\n\n\nThere is no response other than the tapering rain and the sound of a roaring stream somewhere in the distant wilderness.\n\n\n\"Honey, is everything OK?\"\n\n\nNothing.\n\n\nBut you are certain that you heard something a moment ago, and that it wasn't just some chipmunk or field mouse. Is Amy playing some kind of prank on you? If so, it would be completely out of character for her; she never has been the type for jokes.", "action_results": [{"action": "Go outside and look for Amy.", "result": "You push the storm door open the rest of the way so you can step outside and try to track down Amy. Your leading foot makes contact with the first of the two wooden steps…\n\n\nBut the rain has made the surface slick, and your boot slips off into space before you can steady it. Your hand clings onto the door handle like it were a lifeline, and you attempt to shift your weight back onto your other foot, the one still inside the bunk room, before you completely lose your balance. It's too late, however: the momentum of the slip is carrying you forward, and when your good foot stumbles you begin a butt-first plummet down the steps. The palm of your hand snags on the handle before gravity wrenches it from your grasp, just as your tailbone collides with the first riser. You can feel the board bouncing under your weight, but it stops shy of snapping apart altogether.\n\n\nYou remain frozen for a full three seconds as if to confirm the fall is over. Then pain asserts itself on your consciousness: a serious bruise at the base of your spine, and a cut on your hand you're not even sure you want to look at. The moisture trickling down your palm might be rain, or it might be blood.\n\n\nGently you rise from your unplanned seat, unsure of how well your body will cooperate. To your relief, though, and despite the sharp discomfort you feel, no bones seem to be broken; indeed, it might be best to keep moving and forget the bruising pain inflicted on your tailbone. You gently open the hand that had been injured on the door handle; the pad of soft skin below your fingers has been scraped raw by the door, but not lacerated. There will be no need to amputate, you try to joke to yourself. It's not funny, though.\n\n\nSo is this what happened to Amy? Did she slip and fall on these same steps, injuring herself worse than you? And is she now stuck in the rainy woods, too lame to return on her own? It's as good a theory as any, but for one flaw: When Amy left the cabin, there was no commotion other than the slamming of the storm door.\n\n\nIf there was a problem, though, wouldn't Amy want to be found? Even if you can't see her, she must be within earshot.\n\n\n\"Amy? Are you all right?\" You listen for a response, but there isn't one.\n\n\n\"Amy? Sweetheart?\"\n\n\nThe darkening woods are your only answer, water dripping from branches that just a few weeks ago were still heavy with leaves.\n\n\nThis is so not right. It is like your girlfriend were never here, like you had been imagining her presence the entire day. Or like she had been here, but now she has simply vanished. You're sure those were footsteps you heard a moment ago, the sound that first drew you to the bunk room door; not the pitter-patter of little paws, but something larger, with a deliberate pace — at least for the two noisy steps the walker made across the piece of metal roofing lying prone before you.\n\n\nOr was it just your imagination? Because now that you are standing out here, with nothing to account for what you heard, you no longer feel so sure. Maybe instead of tracking ghosts around the cabin, you should focus your search a little more directly.\n\n\nTo take care of the \"business\" Amy needed to do, she would usually find a private spot in the woods — screened from view, but not far away. Looking around in the dim evening light, there is an opening in the trees across the yard. Is something stirring over there, or is it just the sound of waves on the shoreline?", "action_results": [{"action": "Search the area immediately surrounding the cabin.", "result": "You can't easily dismiss those sounds you heard: two distinct footfalls across the metal, matching the steps an adult human would make. But then nothing afterward, though, other than your own painful crash. The more time passes since you heard those steps, the more your overactive imagination wants to read additional details into the memory of them: were they going right-to-left, or left-to-right? Coming or going? Approaching the cabin or moving away? You know better than to dwell on any of these false analyses; the more you think about them, the more tainted the memory becomes.\n\n\nNevertheless, it is the only concrete clue you have to work with, especially since Amy seems unwilling — or unable — to respond.\n\n\nThere is still just enough daylight to see your way around the cluttered and overgrown yard surrounding the camp, but you'd appreciate the additional clarity offered by the LED bulb strapped to your forehead. You reach up and flick on your headlamp; a small spotlight shoots out into the drizzle, raking the tops of the dead goldenrod.\n\n\n\"Amy, I know you're here,\" you say, scanning the yard with your little beam of battery-powered light. \"Just talk to me. Pretend you still like me.\"\n\n\nThe silence seems deliberate now, as if this were a game of Hide-and-Seek that she is dragging out for too long a time, for reasons you can't even begin to figure out. The weakening rain shower is still the noisiest thing out here, the drops pelting gently the metal roofs of both the camp and a nearby lean-to shed. An owl calls from somewhere across the lake: Who cooks for you? Who cooks for you A-A-A-ALL! A barred owl, uttering its long-familiar syllables.\n\n\n\"Amy, this isn't funny!\"\n\n\nThe sound of something rustling behind you startles you, but when you spin around all that you see are a trio of yellow-brown leaves falling into the weeds.\n\n\nGet a grip, George!\n\n\nYou can feel the bruise on your tailbone setting in, and moving around might help dissipate that pain. And besides, whatever you heard is no longer standing on this piece of sheet metal — only you. Earlier, Amy had entered the cabin through the open door overlooking the deck, so you decide to circle around that way, nearly tripping over a coil of cable partially obscured by the weeds. This time you catch yourself, but heaven knows what you might've landed on had you fallen again.\n\n\nThe deck is just as empty as it was when you last saw it. No steps lead up to it from the ground; to enter the cabin, Amy must've hoisted herself up on her hands. The structure comes to about waist level on you; the boards look eroded by the weathering process, the smooth finish chipped away by too many years of exposure to both sun and snow, the grain of the wood now forming raised ridges in the gray surfaces. The nails that held them all together are beginning to pop out, the heads now an eighth of an inch above the wood.\n\n\nStill, there is no sign of your girlfriend — or anything else, for that matter. Maybe you're just chasing the paranoid fantasies of your worried brain.", "action_results": [{"action": "Go back inside the cabin.", "result": "The only thing you're going to get out here is wet: the rain is dampening your shoulders, and even the short trek around the corner of the cabin through the brush is soaking your hiking pants. And if for some strange reason Amy is playing games with you, then you're already losing just by wandering around like a fool. Maybe you don't know where she is, but she should certainly know where you are. Perhaps the best option is just to sit tight and let her come to you, in her own good time.\n\n\nYou back up against the deck and place both your hands on its edge, preparing to scoot yourself up onto it. As soon as you place your weight on your palms, though, your scraped-up hand objects painfully: you can feel one of the rusted nail heads irritating the wound. You can't complete the motion fast enough, and in your haste the seat of your pants snags on a nail of its own. The pocket is half ripped off before disengaging with the nail.\n\n\nWell this sucks!\n\n\nStepping carefully back into the cabin, avoiding the remaining nails as well as the broken glass, you reach back to assess the damage to your pants. An expensive pair of clothing, ruined by an inch-long gash in your behind. Add this to the persistent ache to the base of your spine, as well as the raw burning sensation on your hand, and this has clearly not been your best ten minutes.\n\n\nIt occurs to you that it might be wise to clean up the scrape on your hand, especially considering the contact the shallow wound just made with the rusty nail head. There ought to be something in your first aid kit you can use, and the activity of tending to yourself might be a healthy distraction from your concerns.\n\n\nThen your headlight beam falls upon the picnic tables, revealing a startling development.\n\n\nThe backpacks have been shredded. Both of them, sliced in the way you might cut into a baked potato, random contents strewn across the floor, including the down stuffing from at least one sleeping bag. It is like she took a knife to the packs and hacked at them in a wild frenzy, occasionally missing and slicing the table instead. All in the few minutes you had been outside looking for her.\n\n\nThis is going too far — beyond a practical joke to the realm of vindictiveness! What the hell has gotten into that head of hers? What could you have possibly said or done to her to warrant this kind of treatment?\n\n\n\"Amy, this is no longer funny!\" you shout at the walls. \"I'm tired and hungry, and I feel like crap! Now get back in here and let's behave like adults again!\"\n\n\nAt first you think there is once again going to be no response, that you are shouting in vain to someone who has decided to stop speaking to you. Then you notice the third door to the cabin, the one located in the smashed-up kitchen. It had looked securely shut when you first inspected the place, but it is now swinging open — as though it has been recently used. There must be wooden steps there, too, because right now something is walking down them, causing the wood to creak in sequence.\n\n\nNo one speaks, though. The only sound is a soft, beastly grunt — and for the first time it occurs to you this might not be Amy you've been trying to find.\n\n\nWith a chill vibrating through your body, you turn off the headlamp. Then you step around the wall of bare studs into the trashy remains of the kitchen, no longer certain what you're going to find. Spiteful girlfriend acting on some long-festering grudge? Mysterious stranger trying to spook the witless intruder? Black bear absconding with a pair of untended backpacks full of food?\n\n\nEntering the room, the cluttered sink is straight ahead, with a wall to the left that hadn't been completely smashed when this place was abandoned. A garden rake dangles from the sheetrock, its metal teeth embedded in the plaster surface, and a mouse-eaten box of Triscuits sits in a pile of scrap wood below. A word has been scrawled in capital letters across the wall, below the rake:\n\n\nTHILYKOTHERIUM\n\n\n\nThe letters are black scratches, as if written with charcoal. You have no idea what it could possibly mean — or whether it was even there the first time you examined this room.\n\n\nBut does it matter? Whatever you heard descending those steps is now moving away through the brush outside the door!", "action_results": [{"action": "Grab the rake, in case you need to defend yourself.", "result": "Nothing about this situation seems right, and regardless of who (or what) is out there, this intruder has destroyed your backpacks — and maybe even inflicted harm on Amy. You have no choice but to follow, but you're not about to do so without the rake in hand. It might not be an axe or a shotgun, but it's the closest thing to a weapon you can find.\n\n\nThe garden rake looks solid, certainly more intimidating than any of the broken kitchen knives left behind in the dry sink. You grab the long wooden handle and pull, but the steel teeth are maintaining a firm grip on the sheetrock. THILYKOTHERIUM you read again. A warning? A code? It looks like Greek or Latin, the type of taxonomic name a researcher might assign to a genus of wild animals; maybe a team of ornithologists were here, recording an encounter with some rare species of sparrow.\n\n\nAs you work the rake head out of the wall, you worry that the process is taking too long, that your mysterious intruder is getting away. By rocking the handle the sharp metal teeth work their way free, allowing you to heft the rake in your hands. Now you can go see what's out there.\n\n\nThe door is slowly swinging closed in a draft of air, so you kick it open, the headlamp still off. You step carefully onto the back steps, your aching tailbone still a fresh reminder of how this went wrong last time. These steps are larger, though, and more solidly built; despite the rain, the risers are less slick.\n\n\nAt the bottom, you are waist deep in goldenrod and dogwood, the rake held horizontally before you. The shower is tapering to just a drizzle, but there is still much drippage from the surrounding trees as the last light of day exits the woods.\n\n\nBefore you is the driveway that led you to this place. And moving straight through its brushy growth is a shadowy figure, about as tall as you are but otherwise of indeterminate identity. The only thing of which you can be certain: this ain't no black bear.\n\n\n\"Hey!\" you shout to the figure. It stops but doesn't turn. \"Why did you shred my stuff? What'd I ever do to you?\"\n\n\nStill, there is no response. The figure just stands in the open, as if waiting for you to approach it. Who is this guy? A cranky hermit, stealing to survive? Some fugitive from the law?\n\n\n\"I'm looking for my friend,\" you say, taking a step forward. \"Have you seen her? She—\"\n\n\nThat's when the figure turns. There is not much you can see in the gray light, but for a second, while the silhouette is in motion, you can make out a willowy profile that almost looks like Amy herself. But Amy this is not: the body looks fur-covered, as if a cat had learned to walk upright. It sees you standing in front of the cabin holding the rake and lifts its head to the night. The howl it unleashes is feral, hungry; menace is its message, rolling through the forest like the yowl of a coy-dog.\n\n\nYou shudder as a reflexive response, but then immediately regret the involuntary show of fear — if you appear vulnerable, this… thing is likely to react accordingly. Without thinking you raise the rake above your head and shout back — not an actual word, just a fearful noise of your own that you hope proves you're not going to be an easy target. The figure turns and runs into the woods, and before you can check your action or consider alternatives you are giving chase.", "action_results": [{"action": "Pursue the creature.", "result": "his is the problem, though: you're just a frightened and anxious boyfriend armed with a garden rake, pursuing a creature that by all rights shouldn't even exist. What exactly do you plan to do? Gouge its eye out with the teeth, crack its skull with the metal head? And if all you manage to do is annoy this… thing you've just seen, then what's Plan B going to be?\n\n\nYou have to suppress the notion you didn't think this idea through. By all appearances, what you just saw was a predatory creature. And a fairly big one, too, with an apparent axe to grind against backpacks. It's chilling shriek was one of the most unpleasant sounds imaginable in the animal kingdom, as if perfected through the course of evolution to paralyze its prey with terror just at the sound of its voice.\n\n\nAnd yet when you showed intent to fight back, it darted away. Whether it did so out of fear or as a tactical retreat to a better, more defendable location remains to be seen. But while you have the advantage, you might as well drive it out of here.\n\n\nThe thing had disappeared into the woods directly across the clearing, just yards from where you and Amy had first beheld the cabin. What's over there? You haven't the foggiest clue. It does occur to you, though, that your quarry probably knows this area quite well, and the route of its escape was not chosen at random.\n\n\nStanding at the edge of the open area, you peer into the shadowy forest. It is getting so dark now that the creature could be standing forty feet away and you might never see it. The fact you can't hear anything matching its size and speed is concerning too; this tells you that it has either sprinted out of earshot already (unlikely) — or (more likely) it only went so far before stopping to make its stand.\n\n\nGeorge… That's you, isn't it, George?\n\n\nThe sudden sound of Amy's voice, not only after the passage of so much time, but at this precise instant, is startling.\n\n\nYou spin, scanning your surroundings, as it is not entirely clear where the sound is coming from. \"Amy? Where are you?\"\n\n\nHere, George, except… I cannot say what has happened.\n\n\nYou pivot back around toward the woods, but still see nothing. \"You need to tell me where you are, babe. I want to help, but I can't see you.\"\n\n\nI'm… right here?\n\n\nThat's not helping very much. \"Honey, it might be best if you lie low right now. There is… something strange going on. Kind of hard to explain.\"\n\n\nI don't have control anymore, George.\n\n\nThat's a rather odd statement. What could that possibly mean? \"Amy, honey, I swear I can hear you loud and clear, but I don't have the slightest idea where you are.\"\n\n\nIt's me. I'm right here.\n\n\n\"Sorry, I don't mean to be a pain, but I can't pin down the location of your voice. It sounds like you're everywhere all at once.\"\n\n\nI need help. I don't know what's going on.\n\n\nYou look into the woods, in the direction where the strange creature had fled. It was bizarre, it was fearsome, but it may very well be completely gone, because you cannot see nor hear any signs of its presence.", "action_results": [{"action": "You've got to make sure that creature is gone for good.", "result": "\"Amy, I know this is not what you want to hear,\" you say, \"but we're not alone out here. Something's been stalking us, and I need to drive it away first.\"\n\n\nIts me. I'm watching you.\n\n\nIt doesn't sound like she understands. You adjust your grip on the rake handle, hoping this fugitive from the Home Depot is up to the task at hand. Keeping your eyes focused on the shadows ahead of you, you try not to let this odd conversation with Amy become a distraction.\n\n\n\"I need you to hold tight, OK, honey? I'll be back for you in a minute.\"\n\n\nGeorge, I think you're in danger.\n\n\n\"We're both in danger. This is why I need you to be quiet while I take care of… this.\"\n\n\nIt knows where you are. I've lost all control.\n\n\nControl? She mentioned this once before, but you have no idea what she means by it; the statement seems just as odd as the fact you can hear her so clearly, and yet you still can't pin her voice to a specific point of origin. Did she hit her head in the dark, dazing herself?\n\n\n\"Ssssh, it'll be all right.\" But as you tighten your grasp on the rake handle, it occurs to you this reassurance could be just as much for your benefit as it is for hers.\n\n\nA twig snaps somewhere ahead of you, and you decide this is the moment to make your lunge. It might just be a chipmunk gathering nuts in the dark, or it might be that \"Thilykotherium\" thing written on the wall of the cabin. You will never be able to tell for sure. But this whole night so far has been bizarre beyond belief, and for once you want to be the one taking a decisive action.\n\n\nAmy's voice fills your ears like a running commentary as you swing the rake: No, George. I don't want to kill you. It knows where you are. I do not have control. But you don't have the time to parse the meaning of these words: the toothy head of the garden rake has struck a body in the dark, and when you hear the shriek you know exactly what it is you've hit.\n\n\nThe creature is merely a shadow among shadows now, although perhaps it's better this way; if you could actually see the thing, its appearance might have that chilling effect again. The owl-like shriek is painful enough, like a sonic knife wielded against your eardrums. The creature is trying to grasp the other end of the rake, and you know if it does you'll be defenseless. So you thrust it forward, between its own grasping claws, and you feel the metal head striking something hard and bony — like a skull. The next shriek that fills the damp night air is one of pain, and then you hear the sound of feet backing away, deeper into the forest.", "action_results": [{"action": "Follow and finish it off for good — or at least ensure you've scared it off.", "result": "Amy's well being is important, of course, but you've just scored a point against this whatever-it-is and now's not the time to cede the advantage. The retreating footsteps sounded cautious, not like a full-on capitulation, and you won't be able to guarantee Amy's safety until you're sure this thing is either brained by the rake — or made to sufficiently appreciate you as a physical threat to its own safety.\n\n\nTherefore you employ the same strategy that worked so well just a moment ago: lunge forward, swinging the rake. But this time you find only empty space.\n\n\nAs if in response, the creature shrieks again — but from well ahead of you in the woods. Is it as frightened of you as you are of it, as they say of most wild creatures? Or is it taunting you, daring you to follow?\n\n\nThe one thing you know for sure is that you'll never be able to relax so long as this creature is on the loose, patrolling the woods surrounding the cabin. And this must be your short-term goal, right? —to survive the night, make it to morning, and then gather what's left of your gear and skedaddle with Amy at the best possible pace to someplace safe. The first step in that plan is to drive away this primal threat, if not wound it so badly it no longer sees itself as the most frightening force in the forest.\n\n\nSo, feeling the thrill of the chase and seeking to assert your mastery over the moment, you return the creature's shriek with a scream of your own. Then you remember the headlamp strapped to your forehead and reach up to flick it on. A cone of LED illumination turns the trees ahead of you into ghostly gray shadows — telegraphing your location, yes, but hopefully also instilling a deer-in-headlights reaction in all that falls within your path.\n\n\nYou don't see a pair of reflecting eyes, but there does seem to be a well-worn track ahead of you, leading deeper into the woods. Surely this is what the creature is following, and so you charge forward in pursuit, dodging tree branches and leaping over fallen logs, prepared to wield the rake again at the first sign of danger.\n\n\nThe track leads over the top of a broad knoll in the forest and seems to dissipate just before reaching a thicket of young spruce. You pause, listening for sounds in the woods and looking for visual clues, but not finding much to work with. The creature is no longer filling the forest with its horrific, nail-on-proverbial-blackboard shrieking, nor can you hear its footsteps.\n\n\nAs you turn about, the headlamp beam likewise follows your gaze like an erratic lighthouse in the woods. You see no sign of that creature, but the cone of light does reveal something else: the silhouette of a car, of all things — gray and dull, its paint long since rusted away. It's been many miles since you've last seen a drivable road, but then again there's a dilapidated cabin not too far away, so apparently at one time people were able to drive to this remote place, and maybe this is one of the vehicles that once brought them here.\n\n\nWith no other definitive objects to find besides this relic and the surrounding trees, you step toward the car. The fenders are its most striking feature, telling you right away that you're dealing with something that's probably been rotting away here since before you were even born. Round headlights, stylized front grill, and an overall 1940s vibe. A shield-shaped badge affixed between the radiator grills shows a picture of a sailing ship, the Mayflower from Massachusetts history; it takes a creative leap of your over-stimulated imagination to link that scene with the name Plymouth, which had indeed once been a brand of automobile.\n\n\nBut the back end is smashed up, as if the car had been totaled in a rear-end collision and then dumped in this isolated place. Your light shines through the shattered windshield to the skeletal remains of the steering wheel and dashboard, imagining the possibility that someone died in that seat, back before seatbelts were common and when \"airbag\" meant someone who talked too much.\n\n\nGeorge, you shouldn't be here.\n\n\nAmy's voice is just as cool and stilted as before, but you jump at its unexpected reemergence.\n\n\n\"Honey?\" you say, spinning around, wondering if your girlfriend has been following you all this time.\n\n\nMy… jaw hurts? You've angered it. I don't have control.\n\n\nHer voice is clear, even if the words themselves are bizarre. All day long she had been bitchy, but now she's just… flat, emotionless, and cryptic as all hell. With a habit of turning up when you least expect it.\n\n\nOf course, you see no sign of her.\n\n\nGeorge… help me?\n\n\nIt's a weak, plaintive statement, dripping with vulnerability. This time you don't respond. When in the last year — maybe longer — has Amy needed your help? Hasn't her emotional distance made it clear to you that you have been little more than an accessory in her life, a project she took on once but later forgot the purpose? You have been somebody she continues to associate with as if out of habit, unwilling to let go but also distinctly aloof, like someone trapped in the space between the feminist ideal of true independence and the basic need for male companionship, seeing these as non-compatible extremes she has been unable to resolve.\n\n\nSo… now, tonight of all nights, she needs your help? Things are not as they seem, you are beginning to realize. A moment ago you had an entire conversation with her, and yet you could never pin down the location of her voice. Perhaps she was never there — perhaps you had imagined the entire exchange.\n\n\nI don't want to kill you. It knows where you are. I do not have control.\n\n\nThis is not Amy. There is no possible way she could be here now, talking to you without being seen. These are not even words she would say to you.\n\n\nStill, there seems to be nothing here besides you and this wrecked Plymouth. The only sounds not in your head are those of the drips of water from the rain-soaked trees.\n\n\nI do not have control, George. I don't want to kill you. I will remember you.\n\n\nThat's when you realize there is something else here: the sound of something breathing, on the other side of the car.", "action_results": [{"action": "Confront whatever is there.", "result": "It could be something as harmless as a deer fawn hiding from your headlamp, or it could be that weird creature you briefly saw by the cabin just before striking it with your rake. But whatever you hear breathing on the opposite side of this Plymouth, it can't possibly be Amy.\n\n\nGeorge, you are in danger. Please run. I am not in control.\n\n\nIgnoring Amy's incorporeal voice, which sounds like it comes from nowhere-and-anywhere because, as you now realize, it exists only in your head, you take the rake by both hands again and step around the wrecked car — quickly, before the breather can react and run away. You fully expect to find something normal there, like maybe a fox or coyote, but no, your original suspicion was correct:\n\n\nThe cat-like creature is crouched beside one of the rotten tires, glaring angrily through the beam of your headlamp.\n\n\nBefore you can fully process the information it leaps.\n\n\nGeorge, I— Amy's voice starts to say, but it cuts out the moment the rake head makes contact with the creature's gut. For a moment its murderous intent is deflected by the force of your blow, which was really just a reflexive reaction that happened to get lucky. The creature rolls away into the wet leaves, twice now feeling the bite of the rake. You might feel sorry for the pain you've inflicted, if the tips of all four limbs weren't a collection of dagger-like claws, each a steak knife more than capable of slicing and dicing someone like you into pieces; a short-order cook at a diner is probably less endowed with cutlery than this strange beast.\n\n\nYour lucky blow has stunned the beast, but you haven't dimmed its primal hatred. If anything you've probably stoked it, given it all the motivation it needs to rip open your jugular — although it had already seemed so motivated the last time you met. After rolling off the end of the rake in pain, it continues rolling across the ground until finally back in a position to spring to its feet, shrieking as it does so. And there you are, still squarely standing on two feet and wielding the garden rake. Once again you have the momentary advantage, the upper hand over something that has shown every indication it intends to kill you, for perhaps no other reason than it is a hunter and sees you as vulnerable prey. And if it gets to its feet once again, your advantage will be negated.\n\n\nSo just as the creature is springing from its roll, you are swinging the head of the rake down towards its skull.\n\n\n—don't want to—\n\n\nAmy's imaginary commentary has been an ongoing presence inside your brain, as if you are carrying inside you a traumatic guilt about her disappearance. But this subconscious version of her seems more intent on warning you about something, and only vaguely aware of the actual circumstance before you.\n\n\nThe creature, too, seems unaware of the rake's trajectory until it is too late. The row of steel teeth make contact with its brow and knock the beast of its feet again, before it had been able to make its pounce. It falls to the ground once more, this time limply, the fangs still bared mid-snarl. The twitching muscles make you nervous that it may be preparing for one more attack, so you swing the rake down against its head again. The blow snaps the steel fixture off the wooden handle, but it also removes a small chunk of the creature's skull. It lies dead before you, its feral rage snuffed out by your quick reflexes.\n\n\nBut at the same time, Amy's voice inside your head goes silent too.\n\n\nYou stand there for a moment, still holding the headless rake handle, your lungs now making up for this burst of self-preserving activity with heavy gasps for air — as much to fill your bloodstream with oxygen as it is for the emotional sense of relief that at least one aspect of today's ordeal might be over. You hiked over ten miles to get here, you haven't eaten anything, and you still don't know what happened to the real Amy. But at least the thing that destroyed your backpacks and was stalking you in the darkness is no longer a threat.\n\n\nAs you regain your composure, you pace around the other side of the Plymouth, worried that the site of the creature's fractured skull might cause you to heave at the moment you're trying to steady your nerves. You focus instead on the dripping water, the rain that collected on the last of the beech leaves, still dripping long after the shower has passed. The sound is so simple, so pure — and with Amy's disembodied voice banished from your head, each drop now seems so loud.\n\n\nThe longer you keep away from the body, however, the more surreal the events of the last half-hour seem. Seriously, what did you just kill with that garden rake? And why didn't anyone on Instagram warn you beasts like this exist in the Adirondacks?\n\n\nFractured skull or no, you need to take a closer look. So you step back around the old car, finding the body with your headlamp beam.\n\n\nExcept that instead of a creature covered with brown fur and armed with deadly claws, it's Amy you now see lying dead on the ground, her skull fatally cracked open.\n\n\nYou fall to your knees in horror, your sense of reality shattered with the panicky dread of what you might've just done. What did you just beat to death? Whose voice were you hearing? Has something here put you so out of your mind that you've lost the ability to distinguish the difference between reality and fantasy? Is it just because you haven't eaten dinner that you feel so light-headed?\n\n\nDespite the cold, and despite the dampness and every other discomfort, you maintain what amounts to a vigil all night long between the Plymouth and the object that very much resembles Amy's naked dead body, hoping that this has all been a feverish dream from which you will soon awake. That would be the only way anything that has happened here would make sense — certainly more so than \"werecats\" and the possibility you have brained your girlfriend with a garden rake. If you were to go to the authorities and report the events of the night as you remember them, no one would believe you. Therefore you desperately need to wake up and have all this be a dream, and for Amy to be very much still alive.\n\n\nAs the hours advance through the night and into the morning, the battery in your headlamp fades into impotency, leaving you in the dark as you sit with your back against the vehicle. Everything seems lifeless: your source of light, the wrecked car, the leaves that have all dropped from the trees for the year.\n\n\nAmy.\n\n\nAnd when you do awake in the morning, it is only to find that you are in the same place, under the same circumstances. The clouds that soaked the forest last night have cleared away, allowing a brilliant sunrise to light up the Plymouth an everything around it. Everything you remembered and wanted to be a bad dream is still there, now illuminated beautifully by the light of a new day.\n\n\nAnd thus the evidence is clear: you are a murderer.\n\n\nTHE END", "action_results": [{"action": "But before you go, check out the image gallery first!", "result": "Image Gallery\n\n\nThis story is based, more or less, on a real place... although to the best of my knowledge, none of the events described here have ever occurred. The following images are modified from my original photos, all taken during various visits to the real \"Shingle Shanty Lake\" and its cabin in 2020.\n\n\n \n\n\n\nInterior of the cabin, where moss grows on the floor under a giant hole in the ceiling.\n\n\n \n\n\n\n\"Shingle Shanty Lake\"\n\n\n \n\n\n\nThe old Jeep Willys truck\n\n\n \n\n\n\nYet another abandoned vehicle, now stranded from the nearest drivable road.\n\n\n \n\nAnd perhaps the best picture:\n\n\n\n\nThe Thilykotherium, as rendered by my 9-year-old nephew, Adam F.", "action_results": []}]}, {"action": "Back away. Get out of here now.", "result": "The entire night is out of sorts. You vaguely remember choosing to come here to find peace and solitude, although so much has happened in the last few hours — and especially in about the last half-hour — that the decisions and choices that went into your original trip planning process now seem like a distant dream. Ever since you arrived, nothing has been right: finding a cabin where there should only be a public wilderness, moss where there should be a floor, Amy stepping away to go pee and never coming back, spotting a creature that reason says shouldn't exist, a car wrecked in a long-ago decade on a far-away highway.\n\n\nAnd now the realization that you've been hearing voices in your head.\n\n\nIf this were a story, you'd be what is called an \"unreliable narrator.\" Nothing in this plot line you've been unspooling to yourself makes sense, and yet you've been going along with it, looking for reason where reason can't exist.\n\n\nUntil now. Something is breathing on the other side of this Plymouth, and according to the logic of this nightmare you've been experiencing there is only one thing it could be. The beast, of course. The one you've been chasing through the woods, armed improbably with a garden rake. You could play along, approach the creature and take another swipe at it, but what would that prove? Wouldn't that be prolonging the nightmare?\n\n\nGeorge, you are in danger. It knows you're here. I am no longer in control. Amy's voice has become a monotonous running commentary, her words on the edge of making sense, but ultimately they can be nothing more than gibberish because nothing here is real. Right?\n\n\nSo instead of engaging the nonsense, you decide to back away from it, a lucid dreamer defying his own nightmare. Like that time many years ago when you dreamt you were falling from a plane, and the terror of that moment startled you awake, and you realized that a dream could be a flimsy structure collapsing under the weight of its own implausibility. And sometime later, when as a teenager you dreamed you were walking down the hall at school without any pants on, so you simply paused the dream and reimagined yourself fully clothed. That nightmare went away without complaint, finding nothing for it to feed upon.\n\n\nIt's coming for you, George. I cannot control it. I don't want to kill you.\n\n\nGo to hell! you shout to Amy's voice in your head. This isn't real! None of this is happening!\n\n\nAs if to demonstrate your denial of these events, you toss the garden rake into the trees. It caroms off a beech sapling, lands somewhere in the dark.\n\n\nI will remember you, George. I don't want to kill you. I no longer have control.\n\n\nAre hallucinations a symptom of COVID-19? Perhaps that's the explanation; this hike never occurred because you've been intubated in some hospital ICU, surrounded by doctors in hazmat suits like astronauts on a strange new world, rendered delirious and unable to escape the hellish conjurings of your mind.\n\n\nStill, though, despite all this denial you continue to perceive yourself in this forest, walking slowly away from the Plymouth with its broken windows and smashed-in trunk, something stirring on the far side, Amy's voice a constant presence inside your skull.\n\n\nI am sorry, George. I wish I could do more. There have been regrets.\n\n\nShe's speaking as though you are already dead, that it's just a matter now of waiting for the inevitable. Perhaps that really is Amy speaking to you? Maybe she's leaning over your deathbed in the real world, told by the hospital staff that you are beyond hope. This doesn't seem right either, because don't the most dire COVID victims die alone? Yet another fact that isn't adding up.\n\n\nThis is it, George. There is nothing I can do.\n\n\nSo far you have only backed up about fifty feet from the car, your eyes still pointed in that direction even if your attention has wandered.\n\n\nI don't want to kill you. I am not in control. I will remember you.\n\n\nThe creature you saw at the cabin is emerging from its hiding spot behind the car, crouching from the reach of your headlamp. For a second its eyes are reflected in the light, and it shrinks away as if from fire. Yes, you can see it, but little does the creature know you are choosing not to care. You refuse to fear something you've decided doesn't exist.\n\n\nGeorge, I—\n\n\nYou watch with indifference as the creature crawls on all fours around the front of the Plymouth, its eyes focused on you. There doesn't seem to be anything you could do now anyway, at least not within the logic of this nightmare. You've discarded your only means of defense, and you're certain you can't outrun a wild predator. But so far your attempts to reimagine yourself someplace better — camping on the shore of Shingle Shanty Lake, a lively little fire before you, and Amy leaning contentedly against your side — have not been successful. This leaves one last possibility: the shock of the creature's attack will jolt you awake.\n\n\n—remember you. I don't—\n\n\nThe creature leaps, and you watch with amazement as it arcs through the air, its claws aimed at your throat.\n\n\n—kill you.\n\n\nTHE END", "action_results": [null]}]}, {"action": "Try and locate Amy.", "result": "You've driven off the creature despite the odds, so it's best not to get greedy and try to accomplish more. Yes, you scored a lucky blow and perhaps inflicted more harm than you realize, but ultimately you're dealing with a wild creature in the dark. Luck can only get you just so far.\n\n\nAnd at any rate, Amy is the real priority here.\n\n\n\"All right, hun. We should be safe for the moment.\" You wonder if she's encountered the creature herself and knows what it is you're both up against. You hope so, because you wouldn't know how to explain what you've just seen with a straight face.\n\n\n\"Amy?\"\n\n\nSilence.\n\n\n\"Amy, it's all right! I think I hit the thing hard in the face. Let me know where you are. OK?\"\n\n\nBut there is no response. A moment ago she was almost speaking non-stop in a way that didn't entirely make sense, and you worried that the chatter might get you both killed. Now the creature is gone, and she has gone silent.\n\n\n\"Honey? Sweetie? Tell me where you are!\"\n\n\nThe last you heard her, her voice hadn't sounded far away at all, even though you couldn't tell which direction it had been coming from. Perhaps she is wounded and has slipped into unconsciousness; perhaps she is lying helplessly in the dark, just yards from where you're standing now. You flick on the headlamp and direct the beam of light in a circle around you, but once again there is no sign of her — not even any good places where she might be hiding. For good measure you broaden your search radius by twenty feet, then twenty more. But you neither find a trace of your girlfriend, nor do you hear her voice anymore.\n\n\nCome to think of it, you only heard Amy when the creature itself had been nearby — as if there was a connection between the two.\n\n\nNothing about this night is adding up, and even though you managed to chase off the creature you still feel defeated. You're still stranded at this remote place without your gear, and you still have no clue where Amy is. You're tired from the long hike, and you never did get to eat dinner. And then all this other nonsense — none of which even remotely resembles the backpacking trip you had planned.\n\n\nSo what now? The night is still very early, and it will be many hours until daylight. Until then your only source of light is this headlamp, powered by a puny little rechargeable battery that has only a few hours of life to it. Most of your food has been spilled on the floor of the cabin and has probably been attracting mice. Your companion is lost as far as you can tell, and on top of everything else there is a creature roaming these woods that according to reason shouldn't even exist.\n\n\nEven Salvador Dalí would be hard pressed to dream up a night more surreal than this, and if the Beatles were here kicking Edgar Allen Poe, you'd eagerly join in. The rational world you've always known and loved needs to reassert order soon, otherwise the first thing you'll do when you get home is sell the rest of your outdoor equipment on eBay.\n\n\nYou sigh, scanning the darkness. Perhaps the best option at the moment is to keep yourself busy by taking a closer look at the damaged packs, seeing what if anything inside is salvageable. And so you turn back toward the old cabin, realizing that your only viable path forward might be a simple faith in the future: things will get better and start to make sense soon, because it's impossible for the situation to get any worse.\n\n\nBut as soon as you cross the clearing and see the cabin again, you see the glow of light through the windows — a small light moving around from room to room, like a headlamp worn by somebody else.\n\n\nAmy?", "action_results": [{"action": "Next page.", "result": "For the first time in a while, the aforementioned \"simple faith in the future\" might be paying off! Who else could that be inside the cabin other than your wayward girlfriend, now with a good story to explain why she's been gone so long? Considering what you've just experienced yourself, you already have a hunch what that story might entail.\n\n\nEager for the reunion, you run through the goldenrod and dogwood toward the bunk room door. The sheet of metal loudly crunches when you step on it, and then you throw open the doors. You can see the headlamp glow down the hall, in the big room with the picnic tables and shredded packs.\n\n\n\"Amy!\" you shout. \"Where have you been?\"\n\n\nBut the person you find examining your backpacks most certainly isn't Amy. You first see her from behind: an older woman, age sixty maybe, short of stature with tightly-curled gray hair.\n\n\n\"Well this explains one of the packs,\" she says upon your arrival. Still kneeling, she looks up toward you, your dueling headlamps now shining in each other's face.\n\n\n\"Who are you? What are you doing here?\"\n\n\nShe stands up from the pile of rice that has been scattered across the floor and steps closer to you. \"Easy now. I could ask you those same questions.\"\n\n\nThe woman in no way seems threatening. Nevertheless, her unexpected presence here, at this place and at this time of day, strikes you as yet another degree of weirdness to a night that is already well beyond explanation.\n\n\n\"So is the plan to stand here all night blinding each other with our lights, or do you mind turning yours off?\" the woman says. She has a point, so you reach up and flick yours off. In return, she adjusts her own headlamp to point up toward the ceiling instead of your eyes.\n\n\n\"I was looking for my girlfriend,\" you say.\n\n\n\"Yuh-huh. And you thought maybe I was her?\"\n\n\n\"We had no idea anyone else was out here.\"\n\n\n\"Why would you think that?\"\n\n\n\"We hadn't seen anyone all day,\" you say. \"And this place looks like it's been abandoned for decades.\"\n\n\n\"Yuh-huh,\" the woman says again, as if doubting something about your story. \"And you came here to… what? Look at the pretty leaves? Enjoy nature?\"\n\n\n\"We were backpacking. This lake was our first stop.\"\n\n\n\"Backpacking,\" the woman says dismissively. She turns back to glance at the remains of your two packs. \"Not anymore you're not.\"\n\n\nYou sigh, wondering if she suspects anything that has happened to you so far. \"No, it hasn't been a good night.\"\n\n\nShe brushes off one of the table benches with her hand and sits down. \"So this girlfriend of yours. What did you say her name was?\"\n\n\n\"Amy.\"\n\n\n\"So was Amy about the same age you are? Young, in reasonably good shape as anyone in this day and age?\"\n\n\n\"Yeah, I suppose…\"\n\n\n\"And whose idea was it to come here — hers or yours?\"\n\n\nYou suspect she is getting at something, but heaven knows what it might be.\n\n\n\"I made the trip plans,\" you say, almost sheepishly. This little woman is making this sound like an interrogation, and by extension you are starting to feel guilty in admitting your role in today's affairs.\n\n\n\"Of course you did. And I suppose someone on Facebook or Instagram told you there was nothing but wilderness bliss here. 'Go to Shingle Shanty Lake! You'll love it!'\"\n\n\n\"Actually, I couldn't find anything online about this place.\"\n\n\nShe raises her eyebrows, as if mildly impressed. \"Well that's something, then.\"\n\n\nIt certainly seems like she knows more about this place than you do, but could she ever understand the weird creature you chased away, or even the voice in your head?\n\n\n\"I'm worried about Amy, though,\" you say, hoping to keep this discussion away from any topics you can't fully explain yourself.\n\n\n\"When did you last see her?\" the gray-haired woman asks.\n\n\n\"Over an hour ago.\"\n\n\n\"Where did she go?\"\n\n\n\"I don't know. She said she had to go pee.\"\n\n\n\"Did she look all right when she left? She wasn't feeling light-headed or dizzy?\"\n\n\n\"No, I don't think so. She didn't say.\"\n\n\n\"Was she acting surly? Growing hair spontaneously, maybe?\"\n\n\n\"What?\"\n\n\nThe woman shakes her head, more to herself than to you. \"Did anything odd happen to her? Strange marks on her body, perhaps?\"\n\n\nYou are about to shake your own head when you realize there had been those two bloody spots on her leg, just before she disappeared.\n\n\n\"There was something, wasn't there?\" she says when you hesitate.\n\n\n\"Yeah, well, it looked like something bit her,\" you admit. \"Like a snake bite, except—\"\n\n\n\"Except the weather's too cold for snakes this time of year.\"\n\n\n\"Right.\"\n\n\n\"Damn. Shit.\"\n\n\nThe woman is obviously perturbed. \"Why? What's wrong?\" you say.\n\n\n\"For her, nothing,\" she says. \"Your Amy has transcended — pure feminine strength, she is now. But damn.\"\n\n\nTranscended? Pure feminine strength? What the hell is she spouting off about?\n\n\nThe woman stands abruptly, reaches for your hand. Because of the whole COVID social distancing thing you reflexively draw away, but she's too quick. \"My name is Evie Daniels. And I've been preparing for this night since I divorced my second husband. But by the sounds of it, your former girlfriend has beat me to it.\"", "action_results": [{"action": "Next page.", "result": "hat a chain of events that has brought you to this!\n\n\n\"You must be still!\" Evie hisses at you, although you weren't aware you had moved or made any sounds. \"This is a special night for them. Don't muck it up!\"\n\n\nShe has you standing out on the camp's open deck, a starlit night surrounding you, the lake before you. It's cold, and considering your experience at Shingle Shanty Lake so far, you feel exposed. But it's all for the promise of finding Amy, Evie said! — as well as for the once-in-a-lifetime chance to behold a wondrous sight, one that few ever see.\n\n\nSo far, your new companion has been reluctant to be more specific.\n\n\nFor her part, Evie is standing just inside the doorway, beside the old Naugahyde chair. \"Amy needs you right now,\" she had said as she steered you out the door, giving you no time to protest or ask questions. \"She has undergone a wondrous transformation, and if you love her you will not withhold one iota of support!\"\n\n\n\"Wondrous transformation?\" you said, hesitant to just stand outside passively, waiting and watching for something to happen — not when you already know what's in these woods.\n\n\n\"Yes. One that should've been mine, but we don't hold grudges, do we?\"\n\n\nHer words were sweet on the surface, but her eyes failed to conceal her steely resolve. What she was saying and what she wanted weren't necessarily the same thing — and you had become a mere prop, a means to some yet-unknown end.\n\n\nYou didn't want to be a prop; you wanted answers. And as you resisted being shoved out the door, your eyes found the charcoal inscription on the kitchen wall again. \"What is a 'Thilykotherium'?\" you asked her.\n\n\n\"Something beautiful! She's feral, she's fierce. You should be happy Amy has found this release! Now she will always be free, running with her sisters!\"\n\n\nThere was little question in your mind that Evie was a lunatic, but even this crazy explanation, such as it was, fit the facts as you knew them:\n\n\nThilykotherium was the name of that creature you fought off with the rake — and it was also the transformed body of your girlfriend. Bizarre, yes, but somehow truthful. You remember the sound of her voice when the creature was present, and the way it seemed to go silent when the creature ran off. I am no longer in control, she had tried to warn you over and over. Now you are starting to understand what she meant.\n\n\nSo here you are, standing in the night air, waiting for something to happen. For Amy to return in her new body, perhaps? And then what? Your last encounter didn't exactly go well for either of you.\n\n\nBut whereas before it felt like you had waited hours for Amy to return, events seem to be happening at a quicker pace now. It begins when you hear a familiar shriek somewhere down by the foot of the lake, the same noise that raised your hairs when you heard it up close not long ago.\n\n\nThen there is a second call — then a third, then a fourth, all from different points. There's an entire pack of Thilykotherium!\n\n\n\"Isn't that the most beautiful sound?\" Evie says softly from the doorway.\n\n\n\"How many of them are there?\" you ask her, but your voice is like a provocation to her.\n\n\n\"Ssssh! I told you, you must be still!\" You realize she is blocking the door, prepared to prevent you from reentering. But why? Are you to be tonight's sacrificial offering?\n\n\nThe shrieks continue, and without being able to see a single creature you can tell the individuals are coming together, meeting each other for the first time tonight.\n\n\n\"Listen!\" Evie says. \"They are greeting their new sister! Every fall a new woman makes the transformation, and they go on their first hunt together. I had hoped it would be me this year, but I guess it wasn't meant to be!\"\n\n\nThe reverence in her voice is obvious, as if she were narrating a nature show on TV.\n\n\n\"How many of them are there?\" you ask, realizing right away her response will be predictable.\n\n\n\"Just! Be! Quiet!\" The words are whispered, but they bear the weight of a shouted reproach.\n\n\nThe Thilykotherium calls go silent, and for a moment you lose track of the pack. But then you hear the rustling in the woods, getting closer.\n\n\n\"Now just stay there!\" Evie orders. You turn to address her, but she's slamming the door shut. There is no lock, but you can hear the recliner moving into position behind it.\n\n\nSo, yes, it looks like she intends to use you as Thilykotherium bait — and if the rest of the pack are like the one creature you saw, then you don't stand much of a chance.\n\n\nBut is one of them really Amy? If so, you were communicating with her before, although at the time you hadn't understood what she was saying. Now that you have a better idea, there may be a way to appeal to her humanity — as well as to those of her \"sisters.\"", "action_results": [{"action": "Stay and try to appeal to Amy's humanity.", "result": "Who needs Evie Daniels, anyway? She's just a kook appearing out of nowhere in the middle of the night with a weird agenda. Your real concern is Amy, and trying to make a connection with her. And to do that, it will be best to be direct.\n\n\nAnd so you wait alone on the ratty boards of the old deck, which sag slightly under your weight. As the rustling sounds draw nearer, you feel suddenly exposed — your hands are empty, having left the rake somewhere behind you in your travels. If you need to defend yourself in whatever is about to happen, you'll have nothing but your own body to work with. On the other hand, perhaps it's for the best to not be armed — and you can only hope that Amy isn't holding a grudge for striking her in the jaw.\n\n\nIndeed, the Thilykotherium pack seems to be approaching the cabin. You look in the windows, but Evie has her headlamp off and is remaining silent. Your headlamp is still strapped to your forehead, and in a bit of nervousness you reach up and turn it on.\n\n\nNine pairs of eyes reflect the beam of light back at you.\n\n\nThat is him? The man you came here with?\n\n\nHe looks scared.\n\n\nFrightened.\n\n\nNot so tough without his tool!\n\n\nIt's an entire chorus of female voices invading your thoughts, although none sound familiar. The she-beasts are at the edge of the clearing that surrounds the cabin, having just emerged from the woods, and they are approaching you as a unit. Which is the one that used to be Amy? The light is not strong enough to fight back all the shadows, and the creatures look too much alike.\n\n\nWhat is he doing just standing there?\n\n\nHe can't be too bright.\n\n\nWe'll be doing you a favor, sweetheart.\n\n\nNot one of them is speaking with their mouths; instead, you hear their words in your thoughts, each a distinctive voice. But so far, not one sounds like your girlfriend.\n\n\nShe must be here, though.\n\n\nThe Thilykotherium form a circle around the deck, their fangs and claws reflecting the silvery starlight. All nine of them look at you with great anticipation, filling the air with hungry growls.\n\n\n\"Amy?\" you say cautiously, trying to identify the one you used to know.\n\n\nGeorge.\n\n\nThat's it! That's her voice. But all of the creatures are behaving in the same feral manner, digging their claws into rotting wood.\n\n\n\"Amy, where are you? Which one is you?\"\n\n\nI'm here, George.\n\n\n\"I— I know that, sweetie. But I can't tell you apart.\"\n\n\nSee how weak he is? Take his tool away, and a man is nothing.\n\n\nNot much meat on him, though.\n\n\nEnough for tonight. We can take a moose tomorrow.\n\n\nSpeak for yourself! I came five miles to get here tonight, and I'm hungry!\n\n\nOur new sister should of course be the one to make the kill.\n\n\nAnd enjoy the biggest share.\n\n\nAgain, you're hearing the voices of the other eight, and the meaning of their words isn't lost on you.\n\n\n\"Amy, what is going on here? You're not like this! Just come back with me, just come back and we'll get you some help.\"\n\n\nHelp! What does the male think he's going to do?\n\n\nYou're better off with us, girl.\n\n\nDon't let him suffer like this! Best to get it over with quickly.\n\n\nTalking to him will only give him hope.\n\n\nOne of the creatures hops up onto the deck with you.\n\n\nGeorge. Everything is fine now.\n\n\nThe creature takes a step closer, backing you toward the wall. \"Amy, is that you? Come on, this is creeping me out. Let's get out of here. None of this is natural!\"\n\n\nNot natural! What does he know what 'natural' is?\n\n\nYou are who were meant to be, sister! There is nothing more natural than that!\n\n\nGeorge. I am fine. This is where I'm meant to be.\n\n\nYour back is stopped by the wall, and you're sure you can hear Evie Daniels adjusting her position behind a window, watching these proceedings with great interest.\n\n\n\"Fine? How is this fine? Look at yourself! Look at what you're doing! None of this is fine!\"\n\n\nHe's never going to understand.\n\n\nHe feels threatened by your strength!\n\n\nJust hurry up, will you? I'm hungry!\n\n\n\"Amy, no, please — we need to talk!\"\n\n\nBut instead she crouches, claws bared. George, I will remember you.\n\n\nThen she leaps across the remaining distance between you, her new lethal body prepared to make its first kill.\n\n\nTHE END", "action_results": [null]}, {"action": "Force your way inside the cabin.", "result": "\"No, you aren't going to leave me out here like that goat in Jurassic Park!\" you shout at the closed door. You throw your body against it, but Evie already has the recliner nudged up against the other side.\n\n\n\"What are you doing?\" she shouts, her voice muffled slightly by the door. \"They're going to want to feed, and it sure as hell ain't going to be me!\"\n\n\nThey're going to want to feed? Once more you slam your shoulder against the door, but the blow hurts you more than it does anything else. So you try kicking it instead; the door does budge a couple inches, but Evie is right there to slide the chair back into position.\n\n\nThere are other doors leading into this camp, of course, but they are both on the other sides of the building. With the Thilykotherium pack approaching, you don't have the luxury of time to go seek them out, even though Evie can't possibly be barricading all three entrances. On the other hand, there is a window beside this door, and with one good kick you send the glass shattering across the mossy floor.\n\n\n\"What? No! You can't come in here!\" Evie seems manic as she tries to push you back out the window. Despite her outsized personality she's not that big physically, and in the end you have the stronger motivation to seek whatever shelter you can find.\n\n\nIn the effort to push past her, though, you tumble through the broken window and roll onto the floor, broken glass crunching underneath your shoulder blades. Some shards had been left attached in the window frame, and you had felt them catching on your clothes. Now is not the time to stop and check how badly you've been cut, however.\n\n\nEvie is already trying to pull you up by the arm. \"You're not staying in here!\" she says, grunting with the effort.\n\n\nWith one good tug you pull your arm away. \"What the hell are you doing?\"\n\n\n\"The sisters are here to hunt! Oh, you wouldn't understand. I came here because I wanted to join them, but you and your girlfriend got here first! And they only take one new sister every six years, so now I'm just as likely to be on the menu as you are!\"\n\n\nShe is livid, but also genuinely frightened. Not to mention off her rocker.\n\n\nYou're about to ask another question when you hear the sound of footsteps outside. The pack is surrounding the cabin.\n\n\nYou were right, sister. There is prey inside this place!\n\n\nNot one, though, but two!\n\n\nIt will be a joyous feast!\n\n\nThese are distinct voices that you're hearing, all female — and like Amy's voice earlier, not one seems to be traveling across the air. Your skull is like an organic radio receiver, their words sounding directly within your thoughts.\n\n\n\"See! See what you've done!\" Evie hisses at you, her foot spazzing out at you in a futile kick.\n\n\nGeorge was here alone when I left. I do not know who this other person his.\n\n\nAmy's voice! But this time she's not talking to you.\n\n\nIt doesn't matter, sister. Two is better than one!\n\n\nYou will be better off without him anyway!\n\n\nEvie jumps to her feet and sticks her head outside the window. \"Take the man!\" she shouts into the night. \"He's bigger and has more meat!\"\n\n\nWow, this one is pretty wild!\n\n\nI always like it when they make a fuss.\n\n\n\"It was supposed to be me joining you tonight!\" Evie tells the she-beasts. \"Men have ruined my life, and so I came here hoping I'd be chosen as your new sister! I should be one of you, so please take him!\"\n\n\nThe deck boards creak as something hop up on top of it — several somethings, actually.\n\n\nThat's all right, sister. You can still be with us!\n\n\nYessss! We would love to have you for dinner!\n\n\nIt occurs to you that Evie might be inadvertently doing you a favor: instead of convincing the she-beasts to go after you, she has made herself the easier target. Quietly you back across the floor crab-style, trying to remain low and unseen. It's not until you back into one of the naked wall studs that you rise to your feet. Evie screams as the creatures pull her through the window. You hesitate for a second, wondering if you should intervene on her behalf, but the sound of tearing flesh stops you; Evie's cries are cut off abruptly, and you realize there is nothing left to save.\n\n\nExcept yourself.", "action_results": [{"action": "Next page.", "result": "An hour later and you are hiding behind a giant boulder, maybe half a mile from the cabin. You'd have gone farther, but it's night and your headlamp can only reveal so much; go too far in the wrong direction, and you might not find your way back, even in tomorrow's daylight.\n\n\nThe screams Evie made have been haunting you ever since, but the worst part was the way they stopped so abruptly at the moment of her death — the same creatures she had wanted to join, and which she admired for their strength and freedom, had taken her down like foxes to a rabbit. And this is what allowed you to escape; you didn't fight off the creatures, you didn't defeat them with your cunning and strength. In fact, something tells you those tactics would've failed miserably.\n\n\nNo, you got away when the predators were busy culling your herd, so to speak.\n\n\nBut now you are out here alone, cold and frightened — the rabbit who got away, knowing you're not safe yet while the predators are still on the hunt. You have nothing except the clothes you were wearing when you first arrived, as well as the headlamp strapped to your forehead. Nor do you have any further strategies or plans, beyond surviving until daylight so you can get the hell out of here.\n\n\nGeorge.\n\n\nYou nearly jump — you never heard her coming!\n\n\nI know you're there, George, behind the rock. I can smell your fear.\n\n\nOh crap, are they all here? This is it — you're screwed!\n\n\nDon't speak, George. I'm not here to stay.\n\n\n\"Amy?\" you start to say, but she cuts you off. Don't speak! I am in control now. This is where I need to be. I am protecting you, George, but just this once.\n\n\n\"Amy?\" you say again, despite yourself.\n\n\nGood-bye. Go, and never return to this place. I am in control now.\n\n\nAnd then you hear her footsteps on the other side of the boulder, fading into the night. Her departure leaves you alone like you have never been before, a helpless babe lost deep in the woods, waiting desperately for morning so that your nightmares may finally come to an end.\n\n\nTHE END", "action_results": [null]}]}]}]}]}]}, {"action": "Try and locate Amy. She's the priority.", "result": "\"Please explain,\" you say to Amy-who-could-be-anywhere-and-everywhere. The vulnerability in her voice is highly out of character, so something horrible must've happened. Given what you just saw, you can only imagine.\n\n\nGeorge…\n\n\n\"You've had me worried, you've been gone so long. How do you need me to help? What do you need me to do?\"\n\n\nGeorge… I do not have control anymore.\n\n\nWhat the hell is that supposed to mean? \"Can you say that again? I'm having trouble pinning down the direction of your voice.\"\n\n\nGeorge, I think you're in danger. It knows where you are. I've lost all control.\n\n\nThere is an eerie, disembodied quality to her voice that you can't pin down. It absolutely sounds like Amy, although these cryptic statements are not the usual way she speaks. Something is clearly upsetting her, and it's frustrating not being able to do something so basic as locate her. This entire time, you have been pirouetting like a nervous ballerino at the same point where you stopped your pursuit of the creature. In the process, your boots have scraped a small circular patch of ground free of leaves.\n\n\n\"Amy, sweetheart, you—\"\n\n\nYou need to get out of here. I'm going to kill you. I do not have control. It knows where you are.\n\n\nThere is an emotional flatness to the way she is delivering these words that almost causes you to miss their meaning, compounded by the fact that each individual phrase seems to be going in its own direction. But the part about I'm going to kill you certainly seems concerning.\n\n\n\"If I can help, please—\"\n\n\nGeorge, the disembodied Amy voice says, you need to go. I don't want to kill you. It knows where you are. I do not have control.\n\n\nWhile the particulars of these cryptic statements seem mysterious, the basic gist is clear: she knows about the creature somehow, including its location and motives.\n\n\nYou adjust your grip on the rake handle. \"I'm not going anywhere without you, hun. Just come out where I can see you.\"\n\n\nI do not have control, George. I will remember you. Don't want to kill—\n\n\nWhat emerges from the shadows, of course, is not your girlfriend. It is the creature you had chased away, although with its gracile body frame one could be forgiven for briefly confusing the two.\n\n\nGeorge, I—\n\n\nThe creature lunges at you like a cat, claws up so that they can be brought down with great, deadly force. You bring the garden rake up to deflect its arc, but the metal head splits off uselessly from the handle, leaving you with only the shaft.\n\n\n—remember you. I don't—\n\n\nThe creature's attack is swift and effective. You are cut down before Amy can complete her sentence.\n\n\nTHE END", "action_results": [null]}]}]}, {"action": "There's no time — follow the intruder!", "result": "Do you really think you're going to Schwarzenegger your way out of this situation with a garden rake? You haven't the slightest clue who it is you're chasing, and of course you still can't rule out the possibility this is Amy. After all, she is the only other person you happen to know who is in this same proximity.\n\n\nAnd at any rate, time is limited. Forgetting the rake, you steel yourself for an encounter with whatever it is you hear outside. The door is slowly swinging closed in a draft of air, so you kick it open, the headlamp still off. You step carefully onto the back steps, your aching tailbone still a fresh reminder of how this went wrong last time. These steps are larger, though, and more solidly built; despite the rain, the risers are less slick.\n\n\nYou almost don't see the figure, at least not until it steps out of a shadow. And even then, in the gray twilight it is little more than a silhouette. It looks like a person, not a bear: upright and willowy, wading through the browning goldenrod.\n\n\n\"Amy?\" you say, giving voice to your first suspicion. Indeed, there is a resemblance between the shadow before you and the memory of your girlfriend, and while her behavior has been inexplicable it makes sense it is her you see now.\n\n\nBut as the figure turns, you see its body is covered with fur, not clothing. What you can see of the eyes are all black, the face feline. A feral anger fills its features, and it looses a howl that haunts the forest with a predatory noise. Its wrath, of course, is directed at you.\n\n\nReflexes take over. With an unknown threat just yards away, your response is to run. But where? The steps are surrounded by a tangle of untended weeds, and the creature stands along the most obvious path. So without time to think you back toward the stoop, tripping over the very first step. Your adversary recognizes this moment of vulnerability and leaps in a cat-like pounce; panicked, you scramble in a reverse crab-crawl back toward the door of the cabin. The creature misses you by inches.\n\n\nThe cabin is all you have for protection, and boy do you wish you had that rake now! Barely balanced on your feet, you step inside the kitchen and try to close the door against your foe. But the barrier swings inside, and the creature pushes hard against it. There is no lock, and nothing within reach that would hold it shut permanently; unless you hold the door closed all night long with your body, this unknown hunter will get in.\n\n\nYou reach for the rake handle with one free hand, but the steel teeth are embedded too deeply into the sheetrock. THILYKOTHERIUM, you read again; perhaps you have a hunch now what the name means. The rake isn't ready to release its grip on the wall, and you don't have the option of stepping away from the door to throw your body into the effort like the child Arthur releasing his sword from a stone. If this door opens, you better be running!\n\n\nAs you do your best to keep the creature out, certain elements of the evening start to make more sense: Amy's disappearance, the footsteps outside the bunk room, the two shredded packs. These aren't exactly solid answers: you don't know what happened to Amy, and you have no idea what exactly it is pawing at the other side of this door right now. But clearly there is a link between these two circumstances, and you have no doubts about the murderous intent of whatever it is that's now trying to get in.\n\n\nForcing your body against the door all night long isn't going to be an option, so you need to come up with a Plan B quickly, while you still have the energy to act. As soon as you step away from the door this creature will be inside the cabin. The rake isn't going to be a help, at least not in the amount of time that will be available to you, and you can't think of any other object that might have any potential lethal uses. So that leaves only one course of action:\n\n\nRun.\n\n\nYou give yourself a count of ten. By \"three\" you're already having doubts, but by the same token you know you can't hold out against the creature's intensifying thrusts, either. So when the count runs out, you take a deep breath and flee from the kitchen.\n\n\nThe door bursts open behind you, and you realize you have a lead of mere seconds. Where exactly can you go? There are no hiding places in this cabin, not where half the walls are missing. Your only instinct is to run in the direction from which you've come, hoping that your speed holds out and that the creature pursuing you can be outsmarted.\n\n\nAnd so you spin around the wall of studs and down the short hall to the bunk room. You throw open the storm door and leap over the treacherous steps and the sheet of rusted metal, running toward the overgrown driveway like your life depends on it — because to the best of your knowledge, it really does.\n\n\nThe banging of aluminum and glass behind you tells you the creature is not far behind.", "action_results": [{"action": "Run!", "result": "an such creatures exist? Or more importantly, should they exist? You want to assume that you have gone crazy, that you are running and hiding from your own overactive imagination. But your senses say differently, that the bizarre thing from which you fled was very real indeed. And its single-minded pursuit of you is proof of its murderous intent.\n\n\nYou've always prided yourself on the idea that you are a rational person, tending to go where the evidence leads you — and in your experience, the evidence never tended to go toward Sasquatch and / or Mork. All those grown men clamoring to get their own cable TV shows, self-described experts of the unexplained, clinging to the narrow claim of legitimacy granted to them by the axiom that absence of proof isn't proof of absence. The failure to find what they seek by the end of each episode is employed to build suspense and anticipation for next week's show. Their life's work supported by the ten million gullible suckers willing to tune in every Tuesday, and all the ad revenue that generates.\n\n\nNot you, though. To you, it's hard to see the difference between that and the so-called sport of \"professional wrestling.\" It's all orchestrated B.S., dumbshows put on to entertain the groundlings.\n\n\nBut man, what you wouldn't give to have Randy Savage here with you right now.\n\n\nYou really don't know how you managed to get away. That creature was big, and you assumed based on its feline attributes that it would also be fast. Rather than staying and sizing it up, you ran as fast as you could — toward the overgrown driveway, since that was the only way in and out of this place with which you were familiar. It's possible you just got lucky: at one moment, when you were certain that… thing was close enough to do whatever it was planning to do, you thought you heard a soft yelp followed by the sound of a collapsing body. Perhaps it tripped over something in the dark that you somehow missed, and if so, then it is by dumb luck alone that you are hiding here now.\n\n\nWhen you realized you had gained an accidental advantage, you veered off the driveway and into the deep woods. Surrounded by shadows as the twilight faded into the starlit darkness of night, the best you could do was grope your way through the trees. With the thick leaf litter from this fall's crop of fallen foliage, there was no way to run quietly; every step sounded like a cat playing with a paper bag. You might just as well be shouting out your location on a megaphone.\n\n\nTherefore when you stumbled across this giant boulder, you decided to make this your hiding spot.\n\n\nBut holy cripes, what was that thing?\n\n\nThe cat-like creature you briefly glimpsed seemed like it had been compiled from a variety of vaguely familiar sources, reassembled into something straight out of a B-movie. And if this is some old Saturday matinee feature you've been transported into, then what does that make you? Are the robots of Mystery Science Theater 3000 heckling you at this very moment? You hope they're getting a bigger laugh out of all this than you are.\n\n\nGeorge.\n\n\n\"Who said that?\" Your response was involuntary, but the sound of someone calling your name seemed to come from nowhere.\n\n\nGeorge, where am I?\n\n\n\"Amy, is that you?\" you look around, but you don't see a thing. You certainly don't see Amy, although it certainly sounds like her voice.\n\n\nI feel strange, George.\n\n\nYou don't respond; it seems distinctly unsafe to be carrying on a conversation out loud with someone you can't even see, especially after what you've just seen.\n\n\nGeorge, where are you? I've lost control. I don't know what I'm doing. I need help. Please, George.\n\n\nYou look around from the cover of your rock, but see no one. \"I can't see you,\" you whisper. \"Where are you?\"\n\n\nI'm looking for you.\n\n\nThere is something very off about Amy's voice. Specifically, it doesn't seem to be coming from anywhere; wherever you turn your head, that seems to be the origin of her calls for help.\n\n\nOn the other hand, it's been so long since she's asked for your help with anything, you feel obligated to respond now.\n\n\nShe said she's looking for you… and obviously she's close enough that you can hear each other. You decide it's worth the risk to stand all the way up, to peer over this rock rather and peep around the sides. And when you do, you hear the sound of footsteps slowly approaching, like from someone who might be seeking you out. If by some miracle she doesn't comprehend the menace with which you are sharing the woods tonight, then you need to convince her of the need to hide quickly.\n\n\n\"I can hear you coming. Just follow the sound of my voice.\" You don't dare step too far away from this rock, so you hope she finds you soon.\n\n\nIt's looking for you too, George.\n\n\nSo, she does know. \"I have a good hiding spot. Now please just hurry! Follow the sound of my voice! I'm right here!\"\n\n\nGeorge, no, you don't understand. I've lost—\n\n\nAt that moment she steps into view. Except that when you hear the shriek — the bloody, murderous call of the creature you saw near the cabin — you realize the magnitude of your mistake.\n\n\nIt's not me, Amy says. I don't want to be doing this. But I cannot stop it.\n\n\nThose are her words, spoken in an approximation of her voice, but you are aware of no other presence besides yourself and that creature. You try to run, but by this time it's much too late. The thing that hunts you goofed once, and you got away. It has now gathered its primal wits about it and refuses to make that mistake twice, you can tell. You back up easily, thinking that turning and running would be fatal. The creature, however, matches you step for step.\n\n\nAnd then you back into the rock, coming to an unexpected halt.\n\n\nGeorge, I'm sorry. I didn't mean to betray you.\n\n\nYou still have no idea where her words are coming from, and you don't have the time to find out. When the creature realizes it has you pinned against the rock, it makes its lunge.\n\n\nTHE END", "action_results": [null]}]}]}, {"action": "Continue looking outside.", "result": "You've only come around one corner of the cabin so far, barely covering all of the possible hiding places where Amy might be waiting for you. Stepping around the weathered deck, you freeze at the sound of broken glass beneath your boot.\n\n\nConsidering your luck so far, you shudder at the thought of what new injury you might've inflicted upon yourself now. Still, you turn the headlamp beam downward to your right boot, seeing the shards of an old Labatt Blue bottle beneath it. Possibly, it was already broken and you just stepped on the pieces. At least no new blasts of pain shoot up from your feet.\n\n\nStill, this place is starting to seem like a mine field of bodily harm. Whatever sense of discovery and adventure you felt an hour ago is now evaporating with the dwindling daylight.\n\n\n\"Amy!\" you shout again, the patience draining from your voice. \"This is bullshit!\"\n\n\nBeyond the deck, the cabin wall turns a corner. You are beneath the picture window now, where the knoll underneath the structure begins to slope steeply down to the lake. It doesn't surprise you that your girlfriend isn't here; there is not really much \"here\" for anyone to be, including you.\n\n\nThe old hunting camp doesn't have a foundation. Instead, it is raised off the ground on a set of stubby concrete posts, like acrophobic stilts. They create a crawlspace a few feet high, a maw of darkness within arm's reach to your left. Any number of things could be lurking there, including…\n\n\nIn a quick and unpremeditated motion, you stoop and turn your head toward the crawlspace, aiming the beam of light accordingly. You have mixed thoughts on what you might find there; it would be an excellent hiding place for someone trying to spook you, but how bizarre it would be to find your girlfriend crawling on her belly in this dirty place.\n\n\nWhat you see, though, neither relieves you nor answers any questions. There is nothing under the cabin of any consequence, just more junk: forgotten lumber, random beer bottles, discarded pints of motor oil. Nothing moves, and no eyes reflect back at you. It was worth looking, but it's like this place is rebuking your efforts to seek easy answers. You ask it to reveal Amy; \"Go fish!\" is the taunting response.\n\n\nBut as you stand back up, your light catches another detail that you almost missed.\n\n\nLike the other sides of the abandoned camp, this one is sided with lumber. It had all once been painted a deep shade of red, but the pigment has worn thin over the years.\n\n\nNevertheless, someone has scratched a single word into the paint — the same cryptic statement over and over again:\n\n\nTHILYKOTHERIUM\n\n\nTHILYKOTHERIUM\n\n\nTHILYKOTHERIUM\n\n\nTHILYKOTHERIUM\n\n\nTHILYKOTHERIUM\n\n\nIt's been etched into the side of the cabin at least a dozen times, as if with the tip of a knife blade.\n\n\nWhat the hell is Thilykotherium? Maybe a genus of some kind of rare moss? No, the word seems to bear more import than that. What that could be, though, is beyond your comprehension; you haven't the foggiest clue what \"thilykotherium\" means.\n\n\nAnother corner of the cabin looms just ahead of you. According to your mental map of the place, a door leading into the kitchen is what you'll find next, after making this turn. This will be the first door you spotted earlier, when you and Amy arrived at the end of your ten-mile hike from Deep Creek, hoping to find a scenic campsite but stumbling across so much more. By proceeding, you will be coming upon the door next to the square-blocked chimney, surrounded by the knot of goldenrod and dogwood. And in the process, you know you'll get soaked wading through all that vegetation.\n\n\nCautiously, you turn the corner. There's the door, fronted by a wooden stoop that looks a bit more solid than either the deck or the bunk room steps upon which you fell. It is all more or less just as you expected. The rain is now just a faint drizzle, and little is left of the day's gray light, but otherwise, as before, there is no Amy.\n\n\nYou take a step forward, but then freeze. The door is opening.\n\n\nOut steps a dark figure, willowy and silent. Your first thought is that this is Amy, of course. Not only does the silhouette bear an uncanny resemblance to your girlfriend, who else could it be?\n\n\n\"Amy, what the hell have you been doing?\" you say, eager to get answers.\n\n\nBut the figure on the stoop doesn't speak. It turns to face you, stepping involuntarily into the glow of your headlamp.\n\n\nAmy, this is not.\n\n\nWhat the pale beam of light exposes is a creature of brown fur, upright like a human but feline in appearance. Wet claws glisten in the light cast by your headlamp, and the eyes reflect nothing but blackness. You've startled the creature, and it doesn't seem pleased. Its lips raise to reveal a pair of lethal fangs.\n\n\nWhat the hell, indeed!\n\n\nThe feral figure roars from the stoop, blocked only by the railing. The sound fills the darkening woods, more chilling than you imagine a pack of wolves might sound. Then the creature scrambles to leap over the wood railing standing in its way, a predator about to pounce on its prey.\n\n\nWhat else can you do but run? And where else is there to go but back in the direction from which you came? The steep bank below you leads only to water, and you know so little about these woods that the only escape route that occurs to you is the driveway leading back to the hiking trail. You care not about the beer bottles in your way as you dash back around the old deck, and you leap across the tangled cable that tripped you a few minutes ago. There's the bunk room door, but what's the point in seeking shelter inside the cabin? This strange creature clearly knows how to open doors, and besides, you've already figured out there is no place to hide inside a building with smashed innards.\n\n\nYou can hear the creature behind you, running fast. The best you can do now is hope that your speed holds out and that the creature pursuing you can be outsmarted.", "action_results": [null]}]}, {"action": "Look in the woods.", "result": "You step across the stranded sheet of old roofing, and then wade through a rain-soaked tangle of dead goldenrod standing in your path; a month ago this stuff would've been flame-tipped with late-summer blossoms, but now the leaves have browned under autumn's death-touch, and fuzzy seeds await dispersal from the same places where the flower-spikes had been — hope for a new season, many months away. And as wet foliage is wont to do, the stalks of goldenrod impart a generous share of moisture onto your pants as you pass through them.\n\n\nNot that you expected to keep dry on a night like this. After emerging from the weeds, a patch of more barren ground stands between you and the woods. Off to your left is a long shed, sided with aluminum but open-fronted like a lean-to; presumably that was once a woodshed, but the structure stands empty now.\n\n\n\"Amy?\" you call out again. \"If you can hear me, let me know where you are!\"\n\n\nThere is no response, and by this time you are no longer expecting one. This is a highly bizarre situation, so expecting a rational resolution now seems unrealistic. It reminds you of the time your friend's dog ran off once in the middle of the woods, chasing after some scent when neither of you had been paying attention; as your friend called out the dog's name over and over again, you silently thought that maybe the missing pet had been nearby chomping on a bone, blissfully unaware of the stress she was causing. Or maybe she had run miles in the wrong direction, and couldn't hear him anyway. There was no possible way of knowing, and speculating on the outcome hardly seemed helpful at the time.\n\n\nStill, the nature of your current problem seems unfathomable. Amy is not some overeager pit bull chasing a squirrel, indulging a thoughtless whim. Wherever she is, and whyever she is there, a rational process had to occur between the moment she stepped out of the cabin and… and whatever the hell is going on now.\n\n\n\"A-a-a-a-my!\" you call out, realizing after the fact that you are now sounding like your friend did that day of the missing dog.\n\n\nThe bare spot gives way to the woods in an abrupt transition, marked only by a low pile of scrap metal. A bank slopes downward at the same point where the trees begin, all of it already dark. You flick on the headlamp strapped around your forehead, aiming a beam of light into the woods. The light is bright, but small in origin; the beam penetrates just so far.\n\n\nThere is no sign of Amy, at least not in the limited reach of the light. And you can confirm now that the sound you heard really is the lake somewhere below, lapping against its shoreline. But it's not an empty wilderness into which you're peering: something light-colored is dangling from a branch about forty or fifty feet away.\n\n\nHowever, to accomplish the, umm, task that Amy claimed she needed to do, she would've taken the easiest route. And now that you're standing on the edge of the bank, it seems odd that she would've gone all the way down there. Maybe she did what you're doing now and scoped out an option, only to rule it out. Looking around a second time, there seems to be a better spot up here on top of this bank, just behind the lean-to woodshed.\n\n\nOf course, all of this is little better than a working hypothesis, since you have nothing but hunches to follow.", "action_results": [{"action": "Take a closer look at the object down the bank.", "result": "There are so many stray objects surrounding this cabin — structural artifacts that once served a purpose, but which have since been severed from their original context and left to decay — that the odds seem high this object in the tree is nothing relevant. Still, a potential clue is a potential clue, and the sad fact is Amy has disappeared on you without leaving you much to work with.\n\n\nTo enter the woods, though, you first need to cross the scrap metal. It is not a big pile, just a scattering of junk left at the edge of the woods. Unlike most of the other junk you've seen so far today, which was peeled off the cabin by forces of nature and left where it happened to fall, this is a collection of stuff that had been left here intentionally: discarded roofing panels, a curlicued strip of banding, other things obscured by a layer of wet, fallen leaves. Were it not for your recent experience on the steps, from which your tailbone still smarts and your hand still burns, you might step across this stuff without much concern.\n\n\nWhen the ground ceases to crunch, leaving only the soft feel of duff underneath your boots, you walk a little easier. And as you get closer to your destination, the object before you comes into better focus.\n\n\nIt's a plastic grocery bag, left dangling from a balsam twig. And when you get close enough to see the details, you recognize it beyond all doubt:\n\n\nAmy's toiletry bag.\n\n\nIt may just be a bag of toilet paper and sanitizer, but it's the most tangible evidence you've seen so far. She was here, and you're following the right instincts! But where is she now?\n\n\nBy turning your head about, the headlamp beam illuminates the surrounding patch of ground. And what you find is chilling: shredded rags of nylon and polyester, all in the pastel colors that Amy had been wearing. You pick up a sleeve of what had been her rain jacket, purple and ragged. The bits of pink strewn all about matches the color of the long-sleeved shirt she had been wearing.\n\n\nBut Amy herself? You examine the scattered rags more closely, tamping back a building wave of panic, terrified at what you might find. You fall to your knees, groping at the ground. The ground is wet and muddy, and your fingers become speckled with dirt and dead balsam needles, but there is no—\n\n\nWell, let's not dwell on what you're not finding. The important thing is that you found the place where your girlfriend had been, but she's not here now. The shredded clothing — and shredded does seem to be the most accurate descriptor — tells you as much about what happened as if you had found the molted feathers of a blue jay, or the discarded skin of a snake. You at least now know she was here a short time ago, but you can only theorize the type of violence that clearly must've occurred.\n\n\nViolence. Thinking the word changes the entire experience. Until now Amy was merely missing, perhaps just playing some prank; eventually the game would end and your weekend adventure could continue. But now, this. She had come out here alone, and something had attacked.\n\n\nOr someone.\n\n\nOn impulse you spin around, shining the headlamp beam in almost a full circle, scanning your surroundings. The implication of this discovery is the realization you are not alone!\n\n\nAs before, you see nothing definitive. Still, you have all the evidence you need to know you are in danger — you just don't know the nature of that danger. Part of you wants to see what else you can find here, but your sense of self-preservation is screaming at you: Get back inside that damn cabin!", "action_results": [{"action": "Explore.", "result": "Something is disastrously wrong here, way beyond the range of ways a hiking trip might go amiss. Every week you read the ranger reports, the brief write-ups highlighting the various ways people typically get hurt and require assistance when visiting the Adirondack wilderness. In almost every case the victim is easily located, and the problem is satisfactorily resolved; occasionally the search becomes a recovery, in which a body is discovered under grim circumstances and hauled out of a rugged environment. But never is the story abruptly abandoned at the discovery of some torn clothing, because the forest rangers are too afraid to continue looking.\n\n\nSo… Amy was here, until something happened. But what? And where is she now? All day long you had been convinced the two of you had hiked into a region where no one else has been in a long time. The trail that led you here appeared less and less used the longer you hiked, until you reached the final five miles and became convinced no one else had been here in at least a year. Then you stumbled across the abandoned driveway leading to the abandoned hunting camp, suggesting a human history to this place you had not previously contemplated.\n\n\nWhen you had planned this trip, grasping at whatever information you could find online, no one had anything to say about Shingle Shanty Lake. It was like a black hole of internet knowledge: no facts, no insights, no AllTrails reviews had escaped the gravitational pull of secrecy. There could only be two reasons, of course: either no one had been here, which seemed unlikely; or Shingle Shanty was a place of exceptional solitude and beauty, a gem the locals refused to share. Like a naive fool you assumed the latter scenario, never once dreaming there may be a third option:\n\n\nPerhaps no one who's visited this place has survived to share the knowledge.\n\n\nThis thought puts you on alert. Amy didn't just rip her own clothing into shreds and run off into the woods naked. Someone had overpowered her, taking her against her will.\n\n\nYou are not alone. From this point forward, you must keep quiet. Somewhere in this growing darkness some creep already knows you're here — has been tracking you ever since the two of you first approached this remote place. You had assumed Shingle Shanty was secretive and inaccessible; the presence of the driveway should've tipped you off to the fact there is another way to get here.\n\n\nPerhaps it would be better to turn off your headlamp, but the twilight is fading fast and soon you won't be able to see at all. The light may be telegraphing your presence to your unknown assailant, but without it you won't be able to find what happened to Amy.\n\n\nSo, what does the evidence tell you? Besides the plastic bag and shredded clothing, there must be signs of a struggle. If some creep-o jumped her and dragged her away to his lair, you should see where they went. Frantically you pass the beam of light back and forth across the forest floor, puzzled why the ground isn't disturbed more than it is. At best, all you can see is a slight trail of scuffed-up leaves. It's not enough to suggest someone was dragged away against their will, but it's the clearest sign of someone's presence other than the pieces of fabric.\n\n\nWith little else to go on, you follow the faint track. The alternating right-left pattern, each upturned leaf a stride apart, leads downslope toward the lake. Once you figure out the pattern, like the tracks of someone running, you increase your own pace. Whatever happened here, and whoever it is you're following, you are now more than half an hour late to the party.\n\n\nAnd before you know it, you are kicking your way through a midden pile.\n\n\nMidden: a now-obscure word for a phenomenon that was once quite common. Before the age of recycling, when the world came to be seen as a system of finite resources, it had once been a widespread practice to simply toss refuse out in some empty place in the woods — season after season, year after year.\n\n\nCans crumple under your feet, and glass crunches. You come to an immediate halt, seeing the sea of beer cans and old liquor bottles spread before you. None of this is recent: the beer cans are rusted into curious artifacts; none of the bottles have labels. Genesee, Schlitz, Black Label — an entire collection of mid-century, post-war alcohol consumption, each can featuring the teardrop-shaped hole of a pull tab.\n\n\nThe midden is almost old enough to have anthropological significance, and it covers at least a quarter of an acre. And here you are, ankle deep in it.\n\n\nThe best you can do is step gingerly, but no matter where you go you'll be crunching steel, aluminum, and glass. Each incremental movement forward will be a noisy affair, at precisely the moment you're trying to be quiet and stealthy. But if this was the direction in which Amy was taken—\n\n\nBefore you can take another step, you are arrested by the sound of a fearsome shriek, like that of a wild beast that is at least as big as you are. This is no bear, no owl. Your first thought is coy-dog, but you've never heard a howl quite like this. It is a call filled with murderous intent, made by a creature that knows only the language of blood.\n\n\nAnd it is maybe fifty feet behind you.\n\n\nReflexively you turn, the headlamp beam following your gaze. There, at the same spot where you had found Amy's tattered clothing, is a creature unlike anything you've ever seen before.\n\n\nTall and bipedal like a person, fur-covered like a beast. Claws at the tip of each appendage, fangs reflected in the light emanating from your forehead. Eyes black and colorless. Nothing like it should exist, and yet there it is, more willowy and feline than any depiction of Sasquatch you've ever seen, but also more real and tangible.\n\n\nThe fate that Amy met seems a bit less mysterious now. The creature bares its fangs and raises its foreclaws at you, signifying its intention to pounce. Midden pile or no, only one response seems available to you now.", "action_results": [null]}, {"action": "Retreat.", "result": "The thought occurs to you that you can't help Amy if something happens to you, too. Everything you own — or rather, everything you brought with you — is back inside that cabin. And if nothing else, you will be surrounded by four walls — and three doors you can maybe lock shut.\n\n\nLeaving the plastic bag and the tattered rags behind, you dash up the hill as fast as you can, turning off the headlamp as you reenter the clearing. The cabin stands before you, as dark as the forest surrounding it. What a queer turn of events that has made this place seem like your safest option! The storm door leading into the bunk room flaps gently in a weak breeze, making you wish you had did a better job at shutting it.\n\n\nTaking a quick look around at the clearing, nothing seems different; as far as what your senses can determine, you are still alone. Only your imagination thinks differently on that point.\n\n\nBefore these circumstances change, you dash through the patch of dead goldenrod toward the bunk room door, slowing only when you reach the slippery steps. You pull the door open wide and take a giant step directly into the entrance, lest you slip again and do even more damage to your body. Once inside, you close both doors shut behind you — realizing only then there is no lock.\n\n\nThere should be silence, but how can you tell with the pounding of your heart? You can barely even control your heavy breathing, even though you know you must. It has only been a few minutes since you were last inside this place, but during that time any number of things might've happened; before you can feel remotely safe again, you need to verify you're the only person here.\n\n\nImmediately you realize one thing has changed: it is now too dark inside this half-ruined structure to see much detail. Everything is a shadow. Despite the risk of catching someone's attention, you turn on the headlamp again. The beam of light seems bigger and brighter now that you're in this confined space, and not just shining it into the depths of the wilderness. You see the shards of paneling and plaster, the leaves and the broken glass, the stains of mold forming on parts of the ceiling and walls.\n\n\nThen you step back down the hallway to the big room at the far end of the cabin, and you see what's left of the two backpacks.\n\n\nThey've been shredded, just like Amy's clothing.\n\n\nBut no one else is here, though; that much is easy to determine, since so many of the interior walls have been smashed. Whoever did this snuck in and then left in a hurry. His intent wasn't to steal your gear, apparently, just to destroy it, as if in a mindless rage against backpacking equipment. Both packs have been sliced in parallel gashes down their front sides, with packets of freeze-dried food and articles of down being the secondary casualties. Feathers and rice bleed out from both packs onto the floor, like the entrails of these two disemboweled creatures.\n\n\nOnce more you realize you are not alone as you want to think. You still don't know completely what happened to Amy, but now it's you who must be facing the most immediate threat. And this rotten old hunting camp no longer seems like an effective barrier against anything. Instead, it looks and smells more like a fetid tomb.\n\n\nSomething shuffles through the vegetation just outside the deck-facing door. Footsteps, about the size of a man's, walking around the outside of the camp. You're still standing beside the picnic tables, headlamp on the brightest setting. Not that you were ever really hiding, but there's no invisibility for you now.\n\n\nThe person is stepping around the deck, around a corner of the cabin. As you follow his footsteps, one by one through the weedy grounds, your attention is drawn to the big picture window on the other side of the twin tables.", "action_results": [{"action": "Next page.", "result": "  think he's still alive.\"\n\n\nA boot taps your ribcage again to make sure.\n\n\n\"Yep,\" another voice says. \"Can't say as I'm surprised, though. There wasn't any blood.\"\n\n\n\"Looks like we got here just in time?\"\n\n\n\"Yeah, but Thilyko got away. Again.\"\n\n\n\"I can't believe my shot missed.\"\n\n\n\"The night ain't over yet.\"\n\n\nThe voices are floating above you as if in a fog, and you feel like you might be floating in it as well. Nothing about your present circumstance makes sense; one moment you were waiting for… something?… someone?… to appear in a window, and the next you're…\n\n\nAll right, details are starting to come in. You're lying on a floor. Yes. You can feel the hard surface against your shoulder, the bruised tailbone throbbing dully like a foghorn in your clouded state of mind. You send out a hand to feel for the floorboards, hoping that contact with something solid will help steady yourself against this drifting sensation. Orientation once more within the universe, that's all you want. As you reach out into the void, your fingers brush pass something wet and mushy. The moss growing under the leaky roof, perhaps?\n\n\n\"He's coming around.\"\n\n\n\"Who do you suppose he is? Should we check for ID?\"\n\n\n\"You know they wouldn't carry any.\"\n\n\n\"But still…\"\n\n\n\"I figure he's military intelligence, sent up straight from Washington, and—\"\n\n\n\"Not DEC? You know they're just as—\"\n\n\n\"Nah, he ain't no Statey, otherwise we'd know him.\"\n\n\n\"He's gonna have a fun time filing this report, then. Snared by their own trap!\"\n\n\n\"This is the kinda thing that doesn't go in a report. They wouldn't want that getting FOIL'ed.\"\n\n\nTwo voices, both male, unknown origin. They speak as though through a window, and not just because of the fog of your mental disorientation; their words are slightly muffled, like those of a bank teller's. You can't see them, because you can't see anything in this pitch-blackness.\n\n\nUntil you realize the darkness is being caused by the fact your eyes are shut. When you open them, you see the gaping hole in the ceiling, residual rain water dripping from a dangling piece of pink insulation, the drops missing your face by not too many inches. Two figures stand over you, both armed with shotguns or rifles or something, their faces shielded with plastic visors.\n\n\n\"Good morning, sweetheart!\" the man to your right says. It is difficult to gauge his expression behind that face shield, let alone recognize any identifiable features. \"I'd ask your name, but we already know you wouldn't give us a straight answer.\"\n\n\n\"I'm George,\" you say, propping yourself uneasily on your elbows, unsure of whether these guys are here to help or hurt you.\n\n\n\"Or Tim. Or Robert. Or Calvin. We know how it is; a lie is a lie is a lie. It's best to not insult our intelligence more than you have to.\"\n\n\nYou realize now what the visors are, and why the voices sound so odd: both men are wearing gas masks. That seems like a striking overreaction to COVID-19, isn't it? They breathe almost mechanically through circular filters below their chins, making their faces look something like aardvarks. From the neck down, they are clad in black tactical-style clothing.\n\n\n\"What are you guys supposed to be?\" you say, the fog in your brain perhaps muddling your choice in words. \"Is this a SWAT raid?\"\n\n\nThe man on the left guffaws into his breathing apparatus. \"Ha! No, we're something even better.\"\n\n\nFrom what you can see of him, he has a short built and almost no neck. Despite the clothing, which bears no insignias of any kind, he lacks the physique to go with it: his bulk is mostly flab, not muscle. The other man, the one standing to your right, is more wiry. Their outfits are similar, but not identical; this tells you they aren't uniforms, but rather costumes purchased through different catalogs.\n\n\nJust then you realize that far from being pitch black as you thought a moment ago, there is indeed a bright light illuminating both of your guests and the rotten ceiling above them. And the source of that light is the headlamp strapped to your skull. Apparently you've been passed out on the floor of the cabin, draining this little battery all the while. How long have you been here? And why?\n\n\nBoth men grip their guns firmly in front of them, but neither weapon is pointed at you.\n\n\n\"Am I in trouble?\" you say, drawing your legs closer to you and easing into a full sitting position. You try not to wince when your tailbone objects to the motion.\n\n\nThe wiry guy speaks carefully through the filter. \"You would know better than us.\"\n\n\nClearly something odd is going on here, and as more of your neurons come back online it is becoming easier to process the sensory details. Yes, you are still on the floor of the squalid old cabin, with two shredded backpacks just beyond arm's reach. It is nighttime, and you still see no sign of Amy. These two men are fearful of something, and they aren't quite sure what to make of you. Quite possibly, they're making false assumptions about your identity.\n\n\n\"Can I at least stand up?\" you say, resisting the reflex to raise your hands.\n\n\n\"I don't know. Can you?\"\n\n\nYou interpret that as an assent. But your body is wobblier than you expected; you need to brace yourself on the nearest table to achieve a fully upright position.\n\n\nOnce you complete this action, you have a better view of the two gas-masked men. Both are middle-aged, easily in their fifties. The flabby man has a bushy beard, the whiskers defying containment by the mask. The wiry man has just a Wyatt Earp-style handlebar mustache, less ambitious than his comrade's facial hair but clearly well-groomed. They watch you carefully through the plastic face shields.\n\n\n\"I'm not sure what happened,\" you say. \"I must've passed out.\"\n\n\n\"I warned you not to insult our intelligence,\" the wiry man says. \"We know all about Agenda 21.\"", "action_results": [{"action": "Next page.", "result": "You are about to ask for clarification when your sense of self-preservation intervenes. You may not have the foggiest idea what \"Agenda 21\" is, but the agenda part screams of conspiracy theories. Best to tread gently through these waters: it's difficult to reason with people whose sense of purpose is built on the self-congratulatory notion they can perceive more than the average citizen. You've dealt with the type before, albeit infrequently and rarely in person; to them \"common knowledge\" is an opiate on which society has been sedated. Either you can see past the illusions and be among the chosen few, or you are just another dupe.\n\n\nThis makes your current situation doubly disconcerting: one moment you were searching the grounds for Amy, then you were trying to evade the sounds of someone approaching. Finally you wake up on the floor, with a sizable gap in your memory. Were these the people you heard? Did they have something to do with Amy's disappearance? At least the guns aren't trained on you.\n\n\n\"Have you seen my girlfriend?\" you say. \"She disappeared before sunset.\"\n\n\nThe two men look at each other, then back to you. \"Girlfriend. Is that what you guys are calling it now?\" the wiry man says.\n\n\nConspiracy theorists for sure, although now you wish you've been paying more attention to these things. What is Agenda 21? Does this have anything to do with Roswell, or maybe a plot against the president?\n\n\n\"Her name is Amy. She stepped out to go pee, and I haven't seen her since.\"\n\n\n\"Who are you?\" the flabby man says. \"And what the hell are you doing here?\" He says the word \"here\" like there is something significant about this place.\n\n\n\"We were just backpacking, and—\"\n\n\n\"Backpacking?\"\n\n\n\"Yeah, and—\"\n\n\n\"You aren't Tree Huggers, are you?\" Flabby says. But before you can respond, or even process the insinuations behind the question, Wiry cuts in: \"How did you even find out about this place?\"\n\n\nIs that supposed to be a trick question? \"I saw it on a map, and I just wanted—\"\n\n\n\"A map?\"\n\n\n\"Yeah, and—\"\n\n\nWiry and Flabby chuckle knowingly to each other, the further details of your explanation of no apparent interest to them. Nevertheless, you detect a slight relaxation in their stances, as if you've just said something to prove you're not the threat they first suspected you to be.\n\n\n\"Then why didn't you come prepared, Calvin?\" Wiry says. You can't tell if he has deliberately or unintentionally misremembered your name.\n\n\n\"I don't understand,\" you say.\n\n\n\"If you knew enough that this place existed, then you should've come prepared.\" He taps the side of his gas mask.\n\n\n\"This is government land,\" Flabby says. \"People aren't allowed to be here.\"\n\n\nHis statement strikes you as a non sequitur. This is the Adirondack Park; the state owns millions of acres of forest, and all of it is quite well known and available to the public. Clearly, though, these two dudes have a different understanding about all that.\n\n\nBut now you have an idea what general conspiracy category Agenda 21 might fall within. You've heard of people who believe environmentalism is merely a Trojan Horse for something far more sinister; they even did a James Bond movie with Daniel Craig on this theme a few years back. A year or two ago you stumbled across someone's WordPress blog site while Googling for something else; this particular guy seemed to have a great many beefs with a great many people, but one of his convictions was that the United Nations had ambitions to take over the world, one environmental regulation at a time. Today a new nature preserve, tomorrow a global dictatorship, if you understood all the innuendo correctly.\n\n\nTo bolster his point, he posted a link to a YouTube video. The link was disguised, though, and you clicked on it before you knew what it was. The video was nearly two hours long, but you saw everything you needed to see in the first thirty seconds. Ostensibly, it was recorded at a conference of some kind, sort of like a TED Talk, except that it wasn't. The speaker was a woman; she was dressed professionally, and she stood behind a podium and spoke into a large headset. If she so chose, she was free to move around and act like a charismatic public speaker, the Steve Jobs of her particular field.\n\n\nThere were giant curtains behind her, like you would see at a hotel convention center, as well as an attentive audience seated in neatly arranged folding chairs. The video itself was professionally produced, with multiple camera angles and seamless editing. The sound quality was excellent. Overall, it gave the basic impression of a credible event, in which a respected expert shared her knowledge on an important topic with her peers.\n\n\nBut beneath that initial impression, the details piled up like tractor-trailers on an icy highway. The topic was the threat the U.N. posed to yadda, yadda, yadda. All right, so that much was catnip to the faithful. But the speaker was wearing an obvious wig, her voice was halting, and the video conveniently skipped her introduction — she could've been anybody, and probably was. The audience members were almost too perfect: very little fidgeting, everyone sitting upright and paying full attention — actors hired to play a role. A banner above the podium suggested this talk was part of a larger conference for the \"Open Minded,\" but it didn't give a date or location.\n\n\nSo you found it hysterical that the blogger who ran this particular WordPress site, who clearly prided his self-described ability to see through government actions and media news coverage to discern the hidden truths, was too blinded by his own biases (or too lacking in worldly experience) to recognize a staged production.\n\n\nYou had tried to get Amy interested in all this at the time; she had been sitting beside you, playing a game on her phone, and you had hoped perhaps the two of you could pick apart all the minutiae and have a little fun at the blogger's (and videographer's) expense. But after describing the set-up to her, as well as the way all the blogger's beliefs had been iterated in a series of angry proclamations, with all of his MOST IMPORTANT POINTS shouted in CAPITAL LETTERS — an entire treasure trove of rambling rants — Amy seemed far less impressed than you were.\n\n\n\"Douchebag,\" was all she said, barely looking away from her game. At the time you had assumed she meant the conspiracy guy, not you, as if she were trying to be a good girlfriend and agree with your observations. She was being supportive, or so you thought — but in light of her later changes, you can no longer be so sure about that.\n\n\nHere you are now, though, deep in the wilderness with two people who… think this cabin is some kind of controlled government facility, maybe? Wiry and Flabby now stand a bit uncomfortably before you, shifting like anxious hobbyists dressed in their SWAT costumes, two weeks too early for Halloween. Amy's choice of words comes back to you unbidden, all this time later:\n\n\nDouchebags.", "action_results": [{"action": "Next page.", "result": "But these douchebags have guns. Best not to forget that detail.\n\n\n\"Prepared for what?\" you say. \"Why isn't anyone supposed to know about this place?\"\n\n\n\"You're kidding, right?\" Wiry says. \"You saw what was coming after you.\" He nods to the two packs, and for the first time you notice the fresh mouse turds scattered among the grains of spilled rice.\n\n\n\"There is a new Thilyko out here tonight,\" Flabby says. He holds up his gun, still pointed safely to the side. \"I took a shot at it, but she got away.\"\n\n\nYour attention is still lingering over the two shredded backpacks, the jagged slices ripped through the nylon. This was the threat you had been bracing yourself to face, when… when…\n\n\n\"You OK there, buddy? You're looking pretty pale.\" Wiry spins you back around to get a better look. The concern in his eyes is apparent even through the visor.\n\n\n\"I… I… blacked out, didn't I?\"\n\n\n\"And it looks like you're about to again.\"\n\n\n\"It's the miasma,\" Flabby says. \"This place is ba-a-a-d news. I'm surprised he held out this long.\"\n\n\n\"All right, Calvin,\" Wiry says. \"Let's get you some fresh air. C'mon, easy does it.\"\n\n\nWith a firm grip on your arm he guides you onto the deck. The clouds are gone now, revealing a sky full of pinprick stars. Mars is a fiery ruby among all the cold diamond dust.\n\n\n\"Is that better?\"\n\n\nActually, yes, although you don't say it. If by \"miasma\" they meant the dankness of the cabin, then yes the fresh air is much preferable.\n\n\n\"Cool Calvin,\" Flabby says behind you. \"I bet that map never prepared you for this.\"\n\n\nWiry adds: \"You have no idea what a Thilyko is, do you, Calvin?\"\n\n\n\"Thilyko…\"\n\n\n\"Well, Thilykotherium officially. The She-Beast.\"\n\n\n\"She sure got a good look at Calvin.\"\n\n\n\"I'd say.\"\n\n\nShe-Beasts? Agenda 21? You'd dismiss this as some kind of drug-induced paranoid Sasquatch fetish, were it not for Amy's disappearance — and the state of the two backpacks.\n\n\n\"NATO breeds them here. Government buys the land and shuts all the people out. Only a few of us know all about it.\"\n\n\n\"Good thing for you we came along.\"\n\n\n\"Didn't you mention you can't find your girlfriend?\"\n\n\n\"That's one less Christmas present you'll need to buy this year.\"\n\n\nTo them it's a joke, and they chuckle in self-satisfaction to each other.\n\n\nBut to you the consequences of what they're suggesting are profound — preposterous, yes, but profound.\n\n\n\"You mean Amy's been—\"\n\n\n\"Killed? Yep.\" Wiry looks very pleased inside that gas mask, with you as a newfound audience. \"We think the Thilykos were going to be super-warriors—\"\n\n\n\"We know, brother,\" Flabby cuts in, as if to correct him.\n\n\n\"—but they lost control. We thought you were just another pencil-neck from Washington coming to check on the trap.\"\n\n\n\"Instead you're the one who got caught in the trap. Next time you better bring one of these.\" Flabby points to his gas mask.\n\n\n\"All those people who've gone missing over the years, DEC says they can't find 'em. Hikers like you, wanting to get back to nature. Gone, under mysterious circumstances. The rangers search for a week, never find a trace.\"\n\n\n\"But they never look here.\"\n\n\nYour mind is getting tired trying to keep up with these two… you're about to think of them as douchebags once again, but you don't feel like you're on a level playing field here. How can you judge, when some aspects of their wild story just happen to fit the known facts?\n\n\n\"Listen! You hear that?\" Wiry forgets you for a moment and turns his focus toward the woods. Flabby goes silent, and even you get caught up in the moment.\n\n\nSomewhere in the darkness something shrieks. Were it closer you'd think it was blood-chilling, but at this range you're prepared to dismiss it as a screech owl hunting its prey.\n\n\n\"There she is!\" Flabby says, finally pulling the gas mask off his head.\n\n\n\"Looks like you might get that second shot after all, brother,\" Wiry says to him. Both men are taking off backpacks and stowing their breathing apparatuses inside.\n\n\n\"Maybe Calvin here wants a shot at this one,\" Flabby says, putting his pack back on. \"You know, vengeance for… what'd you say her name was? Jaime?\"\n\n\nWhen you don't respond quickly enough, Wiry jumps in: \"Of course he does. You can see it in his eyes!\"\n\n\nActually, you have no idea what he sees in your expression, but it looks like you're about to get deputized by this duo.\n\n\n\"Wait, what're you guys planning to do?\" you say, still about a mile behind the pace of their leaping logic.\n\n\n\"That's our Thilyko we just heard,\" Flabby says. He is holding his gun now as if offering it to you. \"Probably gone back to finish off that girl of yours. Here, you're gonna need this.\"\n\n\n\"Now hold on, brother,\" Wiry intervenes. \"Our friend here might not be into shootin' things.\"\n\n\nBoth men look expectantly at you. \"We're going Thilyko hunting,\" Wiry continues. \"You're welcome to come with us, or you can— say, were you camping out somewhere?\"\n\n\n\"I think he was planning to camp here,\" Flabby says, his beard bristling outward, a creature glad to be released from its confinement.\n\n\n\"Well that ain't gonna work.\"\n\n\n\"And his gear got destroyed to boot.\"\n\n\n\"I have an idea,\" Wiry says. \"You look like you need a rest, Calvin. We have a camp set up not too far from here, not hard to find at all. Why don't you go get some rest, help yourself to some Dinty Moore. We'll be back within the hour.\"", "action_results": [{"action": "Join the Thilyko hunt.", "result": "erhaps this wasn't such a good idea after all.\n\n\nThis is the thought you have when you first see the… what have they been calling it? The Thilykotherium, this She-Beast of theirs. You had been expecting just a black bear or something, one of the clever ones so accustomed to people that it can now pop the lids off supposedly bear-proof food canisters. That still wouldn't forgive whatever fate befell Amy, but it would've been a truth easier to digest — and explain to a coroner, should the events of this night still lead to that outcome.\n\n\nHowever, the creature your two new companions are hunting — the creature they claim had been hunting you and your girlfriend — looks almost human.\n\n\nThe three of you had only had that one shriek by which to find the creature, and to you the origin of the sound had been indeterminate — somewhere to the north, or northwest, or whichever compass direction lies midway between the cabin and Deadman Mountain. With only the starlight to see by, it seemed likely you'd spend hours searching for something that would be quite good at evading you in the darkness. Therefore what was the point in trying? Their stories of missing hikers and man-killing mutants, miasmas and military conspiracies, was thrilling, sure. And if nothing else, by joining them you might learn something about Amy.\n\n\nStill, though, you should've expected the night-vision goggles.\n\n\nEach man had one, of course, and when Flabby loaned you his gun it came with an unspoken criticism: \"Had you been prepared for this backpacking trip of yours, Calvin — I mean really prepared, not just with some rinky-dink pup tent and a toothbrush — you'd have all of these things too.\" At least, that was the sentiment you read into his cool expression when he handed you his shotgun and put on his goggles.\n\n\n\"Now, Mark,\" Wiry began to explain, but you almost weren't paying attention because you missed the part where your name ceased being Calvin, \"just follow our lead. We'll make sure you get your shot.\"\n\n\nBy which you took to mean they were going to give you first crack at this Thilykotherium of theirs, because of course it made complete sense to them that Amy was dead, this mutant government experiment had killed her, and you had a right of vengeance to claim. Wiry and Flabby were happy to play the role of guide, taking you to your quarry. But if you were to miss, or not even fire at all, then…\n\n\nClearly, they had no intentions of letting this \"Thilyko\" get away a second time on the same night.\n\n\nThey led you back down the overgrown driveway, which as you remembered from before passed near a large boggy wetland adjoining the outlet end of the lake. Wiry was leading the way, and Flabby was right behind you, both men engrossed in the seriousness of this endeavor. It had been your intent to ask them their real names, but the concept of names seemed so fluid in their minds you weren't sure you'd get a true answer. And so they remained Wiry and Flabby, which struck you as being a tad better than douchebags, the collective name Amy might've bestowed.\n\n\nWiry stopped at a low point in the road, where it was closest to the bog. A few steps through a thin screen of trees, and he somehow managed to find a low outcropping of rock upon which all three of you could crouch.\n\n\nAnd so here you are now, Flabby's shotgun in your hands, a douchebag on either side of you. There is no moon, just the stars and a few of the brighter planets, the storm clouds long gone. It is not much light, but it turns out to be just enough to see what you came to see.\n\n\nThe Thilykotherium is out across the bog, humoring itself with something you can't see in the darkness. All you can really see of it is its silhouette against the starry reflections in the lake beyond, but it's enough to see this is no bear. The figure is willowy in a way you hadn't expected, almost human, but just slightly off. It indeed does seem feminine, except that no woman you've ever met would be out in this remote bog in the middle of the night. She seems to be preoccupied with something lying in the cotton grass. Picking wild cranberries, maybe? A few unintelligible grunts, as well as glimpses of what very well could be claws at the tips of each hand, all but confirm every wild fantasy these two bushy-faced men told you back at the cabin.\n\n\nWiry nudges you with his elbow, then points silently at the shadow in the bog, helpfully in case you haven't spotted it yet. It's obvious what he wants you to do. But can you? Thoughts are cycloning through your brain faster than you can contain them, including the Agenda 21 stories, which still seem to be perforated with mile-wide holes despite the evidence before you. The douchebags, however, have so far been more correct than you had believed possible, and yet you still find it difficult to reconcile their perceptions of reality with your own understanding. Seriously, NATO? A miasma-filled cabin left as a trap? And yet you were knocked unconscious, your memory was shot full of holes, and here is the She-Beast, right where they said it would be.\n\n\nAnd then there's Amy. No conclusive sign has yet been found of her… or at least, not from what you remember with you miasma-addled mind. Wiry and Flabby seem certain this Thilykotherium thing killed your girlfriend, and so far their scorecard for being correct isn't bad. You should be horrified. You should be racked with grief, fearing what the authorities will say when you report these incidents — when you report the (alleged) mauling of your girlfriend by a wild She-Beast. Then there will be her family to contend with; they will all be beside themselves with grief too, and her mother will of course blame you, since it was you who dragged her daughter out here, to the place of her death.\n\n\nFor that matter, you should be terrified for your own safety, because there's the murderous monster that (allegedly) attacked and killed a human being — the victim being someone who (allegedly) loved you once, someone to whom you had been close for years. Now her killer, a literal beast, is just twenty yards away, in the sights of your borrowed shotgun; if you don't kill the Thilykotherium, the Thilykotherium won't hesitate to kill you.\n\n\nExcept… none of these emotions feel as pressing as they theoretically should be: the grief, the fear, the angry need for vengeance. Instead your thoughts are tripped up in the doubts: since when did the world have Thilykotheriums in it, and where did this one come from? It's like there is a much longer story to be read here, more that should be known, but you've only been given enough evidence to force a certain conclusion.\n\n\nSo you adjust your grip on Flabby's shotgun, you look down its barrel, and with these thoughts chasing each other in your mind you…", "action_results": [{"action": "...pull the trigger.", "result": "There is a flash of light from the end of the barrel, and the recoil jams the butt end into your shoulder — possibly another bruise to add to your collection. The creature in the bog shrieks again, this time in pain. The buckshot spins her around but doesn't knock her over. Nevertheless, the douchebags break their silence and rise from the ledge.\n\n\n\"Woo-haw!\" Wiry shouts with glee. \"Good shot, Scott!\"\n\n\n\"C'mon, buddy,\" Flabby says, grabbing you by the arm. \"You got 'er good, but let's go make sure!\"\n\n\nThe two men, dressed as they are in their amateur SWAT gear, are even darker than the Thilykotherium — and right now, they are equally noisy. They splash through a pool of water and run toward the injured creature, clearly having the time of their lives. Wiry has his own shotgun aimed and ready, and Flabby eggs him on: \"Go! Go! Go! Go!\"\n\n\nYou are swept up in the eddy of their enthusiasm, still holding Flabby's gun. The water is deeper than you expected and mud fills your boots, but you know the role you play in this scene, so you keep going. The bog itself is squishy of course, a minefield of hummocks and hidden pools of water. Maybe you don't have night-vision goggles to see your way, but you do have the next best thing: the headlamp with its LED bulb.\n\n\nNot that there's any doubt where the Thilykotherium is, because she is writhing in pain. Indeed, when you catch up to the others, you find her to be absolutely spasmodic. Your shot struck her in the shoulder, a mortal wound to be sure; but the buckshot has put her into a frenzy of kicking and jabbing. She's fallen onto her back in the moss and cotton grass, thrashing with her claws as if fighting off a foe that had tackled her.\n\n\n\"We got ourselves a holy roller here!\" Wiry says.\n\n\n\"Look at those claws!\" Flabby shouts. \"Those will make sweet trophies!\"\n\n\n\"My wife would love a necklace made of those,\" Wiry agrees.\n\n\nSomething about this scene strikes you as inexplicably bizarre, particularly the part about the two grown men acting giddy as they preside over the death of this \"She-Beast,\" which looks even more human now that you can see her up close. It is like someone took the gracile frame of a human body and grafted the face and fur of a mountain lion onto it, the way you might build a custom hot rod on top of an old chassis.\n\n\n\"She's in agony,\" you say, the Thilykotherium flailing in the glow of your headlamp.\n\n\n\"It,\" Wiry says, and it takes you a moment to realize he's correcting you. \"Time to put it out of its misery. Go on, this one's for you. Do it for your girl.\"\n\n\nOnce more, both men are watching you expectantly, eager to see you make the kill shot. Oddly, even though you've already wounded this creature, none of your doubts have abated.\n\n\n\"Go on, Tim,\" Flabby urges you, smiling encouragingly as if you were a little tyke too shy to go play with the other kids. \"There's another round in the other chamber.\"\n\n\nYou sigh. In for a penny… Now regretting every single minute since you and Amy rounded the foot of Deadman Mountain and ever laid eyes on this place, you raise the shotgun once more and step half a pace closer to the Thilykotherium. If you don't do this, Wiry will. So ultimately what's the difference? You've already inflicted great pain, so you might as well finish the job.\n\n\nWiry and Flabby have raised their goggles so they can watch this event with their own eyes. But something is wrong — when you aim the shotgun at the creatures chest, you no longer see a figure that's so distinctly strange and beast-like.\n\n\n\"What're you waiting for, Joe?\" Wiry says, disapproval in his voice. \"Every minute you permit this to go on is cruel and inhumane.\"\n\n\n\"Don't be a sissy now,\" Flabby says.\n\n\nBut that's not the issue. \"Don't you see it?\" you say.\n\n\n\"See what?\"\n\n\n\"She's changing!\" you say. Perhaps you can see it only because you're standing so close, as if you're about to club a seal. But you can see now the creature isn't writhing this wildly because of the buckshot wound to the shoulder, bad as that may be. A metamorphosis is occurring. That's the problem.\n\n\n\"Changing?\" Wiry says, the word heavy with skepticism. But both men step closer to see what you see — to verify your fantastical claim. If only there were time to appreciate the irony.\n\n\n\"Holy hell,\" Flabby says, regretting his step forward.\n\n\nWiry doesn't say anything, not with words anyway, but the expression on his face is easy to interpret: We're screwed, it says.\n\n\nBecause as the three of you watch, the boundary between the two worlds the Thilykotherium had occupied a moment ago is now melting away, the feline elements reverting to their original human form. And there, thrashing in the bog grasses, is not a beast at all.\n\n\nIt's Amy.\n\n\nNaked, insensate to everything but the double agaony of your gunshot and her transformation, bleeding profusely where the buckshot struck her. And also from the twin puncture wounds on her shin, the ones that had briefly mystified you hours ago back inside the cabin.\n\n\nSlowly she becomes aware of her surroundings, and the fact that three men are standing over her. Her eyes find yours.\n\n\n\"George?\" she says.\n\n\n\"Balls!\" Wiry says.\n\n\n\"What do we do? What do we do?\" Flabby says, becoming panicky.\n\n\n\"George?\" Amy says again. \"What's going on?\"\n\n\n\"Balls!\" Wiry shouts again, this time twice as loud. It's like Amy's reverse metamorphosis has spoiled something for him.\n\n\n\"We've got to do something!\" you say. \"That's Amy, that's the girlfriend I've been looking for all night long!\"\n\n\n\"Something? Something?\" Wiry says, getting a bit in your face. \"I hate to tell you, but little Susie Q here is dying. You shot her, with his gun. Oh, balls!\"\n\n\n\"We've got to stop the bleeding!\" you say.\n\n\n\"With what?\"\n\n\n\"Don't tell me you guys brought gas masks and night-vision goggles, but no one here has a first aid kit!\"\n\n\nWiry paces through the bog, then steps back into your light. \"How can we stop her bleeding when she's already bled out?\" It strikes you as a statement of futility.\n\n\n\"We'll say it's an accident,\" Flabby says, but your eyes are on Amy, who already seems so pallid and cold, the heat sucked from her body quickly by the chilly October night. She's gone, before it ever occurred to you to hold her and try and comfort her. You were, after all, still holding the instrument of her death.\n\n\nWiry notices her moment of passing too, taps her shoulder with his boot to make sure. \"What do you think now, Romeo?\" he says to you. There are accusations in his words, even though as you recall he was just as responsible for these events as anyone.\n\n\n\"We'll say it was an accident,\" Flabby says again. He's stunned; this is what, the third or fourth time he's said the same thing? All those conspiracies he's always imagined, all those unprovable theories his mind has ever unspooled, and the reality has proven to be more unbelievable than any of you could have imagined.\n\n\n\"Gus here probably has the most to lose of any of us,\" Wiry says, looking at you. \"Wouldn't you agree?\"\n\n\nYou haven't had a chance to think that far ahead. But yes. Probably. Eventually Amy's death will have to be reported, obviously. But how exactly does one explain to the authorities that you killed your girlfriend because at that particular moment — that precise second you had pulled the trigger — she was in the form of a Thilykotherium?\n\n\nWiry takes your lack of response as agreement. \"I thought so,\" he says. \"But like we were saying earlier, people have been going missing out here for years, and no one can ever seem to find the bodies.\"\n\n\nWithout asking permission, or for help, he grabs Amy's body by the armpits and begins to drag her across the bog. Without looking to anybody in particular, he says, \"I still have my gun with me. If anybody doesn't like what I'm doing, I can make sure Ruby here will have some company.\"\n\n\nAnd when he reaches the end of the bog, where the cold stars reflect in the dark water of Shingle Shanty Lake, he rolls Amy over the edge.\n\n\nHe thinks that disposing the body is also disposing the problem you all face. But you know better than to think it will ever be this easy — out of sight, out of mind. Even if her body slipped gently into the water just now, it was in reality a cannonball splash. Waves of consequences will be rippling through your life until someone sends you, too, into the depths.\n\n\nFor you know the three of you — and especially you — will be seen as nothing more than murderers, once the events of this evening are known. As the stars rotate above you, circling in a heaven you'll never have the chance to visit, you kneel in the bloody bog, crushed by this new defining reality.\n\n\nTHE END", "action_results": [null]}, {"action": "...decide something's not right.", "result": "\"I can't do it,\" you whisper.\n\n\nTwo sets of night-vision goggles turn toward you, but neither man responds. You can hear Wiry muttering something to your right.\n\n\nYou jump at the sound of his gun firing, at the brief spark of light in the darkness. He didn't take long to act when you chose not to.\n\n\n\"Balls,\" he says. \"I missed.\"\n\n\nUp until this moment everyone, you included, had been stealthily quiet, but now the gunshot has obviated that concern. \"Shoot again! Shoot again!\" Flabby shouts beside you. Meanwhile he tries to reclaim his gun from your grip, since you've just indicated you don't intend to use it.\n\n\nSomething has suddenly got them both in a panic, something they can see with their goggles that you can't see yourself. But it only takes a second to figure out what that might be. The giveaway is when you hear the sound of footsteps sprinting through the bog, each one accompanied with a splash of water. Wiry's first shot might have missed its mark, but now the Thilykotherium has you all zeroed in.\n\n\nThe second shot comes too late. And at any rate he has aimed low, where the creature had been just as the she is leaping across a channel of shallow water. The She-Beast leaps on him, and in the melee she thus instigates you are immediately pushed off the ledge. Like bocce balls you collide with Flabby and knock him into motion too.\n\n\nThe two of you land on top of each other in the water, neither able to find purchase right away. The water is only inches deep, but the mucky bottom mires your feet and fills your boots. Flabby seems just as eager to wrench the shotgun from your grasp as he does to free himself from your mutual trap, working against your efforts to rise from the water and crawl onto dry land.\n\n\nAbove you, on the ledge, Wiry screams. There are no words, just the horrified emotional reaction common to any animal realizing its body is about to be torn open. Then with sickening abruptness he goes silent. The Thilykotherium shrieks, much like the sound you heard before, the one you thought was a screech owl. As you anticipated at the time, this feral call is much more terrifying when heard up close. The creature seems to be declaring victory over its first kill, as well as attempting to paralyze its remaining two victims with fear. Quite effective, really.\n\n\nFlabby takes the shotgun, but before he can aim it the Thilykotherium pounces on him. All you can see are shadows thrashing. \"Help me!\" Flabby shouts. \"For the love of God get it—\"\n\n\nAnd then he too goes abruptly silent.\n\n\nWithout anyone wrestling with you for control of the gun, you are able to scoot backward onto dry land. The creature must know there's still one more human, one more person who had come here to kill it. You expect her lunge for your throat to come at any moment.\n\n\nTree branches scratch at your hair. You are passing through that barrier of trees growing at the edge of the driveway, then your hands feel the firm, level ground. Could it be the Thilykotherium doesn't care, that she got what she came for when she silenced Wiry and Flabby? Theories, theories. It seems all that anyone has anymore are half-baked but convenient theories that fit the known truths.\n\n\nSo. There you are, on the driveway, still alive but not alone. And completely lost in the dark. Sure, you have your headlamp, but all that will do is draw the She-Beast right to you. And where does one go, anyway, when one is running for his life from a Thilykotherium? Back toward the miasma-filled cabin, or into the deep woods? Neither option sounds great, to be honest.\n\n\nAll things considered, though, you wish you had never come to this place. You and Amy. You wish you and Amy had never come to Shingle Shanty Lake, that you had gone someplace busier instead. More people, fewer She-Beasts. Less running for your life in the dark.\n\n\nHow hard can it be to run down a driveway in the dark? You give it a try, heading away from the cabin, but all it takes is three steps and you're tripping head over heels — tripping over a log you never saw because there isn't enough light.\n\n\nAdmit it, you need that headlamp. The Thilykotherium will see you, yes, but you'll also be able to see where you're going. And maybe there's a way to outsmart the thing. So you reach up to your forehead and turn on the little beam of light, a third eye that will literally shed some light on this problem of yours.\n\n\nAnd what you see in that beam of light is the thing you're running from, just six feet away. She had stalking you all this time — lean, hungry, and merciless.\n\n\nTHE END", "action_results": [null]}]}, {"action": "Go to the campsite.", "result": "hen you reach the douchebag camp, you find it to be something of a disappointment.\n\n\nIt looks like a tepee made with two blue roofing tarps wrapped around a series of wood poles. That might be fine, except for the fact the tarps are old and full of holes, as if they've been sitting out here in this place for many years, the plastic beginning to rot in the perpetual UV ray exposure. The patch of ground surrounding it looks worn, like it has been tread by many feet — or more likely, by the same feet many, many times. Bud Light cans are strewn everywhere, discarded; the faded blue logo and thin layers of grime tell you that some of these were emptied and forgotten a long time ago.\n\n\nThus your first impression is that of an animal warren, where the animals in this case spend much of their energy growing unnecessary amounts of facial hair and thinking too much about NATO and Agenda 21. But, all things considered, it is a shelter, and ever since the demise of the backpacks tonight your shelter options have become binary: either here or back at the miasma-filled cabin.\n\n\nWhen you pull back a loose corner of tarp and behold the inside for the first time, you almost reconsider which of the two options would really be better. Here, in addition to empty Bud Light cans, you find a similarly-empty Pringles can, as well as a half-empty bag or tortilla chips, the other half being a soggy mass of corn chip mush. It's a wonder this place hasn't been ransacked by hungry black bears.\n\n\nHelp yourself to some Dinty Moore, Wiry had told you. Indeed there are several cans of beef stew lying around, some still sealed and others recently emptied. Strangely, though, you don't feel hungry, despite everything that happened today — or perhaps because of it.\n\n\nWhatever happened to you back in the cabin, whether it was that so-called \"miasma\" or some other stimulus, you feel disoriented, incomplete. You remember a ten-mile hike, you remember finding the cabin, you remember the rain. You remember Amy stepping out to leave, but from there your memory is Swiss cheese. You looked? …but couldn't find anything? …or was there something? For a second you think you have it… but then no.\n\n\nPerhaps it was a \"miasma,\" something about the fetid air inside that structure that emptied your mind of recent experiences. Perhaps it would have emptied you of much more than that, had you not been awakened. And if so, does this mean you owe Wiry and Flabby a debt of gratitude for saving your life?\n\n\nDespite the rain earlier, the sky remains clear. The air is cool, but that is typical for October. This is a nice night, actually, and had your original plans not been so derailed you imagine that you'd be sitting beside Amy right now, kicking back, a blazing little fire at your feet. Even Amy would've found that enjoyable, a reason to enjoy the moment and keep her complaints to herself for a few hours.\n\n\nYou decide you have no interest in the tepee right now, that you'd prefer to be outside; you've already spent too much time in one questionable structure, and look what happened.\n\n\nA fire would be nice. The douchebags have an ashy firepit nearby, the coals still warm from a recent blaze. A haphazard pile of sticks lies nearby. You find their char-tipped poker stick and used it to kick aside the charred cans and melted glass. The douchebags have some birch bark and cigarette lighters handy, and soon you have a small little fire burning. It only occupies a quarter of the fire pit's total area; their fires must be big enough to roast pigs.\n\n\nAs Wiry had promised, this place wasn't hard to find.\n\n\n\"See that trail?\" he said, the three of you standing in the little clearing near the camp where the driveway split. He and Flabby were about to set off to go slay the Thilykotherium and were eager to get started. \"You see it?\" he said again.\n\n\n\"Yeah, I see it.\"\n\n\n\"Good. Follow it past the old dock. Keep left. The trail will look like it's about to disappear on you, but then it scoots up a hill toward an old truck. When you get to it, stand with your back to the driver's side door. Our camp will be a hundred feet straight ahead, at the foot of a large pine.\"\n\n\nIt seemed like a lot to remember, but in the light of your headlamp the trail wasn't that hard to follow, and the old truck was right where he said it would be — a Jeep no less, from the late 1940s you estimated. From there, the trail of old Bud Light cans was unmistakable.\n\n\n\"We shan't be gone long!\" Wiry said, he and is friend already heading in the opposite direction. \"This Thilyko won't be hurting anyone else when we're done with it!\"\n\n\nNow you are putzing around their campsite by yourself, stepping around the little campfire you've started and constantly feeding it twigs picked up off the ground. You know exactly what it is you're doing: keeping yourself busy, trying not to dwell on the fact that Amy isn't here. What is it that you found, or didn't find, before you blacked out? It bugs you that you can't remember.\n\n\nBut it bugs you even more that you don't know what happened to her. Is she really gone? Is she hurt, unable to make her way back? It's no surprise that you can't eat, that you can't sit still, that you'll almost certainly get no sleep tonight.", "action_results": [{"action": "Next page.", "result": "When you hear the gunshots, it seems like hours have passed since you parted company with Wiry and Flabby. But in reality it's probably only been a few minutes.\n\n\nSo, it's done. You have no idea what a Thilykotherium is, or if there really is such a thing. Genetically engineered NATO soldiers gone wild? There are several layers of unbelievability in that pile of stinking bull crap. Most likely they've just shot a black bear out of season, or without a license, or whichever of the big game laws they've just violated.\n\n\nThis probably means they'll be returning any moment now, flush with their success and ready for another round of cajoling you. In all likelihood, one of them will throw an armful of wood on top of your twig fire and turn it into a small bonfire, around which they'll fill your ears with more of their pearls of doubtful wisdom. Clearly they've discerned you're not a believer yourself, and so they'll naturally spend the rest of the evening attempting to proselytize this new heathen they've stumbled across.\n\n\nAs soon as they return.\n\n\nWhich could be any minute now.\n\n\n          Any.\n\n\n                    Cotton-pickin'.\n\n\n                               Minute.\n\n\nIt seems like you've already done this before, the waiting for someone to return — someone who never does return, no matter how long you wait. People leave you, setting off on what they promise will be a quick task, certain in the results. But then the minutes become bloated with unfulfilled expectation as you put your own life on pause, waiting, passing the time by imagining what the holdup might be, until eventually so much time passes that the only possible explanations seem to be the tragic ones.\n\n\nSo here you are again, pacing around the little fire you've been tending, casting a restless shadow on the tarp tepee. When you were certain of their imminent return, you were dreading it, since you're not entirely enamored of this douchebag entourage, as much as you've benefited to a degree from their company. But now that they have failed to return you can't help but feel betrayed a little. Distinctly let down.\n\n\nLittle noises in the woods start to get your attention more. A mouse traipses across the newly-fallen leaf litter, and it sounds like a coy-dog stalking you in the darkness; a gentle breeze rustles the pine boughs above you, and it sounds like distant voices, an entire crowd of people just around the hill.\n\n\nYou begin to regret the decision to start a fire. The light has impaired your ability to sift through the shadows, and when you look into the woods all you see is darkness. Although this particular place might be new to you, you've been hiking in the Adirondacks a few times a year ever since you were a boy, tagging along on your uncle's fishing trips. These experiences hardly qualify you as an outdoor expert, but you had always had the impression this was a benign wilderness.\n\n\nBut not tonight. Something in the woods surrounding this lake seems intent on isolating you, by causing each of your companions to vanish without explanation, as though the wilderness itself were enforcing its rules of solitude.\n\n\nWhere man is a visitor who does not remain. You read that somewhere, you can't remember when. Forget all that conspiracy hooey about restricted zones controlled by the military; this is protected state land, and there are special regulations or something that apply to a few key areas, including this one. A primitive and unconfined type of recreation; opportunities for solitude. It struck you as being absurd that anyone would feel the need to codify the obvious, since what else would anyone do in a wild area? Nevertheless, you're pretty sure those phrases are actual things that exist somewhere, closely guarded by the state bureaucracy.\n\n\nA visitor who does not remain. Well then, if they don't remain then where is everybody going tonight?\n\n\nAs the temperature drops, you wish you had taken the time to salvage more stuff from your backpack — assuming there was anything worth salvaging. There was both a wool sweater and a down jacket in there, as well as your sleeping bag. It's quite possible all of that had been shredded, though, making you even more dependent on the douchebags and this messy camp of theirs.\n\n\nGeorge.\n\n\nAt first you dismiss the whispering of your name, assuming it's just the breeze in the pine tree that's acting on your increasingly hyperactive imagination. Until you hear it again.\n\n\nGeorge!\n\n\nIt's a voice, though not necessarily a spoken one. You spin around, thinking maybe it's just Wiry and Flabby trying to spook you, but again all you see is darkness.\n\n\n\"Who's there?\" you say, hoping to put this unseen prankster on notice that you're paying attention and won't let yourself be fooled.\n\n\nCome here. George, you're not safe.\n\n\nNow come on now, as if you weren't creeped out enough already! \"I don't know who you are, but I need you to step into the light where I can see you!\"\n\n\nYou know who I am, George.\n\n\nThis voice doesn't seem to be originating from any specific point. It simply is, and you can sense it clearly even if you have no idea how near or far the speaker is.\n\n\nBut it's right, you do know who it is: it's Amy.\n\n\n\"If that's you, honey, let me see you! You gave me a good scare today! You've been gone for hours.\"\n\n\nWhen there is no response, you start to feel foolish for speaking to this audience of trees. For if her voice has no acoustical presence you can detect, then what else could it be but your own thoughts gone wild?\n\n\nBut then you sense it again: George, come!\n\n\nThis time you do get a better sense of its origin — but when you turn on your headlamp and shine it in that direction, all you see is the seventy-year-old Jeep.", "action_results": [{"action": "Stay put.", "result": "Nope. Not gonna happen. George is not going to follow some disembodied voice toward a Jeep that looks like it had been burned out decades before you were even born. Is that what happened to everybody else? They obeyed the whispers?\n\n\nGeorge! it implores again, but you say to yourself aloud, \"I'm not hearing this, I'm not hearing this. I am not losing my mind! I am not losing my mind!\"\n\n\nOf course, you're not convinced you can believe any of that; your mind is like a house knocked off its foundation, sinking into the mud. You decide the twig fire isn't nearly big enough, and so you gather some of the bigger pieces of woods gathered by the two douchebags and watch as the flames grow. What if all this were a dream, and in reality you're still passed out on the floor of the cabin, the miasma poisoning your bloodstream and mice fattening themselves on your freeze-fried food?\n\n\nThilykotheriums. Agenda 21. Ghost voices penetrating your skull. People stepping away for a moment and not returning. The thought occurs to you to reach your hand into the fire and grab one of the hottest coals; you'll know this current situation is reality if the coal burns your palm. If this is just a dream, the imagined pain will jar you awake.\n\n\nFootsteps in the woods. Distinct, slow, but getting closer. And most importantly, too big to be a mouse.\n\n\n\"So are you going to tell me who's coming?\" you say, but the disembodied voice doesn't respond. Has it, too, abandoned you?\n\n\nWhatever is approaching, it's heading straight toward the campsite. Deer? Fox? Turkey? No, those seem unlikely; wild animals wouldn't wander toward a large fire like the one you've been stoking. But then what else could it be?\n\n\nThe leaves are so thick out here that nothing could pass through these woods unheard. And with this fire you've just built up, you can't go unseen. You feel naked, exposed just standing here, feeling tethered to this campsite because you know nowhere else to go. Just in case, you eye what looks like a sturdy length of wood from the pile, pulling it free so you can wield like a club, should things come to that.\n\n\nBut then the footsteps fade away, as if they had never been there at all — yet another thing abandoning you on this most awful of nights. However, you're not buying it, not this time. You're sure you heard something large approaching. You're sure it's still out there, just beyond the glow being cast by the fire.\n\n\nYou lift your club-stick, making sure it's plain for anyone to see. \"Amy, is that you?\"\n\n\nNo response.\n\n\n\"I know you're out there! There's no point in playing games.\"\n\n\nYou should have left the light while you still had the chance. There's nothing I can do to protect you now.\n\n\n\"Say what?\"\n\n\nI'm not the one in control.\n\n\n\"Amy, is that really you, honey? I'm afraid I don't understand.\"\n\n\nThe response once more is silence.\n\n\nExcept that no, there is a sound. In the dark. Breathing.\n\n\nOnce more you turn on the headlamp, which creates a more focused beam of light than the campfire glow. At first you don't see it — or rather, ou don't recognize it, because what you see seems to be just another shadow. Until it moves, and you see the creature moving from the background.\n\n\nThe Thilykotherium, you presume? If so, then Wiry and Flabby clearly weren't so successful.\n\n\nIn a strange way, it's somewhat reassuring to know you haven't been completely abandoned, that you're not entirely alone. But quickly you figure out this strange thing is not here to make friends. As soon as it realizes it's been seen it leaps from the shadows. Defensively you hold up your stick, but now that this moment has arrived it's hard to see how a piece of wood no thicker than your own arm is going to do much good against the murderous frenzy that is now leaping at you, claws aimed at your throat.\n\n\nTHE END", "action_results": [null]}, {"action": "Approach the Jeep.", "result": "The Jeep. Amy owns one too, although hers is a good six decades newer. Is that where she's been hiding all this time? Did she see those vertical bars on the grill and see in them something familiar? Has she been inside, taking a nap all this time and losing all track of the hour?\n\n\nYou approach the vehicle cautiously. It is being broadsided by the beam of your headlamp, and yet you see no movement. When you first came this way after parting company with Wiry and Flabby, you had only glanced at the thing with passing curiosity, surprised as anyone would be to find a truck way out here in the woods; even though everything is grown over now, there was clearly a time when all of this was someone's private land and they accessed by roads that have since aged into trails. The Jeep has a boxy body, and aside from the tires there is hardly a curve anywhere. Even the fenders are angular.\n\n\nAmy's Jeep Liberty is black, not counting the road dust it picked up on the drive to the trailhead this morning. She's had it as long as you've been living together, and she never lets you drive it. The cover for the spare tire says it all: SILLY BOYS, JEEPS ARE FOR GIRLS! It's just a joke, and you've seen that slogan on plenty enough Jeeps, but in the context of Amy you've always wondered whether you should take offense.\n\n\nThis Jeep here had once been white. Part of it still is, although most of the front end has been discolored with rust. Both doors are slightly open, and when you shine your light inside the theory that Amy has been napping here falls to pieces: all that is left of the bench seat is a skeleton of metal springs. The cab has become a trash receptacle for the two douchebags, apparently — you'd recognize their Bud Light cans anywhere.\n\n\nBehind the remains of the cab, the truck bed is also empty, save for a collection of leaves and an old oil filter. There is no sign of Amy.\n\n\n\"Babe, you here?\" you say softly, confused. You had followed her instruction, although it's possible you may have misinterpreted something.\n\n\nGeorge, you need to defend yourself. It's her voice again, but as before it doesn't seem to exist on the air.\n\n\n\"What do you mean?\" you whisper, figuring out that you don't need to speak loudly to someone who isn't physically present.\n\n\nYou are in danger.\n\n\nThese words may be giving you the impression of Amy's voice, but it's been a while since she's expressed this much concern about your well being. \"Where are you?\" you say, still seeing nothing in the dark.\n\n\nTurn off that light! Do you want me to find you?\n\n\nIt's the most puzzling thing. Everything: her words, this situation in general. Turn off your headlamp so you can't be found? But the urgency in her soundless voice is convincing, and so you turn off the light.\n\n\nYou are in danger, she repeats.\n\n\n\"From what? Honey, you're being cryptic as hell. I don't understand what it is you want from me. Where are you?\"\n\n\nNearby. I'm not in control. You are in danger. George, find something to defend yourself with.\n\n\nYou wish she had advised you of that last part while you still had the light on. Defend yourself? Against what?\n\n\nI am coming, George, she says almost in a direct answer to your thoughts. I am very close.\n\n\nWhat's going on? you think; if she can communicate to you without using spoken words, then maybe that works both ways.\n\n\nI'm looking for you.\n\n\nI've been looking for you for hours! Where have you been?\n\n\nI'm looking for you, now. You are in danger.\n\n\nYou are crouching beside the passenger door of the old Jeep, doing your level best to process the bizarreness of this situation. I am in danger, you repeat. Find something to defend myself.\n\n\nBefore you had turned off the headlamp you recall seeing a random metal rod abandoned in the old truck's cargo bed. Given the limited amount of time you had to prepare, this may be the best you can improvise — if indeed she is advising you to arm yourself. You reach over the square-edged rim of the truck bed into the pile of leaves, your fingers brushing aside a beer can in the dark before grasping the rod. It's heavy, made out of either steel or iron, and you have no clue what it's original purpose might have been. But it's about as long as a baseball bat, and it's likely going to be the best defensive weapon you'll find.\n\n\nI'm looking for you, Amy's voice says. You are in danger. When I find you, you will need to kill me.\n\n\nKill you? What on Earth—\n\n\nYou will need to kill me, George. I'm not in control. You are in danger.\n\n\nWhat the hell has happened? Has she become some kind of zombie?\n\n\nI am nearby. You are in danger.\n\n\nThis is the creepiest situation ever. Your girlfriend speaking to you telepathically, telling you that's she lost control and that you need to kill her? Is that something you're even capable of doing?\n\n\nJust then you become aware of something walking through the forest, not very far away from the Jeep. Because of the deep carpet of leaves that covers the forest floor, nothing can pass through quietly. Whoever this is, though, is doing their best to be sneaky, but even so you can track their progress. Her progress, because this must be Amy. She's coming from the direction of the cabin, heading straight to the campfire.\n\n\nBut wait a minute. The ridiculousness of this situation is off the scale, isn't it? First a Thilykotherium, now the zombie version of your girlfriend speaking directly into your brain? What was it that happened to you back in the cabin? Everything about this night seems so unreal that you are beginning to doubt your own credibility.\n\n\nSeriously, attack Amy with a metal rod because the voice in your head told you to do so?", "action_results": [{"action": "You are not a killer. You are not going insane. Throw down the rod and approach Amy.", "result": "That's just it right there: a voice in your head. It can't possibly be Amy, and whatever deep-seated anxiety is acting on you now, making you imagine the voice of your girlfriend asking you to kill her, is not your ally. Obeying its directives is a course of action that will guarantee you lifetime accommodations at Sing Sing or Attica or Marcy.\n\n\nIt makes sense: Amy, who has been separated from you for hours, is looking for you now. When you weren't at the cabin where you were supposed to be, she broadened her search and eventually spied the campfire you had been tending. So here she is, approaching cautiously, because you now realize you haven't been behaving rationally.\n\n\nOr if this isn't Amy, then maybe it's either Wiry or Flabby?\n\n\nThe point is, you've lost control today: either of the world, or of your own mind, you can't tell. In this story of your life, you feel like you've become an unreliable narrator.\n\n\nThe best course of action, then, is to throw down this metal rod and make yourself known — to confront Amy, if indeed this is Amy, and try once more to find solid ground with your feet. Right now you worry your brain is still drifting aimlessly in the miasma of the cabin.\n\n\nAbandoning all efforts at keeping quite and unseen, you stand and toss the rod back where you find. It clanks loudly against the truck bed and bounces twice before coming to a rest. Thus you give away your presence to whoever is approaching the campsite.\n\n\nWhat are you doing?\n\n\n\"Amy, is that you?\" you say, stepping back toward the patch of forest within the fire's circle of illumination.\n\n\nYou are in danger, George! I am not in control.\n\n\nYou ignore the voice, knowing it is luring you toward the course of damnation. Instead you continue to step into the light, toward the approaching steps. \"I've been looking for you, sweetie. You've had me worried.\"\n\n\nBut what's wrong? Why isn't she responding?\n\n\nI tried to warn you.\n\n\nNo! Not that Amy! Why isn't the physical Amy responding?\n\n\nAre you mad?\n\n\nWell that's the question, isn't it? \"Amy, please speak to me! If I did something to upset you, please let's talk about it! Just storming off—\"\n\n\nYou cut yourself off. If in fact a reconciliation will be needed, best not to open with an accusation.\n\n\nRemember, George. I'm not the one in control.\n\n\nStill, her voice — your only response so far. Why is she doing this? Why is she only communicating with you in this manner? And what does she mean: she's not the one in control?\n\n\nShe has stopped approaching, and is still waiting in the darkness. You cannot comprehend her behavior. Is she weighing something? Did you inadvertently do something so thoughtless and insulting that she still hasn't made up her mind whether she wants to talk to you?\n\n\n\"Come, let's sit by the fire,\" you say. \"We can talk.\"\n\n\nBecause you're tired of being in the dark, you reach up to your forehead to turn on the headlamp. As you do so, a small conical section of forest becomes illuminated. And the figure you find standing there most definitely is not your girlfriend.\n\n\nSure, in a vague way, there is a striking resemblance, although it might not help your relationship to admit as much out loud. The figure before you, which had been watching you from the shadows, has a human's basic body plan, in that it walks upright on two legs. And it is roughly the same height as Amy, with the same willowiness to its limbs.\n\n\nBut there the resemblances come to an end, because this… thing is not human. The head is feline, and the fingers are tipped with claws. The brown fur is damp with blood — but not its own blood, you think. It's the splatter from a recent kill.\n\n\nThe former douchebags, Wiry and Flabby, no doubt. And this here is what they had come to slay: the Thilykotherium, their She-Beast.\n\n\nNow that you have seen each other, the Thilykotherium tilts back its head and shrieks into the night — a feral call, perfected over millions of years of evolution to paralyze prey animals with fear.\n\n\nI will remember you, George. I am not the one in control. You are in danger.\n\n\nAt that precise instant you make the connection. But by then it is too late — the Thilyko is making its lunge, claws held up, prepared to be brought down in a flesh-tearing motion.\n\n\nThen she adds: I wish you had listened.\n\n\nThat's how you know this is truly her — her last words to you are not ones of concern, but ones of criticism. This is Amy's parting message as the thing her body has become propels itself toward you, a predator about to make its next kill.\n\n\nTHE END", "action_results": [null]}, {"action": "Nothing about this night has gone as expected. People have gone missing. Heed the warning and prepare to defend yourself.", "result": "You need to believe me, Amy's voice says.\n\n\nI am in danger — I know, you told me already. But why? This whole thing is freaking me out, sweetheart. I don't understand what's happening here, and you aren't exactly being informative right now. \n\n\nShe doesn't respond right away, and you regret that last snarky comment the moment the thought occurs. Communicating between the two of you had been hard enough back when it was merely words you had to edit, keeping your true thoughts safely to yourself. Is that the peril she's trying to warn you about: her newfound ability to read your mind? That, indeed, would be fatal to your relationship. You might just as well start hitchhiking home now.\n\n\nThe footsteps come to a halt. She is still beyond the range of the campfire's light, and you cannot see so much as her shadow.\n\n\nPlease, tell me: why am I in danger? Why are we communicating like this?\n\n\nI know where you are.\n\n\nAmy, I don't want to have to—\n\n\nI know where you are, she repeats, but it doesn't.\n\n\nIt?\n\n\nI am not the one in control. It is looking for you, but only I know where you are.\n\n\nThe voice is hers, but the diction is oddly stilted, like she is trying to convey her message using a limited vocabulary. It's unlike any conversation the two of you've ever had before, even some of the less pleasant ones over recent months. But what is it she's trying to tell you? She's speaking of a duality: \"I am not the one in control.\" Of herself, she means. \"I am looking for you; when I find you, you must kill me. Only I know where you are.\"\n\n\nHoly heaven, what is happening here?\n\n\nIt is looking for you, she says again. You must misdirect it, George.\n\n\nMisdirect it?\n\n\nIt doesn't know where you are. If it finds you, I cannot save you.\n\n\nI need to send \"it\" in the wrong direction? (You still aren't sure what \"it\" is.)\n\n\nYes. Then you must kill me.\n\n\nThat last part might be difficult, sweetie. I wish you'd come up with another way out of this.\n\n\nWe have already killed tonight. This cannot continue.\n\n\nSo… how does one get his being-who-is-not-his-girlfriend to go in the wrong direction? You ponder the options, and decide you'd like to have a glimpse of whatever it is Amy has become. The campfire is beginning to fade without anyone to tend it, but it is still the only source of light in the vicinity. You reach into the leaf litter for a stick yea so big, find one, and then silently hurl it back toward the tarp tepee. It lands with a conspicuous thud.\n\n\nYou hear an odd grunting sound where the footsteps had stopped, and then not-Amy moves to investigate. And then you see her: a figure that still very much resembles your girlfriend, but decidedly isn't. The creature walks on two legs with a willowy grace you'd recognize anywhere, but with feline wariness. Her body has become overgrown with a fine fur, and the claw-tipped fingers are unmistakable.\n\n\nThis must be the Thilykotherium your two douchebag friends had told you about, the creature they believed was a failed NATO experiment, a would-be tool in the United Nation's nefarious plot to take over the world. But as tenuous as their grasp on reality had seemed, they were at least right about the existence of the creature.\n\n\nExcept that Amy, to best of your knowledge, has no direct connections to NATO. What brought about such a massive transformation of her body in such a short amount of time? Everything about what you're seeing defies your understanding of how the natural world operates.\n\n\nNot-Amy steps into campsite, her muscles tense, hair stiff, as she investigates the noise you just heard.\n\n\nRemember me, George.\n\n\nHoney?\n\n\nI didn't want to kill.\n\n\nShe must mean Wiry and Flabby; when last you saw them, they were heading off to slay their monster — this Thilykotherium as they called it, or not-Amy as you would prefer to call it. You heard their gunshot, but they never came back — only not-Amy did.\n\n\nThere's no other way? you plea.\n\n\nYou can't let it see you coming. You are in danger, George. I will kill you if you don't kill me.\n\n\nShe feels trapped inside her own body, a witness to her own atrocities, her sense of self being blurred at the boundaries with this thing she has become. But kill her? Even in this present form, you're still in contact with her. There must be something left that can be saved, right? A way to undo the changes?\n\n\nNow, George. You must kill me. I am not in control. George, remember me. Now, George. George, please. You must kill me. I am not—\n\n\nThe creature has seen the tarp tepee and is approaching it, the smell of poorly-stored food more than any half-wild being can resist. As it does so, its back is turned to you.\n\n\n—me. George, please. I am not in control. I didn't want to kill. I—\n\n\nYou catch the creature at the entrance to the tepee, bringing the metal rod down across its shoulder blade. The bone cracks, and not-Amy shrieks in both surprise and pain. You expect the creature who is occupying Amy's body to turn and retaliate, but instead what happens next is completely unexpected.\n\n\nNot-Amy falls to the ground and begins to thrash about wildly — not at you, not at anything in particular. It looks like it's having an epileptic fit, the broken arm frozen close to its body but the other limbs flailing out of control. The torso is inside the tepee, and Bud Light cans are knocked noisily aside, structural poles knocked out of position. You worry that the tepee might collapse on the creature, who is acting like the injury you inflicted was far worse than you thought.\n\n\nThen, after what seems like a long minute, the Thylikotherium features melt away. Claws revert to fingernails, fangs revert to canines and incisors, fur falls away to reveal only skin. And when the process is completed, it's only Amy you see sprawled half inside the shelter, her shoulder broken and covered with an ugly bruise. But alive, no longer a She-Beast.\n\n\n\"I didn't want to kill…\" she says, whimpering into the dirt. \"George, please…\"\n\n\nIt's her real voice — her real, honest-to-goodness voice, and not just a whisper inside your brain.\n\n\n\"Babe, I'm right here,\" you say, dropping the metal rod. You kneel down beside her inside the tepee.", "action_results": [{"action": "Next page.", "result": "he helicopter is flying low over the summit of Deadman Mountain, heading straight for the lake. You wave from the deck of the cabin so the pilot can see you, although that's probably not necessary. This building, this clearing, must be conspicuous in the sea of trees.\n\n\nTo your surprise, though, it's not the blue-and-yellow state helicopter you've seen flying over the Adirondack landscape in the past. This one is painted in a solid block of a paint scheme, dull green from nose to tail rotor. Military, beyond a doubt — a Black Hawk from Fort Drum, probably. Agenda 21? You suppress the thought, embarrassed you even had it.\n\n\nThe Black Hawk zeroes in on the cabin and comes into position above the clearing beside the cabin, hovering just above the treetops. You expect a team to rappel down on cables or something, but to your surprise the helicopter descends for a landing. The space is tight, but just big enough, and the Black Hawk comes to rest in a swirl of leaves.\n\n\nYou weren't really sure what to expect when you activated the SPOT device. You had found it last night in the gear left behind by Wiry and Flabby, a little orange handheld unit designed to do a single thing: send a signal when you are in distress so that the authorities may find you. Amy was as comfortable as you could make her, swaddled in the sleeping bags and extra clothing stored in the tepee; her shoulder was severely painful, and more than a match for the regular-strength ibuprofen you were feeding her. It was tempting to press the SPOT device's button then, except that you doubted anything would happen in the middle of the night. And so you waited until morning.\n\n\nThe military, though? You've never used a SPOT before and didn't know what the protocol was. Now, as you watch a team of soldiers disembark from the resting Black Hawk, you note with curiosity that not a single person is a forest ranger, or a civilian of any kind.\n\n\nYou also note that several of them are wearing gas masks. This team rushes past you and barges into the cabin, fully armed. They emerge a moment later from one of the other doors, and the squad leader shouts an \"All secure, sir!\" back toward the helicopter.\n\n\nA man wearing sunglasses and a warm parka emerges from the posse of uniformed soldiers and approaches you. A name tape announces him only as KAPLOWSKI. The parka is partly unzipped, and you see black silhouette of a spread eagle sewed onto the chest of his duty uniform.\n\n\nHe doesn't introduce himself. \"I must admit,\" he says instead, \"this was not how I expected to begin my day.\"\n\n\nColonel Kaplowski walks a full circle around you, assessing you up and down. \"You don't look injured, son. Would you mind explaining the nature of your call for assistance?\" He stresses nature like it's a distasteful word to him.\n\n\nThis is a delicate moment, one which you've been pondering ever since you found the SPOT: how, exactly, do you explain what happened? Amy is still up in the tepee, resting as comfortably as she can, but in no position to hike the ten miles back to her Jeep. She's dressed in ill-fitting men's clothes, because she shredded your own backpacks when she was still in her Thilykotherium form. Both of you discussed it to pass the long, sleepless hours that followed your ordeal, and you agreed that certain aspects of your experiences here might be difficult to explain.\n\n\nNot that you could explain it to yourselves: something bit her on the shin? Caused her to transmogrify into a… what would you call that, not a werewolf, but maybe a \"werecat\"? Is that a thing? And then the severe pain of the broken bone caused her to revert back to Amy? Throw into the mix the two would-be werecat hunters, and you have the ingredients of a story that makes no logical sense whatsoever — even to the people who lived it.\n\n\n\"I'm very grateful you came!\" you begin. \"My girlfriend and I were backpacking through here—\"\n\n\n\"Backpacking?\"\n\n\n\"Yes, sir. And she fell and broke her shoulder, and—\"\n\n\n\"Where is she?\"\n\n\nYou show him the trail leading toward the old Jeep truck, which is much easier to see on this sunny morning. Had your plans not been so surreally derailed, this would've been Day 2 of your four-day trip, and by all appearances a glorious day for hiking.\n\n\n\"Parsons,\" the colonel says to one of his crew. \"Go check that out.\"\n\n\nA team of medics runs up the trail to go attend to Amy.\n\n\n\"And Reynolds, go recover those two bodies we spotted from the air.\"\n\n\nAnother team of soldiers disappears down the overgrown driveway.\n\n\n\"Now, you were saying, son?\" Colonel Kaplowski says.\n\n\nYou try and make up a story on the spot: the rain sent you into this old cabin here seeking shelter for the night, but when the rain let up Amy wanted to explore, and she found the old Jeep parked forever in the woods, and because she owns a Jeep too she wanted you to take her picture sitting on top of this one, but it was slippery, so when she climbed up onto the hood she lost her balance and—\n\n\nBut the colonel decides he's heard enough. \"None of this, though, explains what you were doing on military property. This is a prohibited area.\"\n\n\nIt is all you can do to control your reaction. Two words ring in your mind like an alarm bell: Agenda 21.\n\n\nSoon the medics are returning from the woods, Amy supported on a stretcher between them.\n\n\n\"Set her down here,\" Kaplowski directs them.\n\n\n\"Sir, we found this near the female.\" A sergeant hands the colonel a clear plastic bag with a sample of animal fur — or rather, the Thilykotherium fur that Amy shed when she metamorphosed back into human form.\n\n\n\"Interesting,\" the colonel says, putting the packet into a pocket.\n\n\nAnd as you stand between the cabin and the Black Hawk, you watch as practically all of the evidence from the prior evening is gathered by fast-moving soldiers who all seem to know exactly what to look for. When they're done, your shredded backpacks and the plastic-covered bodies of Wiry and Flabby are loaded onto the Black Hawk, the latter retrieved from wherever it was not-Amy had slain them.\n\n\nAn aide comes up to the colonel. \"We're ready to take off, sir. Just waiting for your order.\"\n\n\n\"It will be a moment, captain.\"\n\n\nColonel Kaplowski gestures, and a pair of armed soldiers fall in behind him. They are still wearing their gas masks. \"Let's take a look at this facility,\" he says. \"And bring the lady too.\"\n\n\nHe enters the bunk room, and with the soldiers forming a rather insistent wall behind you, you understand that you are to follow. The medics lift up Amy's stretcher, setting it on top of a picnic table. After your experiences fourteen hours ago, the dankness of the room is an assault on your senses, sort of like the taste of cheap whiskey the morning of a hangover.\n\n\n\"Before we provide you the treatment you need, there is something we need to address,\" the colonel announces from beside the Naugahyde recliner. \"We understand that you two experienced some very… unusual events. Events you weren't intended to witness. So before we return to base, we think maybe the air here might do you good.\"\n\n\nThen he turns to the two gas-masked soldiers. \"They should already have high concentrations in their system. Fifteen minutes of additional exposure should be sufficient.\"\n\n\n\"Yes, sir!\"\n\n\nAnd then the colonel, who isn't wearing a mask, steps out the door and hops casually down off the deck.\n\n\nYou don't protest, you don't resist. The colonel was right: you know too much. And the \"miasma\" in this room will help you forget all of it, the way it effected a partial erasure of your memory yesterday.\n\n\nBy the time the fifteen minutes are over, both you and Amy are unconscious, your lungs filled with NATO's experimental miasma. The soldiers load you onto the helicopter and it takes off to the northwest. When you awake hours later, you don't remember a thing about your hike.\n\n\nTHE END", "action_results": [null]}]}]}]}]}]}]}]}]}]}, {"action": "Look behind the woodshed.", "result": "As you parallel the edge of the clearing over toward the woodshed, a certain sense of absurdity strikes you. What if nothing is really the matter, and Amy is just… well, still \"indisposed\" might be the polite way to put it. Nothing is necessarily wrong — nothing that concerns you, anyway — and she can hear you just fine. She just doesn't want to be found, for legitimate reasons.\n\n\nHa! If that's true, then you'll have a hard time living this one down for the remainder of the trip. Or, in keeping with what seems to be the recent trend, you'll just irritate your girlfriend all the more, supplying her with more ammunition to use against you, keeping you perpetually on the defensive.\n\n\nThe problem is, none of this really seems to explain why so much time has passed since you last saw her, and why she doesn't respond now. There is a gulf between what you want to believe has happened and what you really think; the effort to laugh away this building sense of dread seems way too thin.\n\n\nYou are beside the woodshed in just three paces. It is long and low, with a roof that you can reach quite easily without even extending your arms that high. Except for a few empty cans of cheap beer and some spent shotgun casings, the shelter is empty. The walls and roof were made with panels of corrugated aluminum, which appear to be newer and in better shape than those that constitute the roof of the camp itself. Indeed, it might still be a useful shelter… had someone not shot through the sides with a shotgun. Someone must've used the shed for target practice, making half a dozen starburst patterns of little BB holes. You can't help but wonder: did shooting the woodshed increase the gunman's sense of manhood? The fact that he chose such a large and easy target, though, doesn't say much about his marksmanship.\n\n\nA little gust of wind strikes the knoll, and the surrounding trees shudder briefly. Those above the aluminum shed shake some of their burden of rain water onto the roof, the drops tapping loudly against the thin metal.\n\n\nThe shed stands at the edge of the clearing, the forest beginning behind it. But between the metal wall and the trees is a narrow space that you can easily walk through. Before rounding the back corner of the structure, you tap the wall with your hand.\n\n\n\"Amy? Are you back here?\"\n\n\nAs before, there is no answer. Stepping around the corner, you are stopped by—\n\n\nAn old kitchen stove?\n\n\nIt's an old model, maybe from the 1940s or 1950s judging by the quaint dials, that probably cooked its last meal in the camp before being replaced by a less-ancient model. Then it was placed out here to decay in hiding, out behind the woodshed — except that it was so solidly built that nature has accomplished little more than to cover it with a few brown leaves.\n\n\nThis is a curious find for sure, but you're not here looking for antiques. The most salient thing you have learned is that Amy is not here.\n\n\nIt's frustrating, really, not knowing. In your search for your missing girlfriend, you feel as though you've just eliminated a couple options, but that you have an entire wilderness yet to scour. You scoot around the old gas range and continue following the rear wall of the woodshed to its far end, wondering with little hope what you should try next.\n\n\nWhen you return to the open, you are arrested by the sound of something stirring on the far side of the cabin. A screen door closes, and feet descend three wooden steps. It's not the bunk room door that you're hearing, or the door that opens onto the sagging deck; you can see both of those entrances from this angle, and there is no activity at either one.\n\n\n\"Amy, is that you?\"\n\n\nNot only is there no response, but the sound of movement abruptly stops.\n\n\nYou freeze too at the realization of something you hadn't previously considered: You and Amy had never been alone in this forest!\n\n\nIf that's not your girlfriend behind the cabin, trying to be all sneaky, then clearly someone else is here. They had been inside the cabin and are now departing through the back door.\n\n\n\"Hello? Who's there?\" you say, changing your approach. There's no point in trying to hide your own presence; you've already been calling out Amy's name, and your headlight is still on its highest setting. The whereabouts of you are no mystery.\n\n\nStill, there is no response, and you are unsure what to do. Certainly, you do not feel safe. The corner of the cabin is just twenty feet away, concealing whoever it is that's standing there. You can approach the person, or you could just go back inside, letting your unknown visitor slip away without confrontation.\n\n\nThose are the options you come up with. Neither strikes you as being terrific.", "action_results": [{"action": "Confront the person.", "result": "\"Hello?\" you call softly again, unable to conceal the anxiety in your voice. \"If this is your camp, we didn't mean to intrude!\"\n\n\nYou proceed cautiously as you speak, knowing that a confrontation is inevitable but not wanting to rush it. Maybe this is just Amy, but you strongly doubt it. On the other hand, you can't shake the notion that if there's someone else out here tonight, their presence has something to do with Amy's disappearance. If you're about to come face-to-face with a serial killer…\n\n\nAll right, let's not get melodramatic! you tell yourself.\n\n\nStill, you'd feel less exposed and vulnerable if you had something in your hand, other than a bad scrape from the door handle. None of the junk lying in your path looks terribly useful, though. Or portable, for that matter.\n\n\nThe person remains silent, which doesn't do anything to put you at ease. Instead, they seem to be silently anticipating your approach. Either they're afraid of you, or by stalling they're intentionally making you come to them.\n\n\nAnd if they aren't going to meet you halfway, then what else can you do? You feel a desperate need for answers, which you apparently aren't going to get any other way.\n\n\nYou reach the corner of the cabin, take a deep breath, and then make the turn.\n\n\nIndeed, your headlamp beam quickly finds its target in the dwindling twilight — but your visitor is no human. Before you stands a figure tall and bipedal like a person, but fur-covered like a beast. There are claws at the tip of each appendage, and fangs reflected in the light emanating from your forehead. Its eyes are black and colorless. Nothing like it should exist, and yet there it is, more willowy and feline than any depiction of Sasquatch you've ever seen, but also more real and tangible.\n\n\nThe creature flinches at the brightness of your headlamp, and then shrieks to voice its displeasure. Its voice is feral, predatory, like the sound of a thousand murders. And then it crouches slightly, coiling its limbs before it pounces.\n\n\nWhat else can you do but run? And where else is there to go but back in the direction from which you came? You have no idea if you can even outrun such a… whatever this is. But you doubt lying down and playing dead is such a good idea either. Therefore you sprint in the direction of the overgrown driveway, away from everything you've found at this god-forsaken place.\n\n\nAnd behind you is the creature, running fast. The best you can do now is hope that your speed holds out and that the thing pursuing you can be outsmarted.", "action_results": [null]}, {"action": "Go back inside the cabin and leave well enough alone.", "result": "Everything about this situation seems threatening. The person was leaving on their own, so why risk a confrontation? You have no doubt this person, whoever it is, can shed some light on what has happened to Amy, but at the same time they aren't being too communicative. Therefore the sanest course of action seems to be to retreat inside the cabin, and maybe figure out what it was this mysterious visitor was doing there.\n\n\nInstead of rounding the corner of the cabin, then, you go in the opposite direction: toward the deck. It's rough surface comes up to your waist, and there are no steps. You have to climb atop it to reach the door, and the only way to do so is to thrust yourself up on your hands, doing your best to avoid the exposed nail heads; the scrape on your palm protests anyway, but it's a momentary discomfort. You swing a leg up and over the edge, cautiously looking back to see if you're being followed.\n\n\nIndeed, once more you hear the sound of footsteps across the piece of metal roofing. One step, two steps on the metal, then softer steps across the ground.\n\n\nThis makes you all the more eager to get inside the cabin, taking advantage of what meager shelter it might be able to provide. The door is still wide open, and you step through it and beside the Naugahyde recliner.\n\n\nThen you see what's left of the two backpacks: they've been shredded, as if clawed by a bear.\n\n\nBut it's not a bear that's circling the cabin now, though. You're hardly a wildlife expert, but you're certain of at least this point. Your visitor wasn't here to steal your gear, but apparently just to destroy it, as if in a mindless rage against backpacking equipment. Both packs have been sliced in parallel gashes down their front sides, with packets of freeze-dried food and articles of down clothing being the secondary casualties. Feathers and rice bleed out from both packs onto the floor, like the entrails of these two disemboweled creatures.\n\n\nYour tormentor is striding past the deck, still not saying a word. It is too dark to see a thing now, and if your visitor hasn't spoken a word to you yet then you don't know what you should say. Good evening, glad to make your acquaintance? No, you doubt this is a social call. You still don't know completely what happened to Amy, but now it's you who is facing the most immediate threat. And this rotten old hunting camp no longer seems like an effective barrier against anything. Instead, it looks and smells more like a fetid tomb.\n\n\nThe person stops beside the deck, pauses for a chilling moment, but then continues around a corner of the cabin. As you follow his footsteps, one by one through the weedy grounds, your attention is drawn to the big picture window on the other side of the twin tables.", "action_results": [null]}]}]}]}, {"action": "Wait inside the cabin.", "result": "You have no idea what is going on, or what Amy might be up to. But the sound of footsteps outside the camp, with no response when you called out, is just a tad disturbing. Nothing can be seen through the storm door's window, though, and with the absence of visual evidence it becomes easier to begin doubting your interpretation of what you heard: maybe it was just a squirrel returning to its hidden burrow somewhere in the walls of this fetid building. Maybe it was just a natural phenomenon, some trick of the shower even as it begins to pass from the landscape.\n\n\nMaybe, too, the problem is not external. You step back from the door, seeing the bunk room for a second time: the stains in the wall and ceiling where another leak must be developing, beginning the process that has already reached an advanced stage of decay out in the front room. The faux-pine paneling, smashed in a rage before being abandoned altogether. The drywall that had been shattered completely in the next room over.\n\n\nAlthough you haven't seen her in over half an hour, it is like you're beginning to see this place through Amy's eyes, not yours. To you, this was a place that told a story, even if you weren't aware of the specific details. Clearly somebody built this place, spent a bit of time here, and then left under unknown circumstances — circumstances that might not've been entirely pleasant, judging by the willful destruction. The cabin might not be within the pale of a typical wilderness experience, the unmediated contact with nature the two of you had been deliberately seeking out this weekend, but to you it was a stimulating discovery.\n\n\nAmy, on the other hand, saw an abomination: the collapse of hygiene, the spread of filth. To her, the moss growing on the floor was not a picturesque image of Nature reclaiming a Work of Man, and the mouse turds on the table were not something you could sanitize simply by brushing them away. The deterioration on exhibit here had been eliciting from her a deep-rooted reaction, perhaps a revulsion that had been implanted throughout western civilization centuries ago in the aftermath of the Black Plague: a cultural fear that equated rodents and squalor with an undignified, disease-filled death.\n\n\nPerhaps, then, the wretched condition of this camp is also acting on your imagination in ways you didn't think possible, inflaming inner anxieties you never knew you harbored: a harmless little rodent skitters across some rusted sheet metal outside the door, and you imagine monsters. If that's the case, then you better get a grip. It wasn't that long ago you were trying to deflect Amy's growing doubts with your own boyish optimism; now, though, you have to wonder if her prolonged absence is transferring some of her anxieties over to you. Well, you're not too sure you want them. She better return soon so she can have them back.\n\n\nYou make your way back down the hall toward the big room with the picnic tables, not sure what you should be doing with yourself while you wait for Amy to return. Or for that matter, how long you're supposed to be waiting. It's late in the day, and you've hiked ten miles to get here. In other words, you're hungry, you're bored, and you feel a distinct desire to make yourself useful while you wait for Amy to return.\n\n\nMaybe you can satisfy all these needs by beginning the process of making dinner. After all, everything you need is right here in these two packs — everything except the water for cooking, which you should be able to get from the lake. Your pack has the Jetboil stove and the cookware; Amy has the bag full of freeze-dried food. It will be dark soon, and as things stand now you'll be looking for a campsite much too late. At least this way, one of the day's key tasks will be completed more or less on schedule.\n\n\nYou can't do it here, though; Amy would lose her appetite if she returned to find you preparing a meal in this squalid environment. Where else can you go? With the shower finally tapering off, the deck just outside the door is a workable option.\n\n\nBut there's a risk: Amy could return at any moment, and she'll want to vacate these premises almost immediately. Maybe you should start the dinner-making process, or maybe you should just wait.", "action_results": [{"action": "Begin making dinner.", "result": "The sitting-and-waiting option just isn't going to cut it for you, and so without hesitation you open the tops of both backpacks to pull out the necessary items — and just the necessary items, lest Amy accuse you of forcing the issue of spending the night inside the cabin. In two trips you carry the stove kit, the cook set, and the food bag out onto the deck, and then go back for your headlamp when you see that the day's light is already growing dim.\n\n\nWilderness cooking is typically a simple affair: you heat water until it boils, and then you pour it over something dehydrated. Your little cookstove is single-purpose in this respect, capable only of boiling water in the shortest time possible. The deck will work fine as a surface for setting it up, no more or less rustic than if you were working on a log somewhere or on a lean-to floor; though part of the cabin, it extends far enough from the dank atmosphere within its walls that even Amy shouldn't have cause for complaint.\n\n\nThe one missing ingredient is the water; you both have water bottles, but that's for drinking and you'd rather not deplete that supply yet. There is an entire lake down below you haven't even seen yet, though, and so you open up the nested cookware set and pull out the cylindrical pot. With this in hand, you make one last look around to see if there's any sign of Amy, and then you venture forth to find a path down to the shore.\n\n\nA \"path\" doesn't really exist, not in the form of a cleared walking route. This place has probably been abandoned too long for that; any maintained path that might've existed in the past has since grown over. The best you can find is a \"path of least resistance,\" a gap in the new growth of trees through which you can descend the bank without much difficulty. Discarded beer cans and bottles, all of them looking quite old, seem to mark the way; this litter gives you the impression the people who used to camp here did nothing but drink and toss the empties toward the lake, as if all this natural beauty was more than they could handle.\n\n\nAt the bottom of the knoll, you find some rocks at the edge of the water that provide you the access you need. You stoop down and fill your pot with a small portion of Shingle Shanty Lake's bounty, thus accomplishing the basic parameters of your mission. But before you boogie back up the hill, you want to take a look at this stunning place: Deadman Mountain to your right, Cloudcap straight ahead, nearly two miles of uninterrupted lake with wild shorelines on each side. Gorgeous! It looks like a large wetland sprawls across the far south end of the lake, a likely hiding place for moose.\n\n\nThe climb back up the hill is difficult to complete without some of the lake water sloshing out of the Jetboil pot. Simply because it makes no sense that Amy should still be absent, you anticipate seeing her when you return. Will she even explain why she was gone so long, or just decide it's none of your business?\n\n\nBut Amy is not what you find when you return to the camp at the top of the knoll.\n\n\nThe first thing you notice is that the stuff you had placed on the deck is missing. Well, OK; that probably means Amy did return, decided she firmly has no interest in staying, and repacked the gear. She's probably inside the cabin stowing the food bag back inside her pack.\n\n\nHowever, this theory blows up when you find the Jetboil stove knocked over on the ground below the sagging deck, and a trail of rice leading back inside the cabin door. If Amy did that, then she's acting out some kind of unexpected vengeance that could threaten your entire weekend. Really, is she's so upset over something, then what does she expect either one of you to eat these next few days if she acts out her spite by dumping your food on the floor?\n\n\nExpecting the need to address some unknown grievance on her part, you set the pot down and hop up onto the deck. The inside of the camp has grown dim enough now that your eyes take too long to adjust to the low light, so instead you turn on your headlamp.\n\n\nThere is no sign of Amy… but if she did come back from her \"field trip,\" then she is working out some serious issues.\n\n\nThe backpacks have been shredded. Both of them, sliced in the way you might cut into a baked potato, random contents strewn across the floor, including the down stuffing from at least one sleeping bag. It is like she took a knife to the packs and hacked at them in a wild frenzy, occasionally missing and slicing the table instead. All in the few minutes you had been outside fetching water.\n\n\nWhat the hell has gotten into that head of hers? What could you have possibly said or done to her to warrant this kind of treatment?\n\n\n\"Amy, this isn't funny!\" you shout, hoping she can hear you. \"I'm tired and hungry, and I feel like crap! Now get back in here and let's behave like adults again!\"\n\n\nAt first you think there is once again going to be no response, that you are shouting in vain to someone who has decided to stop speaking to you. Then you notice the third door to the cabin, the one located in the smashed-up kitchen. It had looked securely shut when you first inspected the place, but it is now swinging open — as though it has been recently used. There must be wooden steps there, too, because right now something is walking down them, causing the wood to creak in sequence.\n\n\nNo one speaks, though. The only sound is a soft, beastly grunt — and for the first time it occurs to you Amy might not be the culprit who destroyed your gear.\n\n\nAnd if that's the case, then Amy's strange disappearance might also have a deeper, more sinister explanation.\n\n\nWith a chill vibrating through your body, you turn off the headlamp. Then you step around the wall of bare studs into the trashy remains of the kitchen, no longer certain what you're going to find. Spiteful girlfriend acting on some long-festering grudge? Mysterious stranger trying to spook the witless intruder? Black bear attracted by the smell of food?\n\n\nEntering the room, the cluttered sink is straight ahead, with a wall to the left that hadn't been completely smashed when this place was abandoned. A garden rake dangles from the sheetrock, its metal teeth embedded in the plaster surface, and a mouse-eaten box of Triscuits sits in a pile of scrap wood below. A word has been scrawled in capital letters across the wall, below the rake:\n\n\nTHILYKOTHERIUM\n\n\n\nThe letters are black scratches, as if written with charcoal. You have no idea what it could possibly mean — or whether it was even there the first time you examined this room.\n\n\nBut does it matter? Whatever you heard descending those steps is now moving away through the brush outside the door!", "action_results": [{"action": "Grab the rake, in case you need to defend yourself.", "result": "Nothing about this situation seems right, and regardless of who (or what) is out there, this intruder has destroyed your backpacks — and maybe even inflicted harm on Amy. You have no choice but to follow, but you're not about to do so without the rake in hand. It might not be an axe or a shotgun, but it's the closest thing to a weapon you can find.\n\n\nThe garden rake looks solid, certainly more intimidating than any of the broken kitchen knives left behind in the dry sink. You grab the long wooden handle and pull, but the steel teeth are maintaining a firm grip on the sheetrock. THILYKOTHERIUM you read again. A warning? A code? It looks like Greek or Latin, the type of taxonomic name a researcher might assign to a genus of wild animals; maybe a team of ornithologists were here, recording an encounter with some rare species of sparrow.\n\n\nAs you work the rake head out of the wall, you worry that the process is taking too long, that your mysterious intruder is getting away. By rocking the handle the sharp metal teeth work their way free, allowing you to heft the rake in your hands. Now you can go see what's out there.\n\n\nThe door is slowly swinging closed in a draft of air, so you kick it open, the headlamp still off. You step carefully onto the back steps, and once at the bottom you are waist deep in goldenrod and dogwood, the rake held horizontally before you. The shower is now a memory, but there is still much drippage from the surrounding trees as the last light of day exits the woods.\n\n\nBefore you is the driveway that led you to this place. And moving straight through its brushy growth is a shadowy figure, about as tall as you are but otherwise of indeterminate identity. The only thing of which you can be certain: this ain't no black bear.\n\n\n\"Hey!\" you shout to the figure. It stops but doesn't turn. \"Why did you shred my stuff? What'd I ever do to you?\"\n\n\nStill, there is no response. The figure just stands in the open, as if waiting for you to approach it. Who is this guy? A cranky hermit, stealing to survive? Some fugitive from the law?\n\n\n\"I'm looking for my friend,\" you say, taking a step forward. \"Have you seen her? She—\"\n\n\nThat's when the figure turns. There is not much you can see in the gray light, but for a second, while the silhouette is in motion, you can make out a willowy profile that almost looks like Amy herself. But Amy this is not: the body looks fur-covered, as if a cat had learned to walk upright. It sees you standing in front of the cabin holding the rake and lifts its head to the night. The howl it unleashes is feral, hungry; menace is its message, rolling through the forest like the yowl of a coy-dog.\n\n\nYou shudder as a reflexive response, but then immediately regret the involuntary show of fear — if you appear vulnerable, this… thing is likely to react accordingly. Without thinking you raise the rake above your head and shout back — not an actual word, just a fearful noise of your own that you hope proves you're not going to be an easy target. The figure turns and runs into the woods, and before you can check your action or consider alternatives you are giving chase.", "action_results": [null]}, {"action": "There's no time — follow the intruder!", "result": "Do you really think you're going to Schwarzenegger your way out of this situation with a garden rake? You haven't the slightest clue who it is you're chasing, and of course you still can't rule out the possibility this is Amy. After all, she is the only other person you happen to know who is in this same proximity.\n\n\nAnd at any rate, time is limited. Forgetting the rake, you steel yourself for an encounter with whatever it is you hear outside. The door is slowly swinging closed in a draft of air, so you kick it open, the headlamp still off.\n\n\nYou almost don't see the figure, at least not until it steps out of a shadow. And even then, in the gray twilight it is little more than a silhouette. It looks like a person, not a bear: upright and willowy, wading through the browning goldenrod.\n\n\n\"Amy?\" you say, giving voice to your first suspicion. Indeed, there is a resemblance between the shadow before you and the memory of your girlfriend, and while her behavior has been inexplicable it makes sense it is her you see now.\n\n\nBut as the figure turns, you see its body is covered with fur, not clothing. What you can see of the eyes are all black, the face feline. A feral anger fills its features, and it looses a howl that haunts the forest with a predatory noise. Its wrath, of course, is directed at you.\n\n\nReflexes take over. With an unknown threat just yards away, your response is to run. But where? The steps are surrounded by a tangle of untended weeds, and the creature stands along the most obvious path. So without time to think you back toward the stoop, tripping over the very first step. Your adversary recognizes this moment of vulnerability and leaps in a cat-like pounce; panicked, you scramble in a reverse crab-crawl back toward the door of the cabin. The creature misses you by inches.\n\n\nThe cabin is all you have for protection, and boy do you wish you had that rake now! Barely balanced on your feet, you step inside the kitchen and try to close the door against your foe. But the barrier swings inside, and the creature pushes hard against it. There is no lock, and nothing within reach that would hold it shut permanently; unless you hold the door closed all night long with your body, this unknown hunter will get in.\n\n\nYou reach for the rake handle with one free hand, but the steel teeth are embedded too deeply into the sheetrock. THILYKOTHERIUM, you read again; perhaps you have a hunch now what the name means. The rake isn't ready to release its grip on the wall, and you don't have the option of stepping away from the door to throw your body into the effort like the child Arthur releasing his sword from a stone. If this door opens, you'd better be running!\n\n\nAs you do your best to keep the creature out, certain elements of the evening start to make more sense: Amy's disappearance, the footsteps outside the bunk room, the two shredded packs. These aren't exactly solid answers: you don't know what happened to Amy, and you have no idea what exactly it is pawing at the other side of this door right now. But clearly there is a link between these two circumstances, and you have no doubts about the murderous intent of whatever it is that's now trying to get in.\n\n\nForcing your body against the door all night long isn't going to be an option, so you need to come up with a Plan B quickly, while you still have the energy to act. As soon as you step away from the door this creature will be inside the cabin. The rake isn't going to be a help, at least not in the amount of time that will be available to you, and you can't think of any other object that might have any potential lethal uses. So that leaves only one course of action:\n\n\nRun.\n\n\nYou give yourself a count of ten. By \"three\" you're already having doubts, but by the same token you know you can't hold out against the creature's intensifying thrusts, either. So when the count runs out, you take a deep breath and flee from the kitchen.\n\n\nThe door bursts open behind you, and you realize you have a lead of mere seconds. Where exactly can you go? There are no hiding places in this cabin, not where half the walls are missing. Your only instinct is to run in the direction from which you've come, hoping that your speed holds out and that the creature pursuing you can be outsmarted.\n\n\nAnd so you spin around the wall of studs and down the short hall to the bunk room. You throw open the storm door and leap over the sheet of rusted metal, running toward the overgrown driveway like your life depends on it — because to the best of your knowledge, it really does.\n\n\nThe banging of aluminum and glass behind you tells you the creature is not far behind.", "action_results": [null]}]}, {"action": "Wait for Amy to return.", "result": "You decide it's best to sit tight. There is no logical reason for Amy to be gone this long, and at any second she should be striding back through that door. Now that the shower seems to be breaking up, she'll be eager to go find a proper campsite; if you have the stove running and water boiling for dinner, that will delay your departure and irritate her more than she already is.\n\n\nAny second now, you repeat to yourself. She'll be coming through that door. Yep, any second.\n\n\nOr maybe any minute?\n\n\nBut frankly too many of those have already gone by; whatever it is she's doing out there, she's burning daylight for both of you, and there is really hardly any of that left. This delay is starting to become infuriating, although you feel helpless to do anything about it. You're sure there is a rational explanation that will make sense when she returns and tells it to you, but you can already envision her making you feel it's your fault later, when the two of you are trying to find a campsite in the dark.\n\n\n\"If only we had gone someplace with a lean-to and a privy,\" the imaginary Amy is grousing to you an hour from now, \"I wouldn't've had to walk a mile in the woods just to find a place to pee!\"\n\n\nThe future you won't question why she had to be so finicky, not openly anyway. Future you will just try to be amenable for the sake of not letting a taunt become an argument.\n\n\nStill, that's a vision of the near-future that seems vaguely pleasant, if only because it implies the return of Amy and an end to all this pointless waiting. It implies she will allow you to complete this current moment and proceed to the next one. By sitting here, you feel as though she put you on pause when she left, freeze-framing her George while she stepped away so she can resume this show later, right where she left off.\n\n\nTo escape the dank atmosphere of the cabin, which seems to be seeping into your mood, you step back out onto the deck with its planks of softening wood. You cup your hands around your mouth and shout.\n\n\n\"Amy! Where are you!\"\n\n\nYour voice wafts across the lake in the opposite direction of the wisps of mist that now follow on the heels of the shower; it echoes faintly off some distant surface, as if someone else were also looking for Amy a few miles away.\n\n\n\"A-a-a-amy-y-y-y-y!\" you shout even louder.\n\n\nHow nice it would be to have a reply. How novel, even. But aside from your distant echo, no other voices emerge from the wilderness. It is like you are alone in this gigantic landscape, this place where people build cabins, trash them, and then disappear never to return.\n\n\nIt is a disturbing notion. Perhaps you need to begin to expand the range of possibilities of what might've happened to Amy, and that for reasons yet unknown neither her reply nor her return will be forthcoming. It's like some old movie you saw once, but can't fully recall at the moment: she is unable to reply, or she is unwilling.\n\n\nJust like that, your girlfriend's prolonged, unexplained absence becomes a mystery. If something happened — if something is wrong — then doesn't that shift a great deal of responsibility onto your shoulders? After all, you're her companion, as well as the only known person for miles around.\n\n\nOnly known person.\n\n\nNow there's a chilling thought! What if there's an unknown threat you had not even considered until this moment?\n\n\nIt would be tempting to dismiss that idea as a paranoia-filled theory, but just as your chain of thoughts are ramping up into disaster-coping mode you hear the footsteps again.\n\n\nBefore, you had heard something outside the bunk room door — or thought you did anyway, stepping across the sheet metal. Now, there is something big moving through the trees lower down the knoll, between the camp and the shoreline. Two steps at a time, not four, like someone is moving around the brush trying to get a better look at you.\n\n\n\"Amy?\" you say, almost certain this is the incorrect guess.\n\n\nOf course there is no response. That makes the situation even more tense. You back into the cabin cautiously, but there are no further steps. It might just be a deer. It might just be a deer. It might just be a deer. But this litany isn't providing too much peace of mind. You reach the picnic table with the packs, quietly unzip the top of yours, and pull out the headlamp.", "action_results": [{"action": "Investigate the noise.", "result": "The headlamp has an elastic band that fits snugly around your head. You turn it on to the brightest setting, even though it's still twilight outside. It might just be a deer. It might just be a deer. It might just be a deer, you continue to tell yourself. And if that's the case, you want to blind the sumbitch.\n\n\nWhen you return to the deck, you pause to see what else you can hear. Nothing, as it turns out, and you're not quite sure what to make of that. Is somebody lying in wait, or is there really nothing to be heard? By turning your head back and forth you point the beam of light down the tree-covered slope, but all you can see are the trees you already knew were there.\n\n\n\"Who's down there?\" you say as firmly as you can. A slight gust rattles some leaves somewhere, and you accept that as the only response you're likely to get.\n\n\nYou jump down from the deck and look for a good way down. To be honest, it doesn't look like a fit place for a person to be; the bank is steep, and those spruce and balsam trees look thick. If you don't lose your footing and slip, you'll get tangled in the branches — and if you're extra unfortunate, both will happen.\n\n\n\"I know you're down there!\" you say. \"You're not fooling anyone!\" But the sad truth is, of course, you have no idea who (or what) you're trying to intimidate.\n\n\nThe headlamp shows you nothing, just more trees, the same way turning your bright headlights on during a snow squall just shows you more snow, not more of the road. But now that you can see this bank — the approximate place where you last heard the footsteps a few moments ago — the less willing you are to go down it.\n\n\nSome urge twitches the muscles in your neck, causing you to look right. It's not a premeditated motion; no known stimulus caught your attention and turned your focus. Perhaps it was an instinctual motion, triggered by a part of your nervous system that's more aware of your surroundings than your conscious mind.\n\n\nBut when you do turn your gaze, you catch a shadowy figure dodging the swinging beam of your headlamp. Then one more footstep across the panel of rusted sheet metal, as if made by someone running.\n\n\nThis inspires mixed emotions. On the one hand, someone is sneaking around this cabin site, and not in a friendly hail-fellow-hiker-well-met kind of way. On the other hand, they're running away, which implies they don't intend harm. Correct?\n\n\nWith more than a little trepidation, you follow the shadow. It's gone now, of course, but it had disappeared around a corner of the cabin. Stepping quietly and cautiously yourself, you leave the deck behind and approach that same corner, the headlamp still shining as bright as you can. This will be your advantage, you hope: the person you seek prefers the shadows, whereas you are the bringer of light.\n\n\nWhen you round the corner, the headlamp shows you nothing you haven't seen before: the wind-torn piece of roofing, the door to the bunk room, the goldenrod, the poplars. Within this twilightscape there are no other people; if your visitor had been running, then they are likely a hundred yards down that old driveway by now.\n\n\nAgain, you have mixed thoughts about this: you're relieved the stranger is gone, but you still don't know where Amy is or what happened to her. Certainly there must be a connection between her disappearance and this stranger's shadowy presence. And if so, you know your paths are going to cross again. Soon.\n\n\nBut maybe he left some trace of himself when he fled. With your gaze and your light focused downward, you look for footprints or whatever in the wet weeds. All you see is some slight crookedness in the vegetation, which sort of looks like the trail a person might make, but if so it doesn't go anywhere you and Amy didn't step yourselves when you first arrived.\n\n\nYou take a long step across the sheet metal, wondering if you should try and follow this trace or whether it would be better to hole up inside the cabin for the night. This step puts you beyond the bunk room door, and three more take you past the next corner of the cabin.\n\n\nSomething to your right shrieks — a feral, cat-like howl that you can almost feel as a physical blast against your ear. It fills the forest far more effectively than your own voice had a moment ago. Reflexively you turn, and your light reveals the most bizarre sight: not a person, although you might be forgiven for misinterpreting its shadow; a fur-wraith, all fang and claw, standing on two feet and as gracile as a person, but filled with the bloody menace of a wild predator. And to erase any doubts you might have about its intentions, it tenses its muscles in a slight crouch — coiled in preparation for a pounce.\n\n\nYou turn and run, of course, because that's the only response your feeble brain can dream up. The creature now stands between you and the nearest door to the cabin, eliminating that option of retreat. And since you've never been to this place before and know nowhere else to go, you run back toward the driveway, the place from which you came.", "action_results": [null]}, {"action": "Wait and hope whatever it is passes by.", "result": "It might just be a deer. It might just be a deer. It might just be a deer. You wish that repeating the thought made it more convincing. And if it were true, how foolish does that make you? What do you know about these things anyway — you, a native suburbanite from Westchester County whose outdoor knowledge, admittedly, comes largely from Instagram? You shrug inside your layers of expensive polyester and fleece, suddenly conscious that much of your experience has been purchased, not necessarily earned. Instead you wish you were some woods-wise local, the kind of person who habitually wears red wool plaid and has a head full of useful knowledge, such as how to tell the difference between a whitetail deer and a serial killer stalking you in the night.\n\n\nWhat a curious feeling: girlfriend delayed or missing, strange noises outside, thoughts of self-inadequacy arriving unbidden. George, don't be a fool! George, don't be a fool! George, don't be a fool! You fit the headlamp over your head but keep it off, keeping still in hopes of hearing whatever there is to be heard. The damp cabin walls buffer out most of the softer outside noises, so you permit yourself the necessary steps to return to the door, standing near the Naugahyde recliner and sticking out only your head.\n\n\nAnd indeed, it is clear you are not alone tonight. Your visitor is softly making his way up the bank, but not directly toward the deck. He is climbing at an angle up the wooded slope, taking his time with what must be a tangle of spruce and balsam. If he has a headlamp like yours, he's not using it, and if he has thoughts he is not giving them voice. The clue he is giving you, the only signs of his presence, are his footsteps.\n\n\nAnd somehow you have the hunch that these could be better concealed too, if he so chose. He wants you to hear his approach, probably knowing full well the effect it will have on your state of mind.\n\n\nBut then you lose track of the footsteps for a moment, and you have no idea where the stranger is. Still on the slope, blocked by an impassible obstacle, forced to veer farther out to find a way around? Stopping to smoke a cigarette, savoring the moment? It is almost enough to draw you back out onto the deck for a better look, but perhaps that's the idea. Perhaps he has a perfectly good view of you right now, standing fearfully to the side of the doorway like an inept B-movie spy.\n\n\nYou back away from the door, freezing when a bit of glass cracks loudly under your hiking boot. The muscles in your body become so tense you can almost hear the tendons stretching. Then you hear the footsteps again — not near the deck, but circling around the back side of the cabin. Your visitor has passed the bunk room and is moving toward the room that once been the kitchen. With your eyes following the sounds, you realize with horror there is one aspect of this cabin you had almost forgotten:\n\n\nThis place has a third door, located next to the sink. It is closed now, but if that door is like the other two, there is no lock.\n\n\nOutside, the visitor climbs a set of wooden steps: one, two, three. He is outside the door now. Right there, barely twenty feet away. Is there any point in pretending neither of you knows the other person is there?\n\n\n\"Hello?\" you say, hoping this is all just a misunderstanding. Maybe Amy is just playing a prank on you, or maybe this is some other wayward hiker seeking shelter for the night, approaching a cabin they didn't expect to find, wondering if the occupant is friendly.\n\n\nThe problem, though, is that the facts support neither hypothesis: Amy doesn't pull pranks, and a fellow backpacker would return a friendly greeting in kind. Therefore your mind proceeds to spool out some additional scenarios: your girlfriend has been murdered, and the person who did it is now coming for you; the person who built this cabin has returned, prepared to chase off an intruder.\n\n\nThere is a painful cro-o-o-o-oak! as an outer screen door is pulled open, and then the wooden main door is kicked open. The light outside is dark gray, allowing you to see only the indefinite silhouette. The figure is more willowy than you had anticipated, more feminine, making you wonder if this is Amy after all—\n\n\nBut then the figure releases a shriek — feral and distinctly inhuman, like that of a large predatory cat. And in that moment you realize even your worst theories had been way off the mark. This threat has no explanation, has no rational reason for being. But there it is, with only a few wall studs between you.\n\n\nThis is beyond any situation you've ever prepared for, beyond any threat you're equipped to defend yourself against. Only one option comes to mind, and you enact it without hesitation.\n\n\nPivoting on the pulverized shard of glass, you sprint out the door and leap off the deck. In the darkness you trip hard over a tangle of wire you never saw in the weeds, but you free your foot and regain your stride. Is that… thing behind you? You can't tell, and you don't dare stop and look. But you get your answer anyway when the bunk room door bursts open behind you, spinning and landing loudly in the goldenrod. The creature shrieks again, its call filled with predatory menace, echoing off your back as you run as fast as you can toward the overgrown driveway that led you to this place.", "action_results": [null]}]}]}]}]}]}]}]}]}]}