{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=10516", "context": "", "first_story_block": "You break through the edge of the forest and find exactly what you were looking for. The hidden carnival that your friend had told you about, tucked away just past the treeline. The sign before you reads \"The Carivelli Carnival\" and it's brilliant lights draw you in, promising wonders just beyond the gate.\n\nA tall man stands on a box just before the entrance, his suit is bright green with blue pinstripes, and he has a matching top hat. His face is etched with deep lines, and his dark hair reaches past his shoulders.\n\n\"Come and see the wonders within!\" He belts in an oddly high pitched voice, waving his hands through the air as if performing a magic trick. His eyes meet yours, and you feel his will pulling you in, and you walk through the gates mesmerized.\n\nOnce inside you're dazzled by the bright lights, colors, and music flowing from every corner. People of all ages pass you with smiling faces and you decide to go to see...", "action_results": [{"action": "The Bearded Lady", "result": "To your left you see a stage with the words \"Bearded Lady\" painted in bold black letters over it. You slowly make your way to the stage and a petite woman bursts through a dull red curtain. Everything about the woman is beautiful with the exception of the beard.\n\nShe wore an off the shoulder yellow dress that cinched around the waist, and the hem stopped just above her knee. Her loose dark curls cascade down her back, and her brown eyes are piercing.\n\nWhen she reaches the center of the stage she begins to dance. Her intoxicating movements draw in all those in the surrounding area, you push your way closer to the stage as more and more people gather around.\nWithout warning, a snake peaks out from behind her, and the crowd lets out a gasp.\n\nIt mimics her movements around the stage, and the crowd is completely engrossed in the show. The snake starts to hiss at you, but after a moment you realize that it isn't hissing, it's whispering something. You concentrate on the sound coming from it's mouth to find that it knows you. It recites your birth date, your address, your full name, and a multitude of other things that it definitely shouldn't know.\n\n\"You belong here. Thissss issss your desssstiny.\" You look around to see that no one else is as startled by the snake as you are.\n\nYou break from the crowd and head to another show...", "action_results": [{"action": "Sword Swallower", "result": "A crowd rushes around you and pulls you toward a stage bearing the name \"Arsoli\" and you wonder what it is you're about to see here. After a few seconds, a man covered in colorful tattoos wearing only a pair of leather pants appears on the platform.\n\nThe man begins to juggle a set of swords, twirling them in the air, catching them with a grace that most men can't accomplish even with a great amount of practice and patients.\n\nHe let's two of the swords sink into the floor of the stage and holds the third high above his head. He tips his head back and gently pushes the blade down his throat. He walks around the stage displaying his obvious talent before pulling the sword out and sticking it into the stage.\n\nHe jumps from the stage and walks your way, the crowd parts and once he reaches you, you shrink back. Unsure of what he's going to do, you stammer an unintelligible phrase and he laughs loudly.\n\n\"Join us and have everything you've ever wanted.\"\n\nYou close your eyes for just a moment, and when you open them again, the man isn't there, or on the stage. The swords are gone and the crowd is growing impatient, asking when the show is going to start. You don't wait around to see the man and head to another stage...", "action_results": [null, {"action": "Contortionist", "result": "In front of you is a sign that reads \"Contortionist\" and you head to that stage. When you arrive the show is already in progress, and you stand at the back of the crowd, standing on tip toes to see the show. A woman wearing a powdery blue spandex suit is bending in ways that any normal parson can't.\n\nAfter a short show, the crowd dissipates and the performer is left on the stage with no spectators. She turns and looks at you and there is something in her smile telling you to go after her. You climb up onto the stage and go with her behind the curtain.\n\nBeyond said curtain is a small dressing room and the woman is nowhere to be found, but just before you're about to turn around you hear a whistling coming from behind a rack of costumes. You wander over and part the sea of clothing, you peer into the darkness, unable to see anything.\n\n\"See into the darkness, look into yourself and find where you belong\" said a melodic voice that you assumed belong to the contortionist. Without a second thought you run from the stage and find yourself back in the middle of the carnival.", "action_results": [null, null, {"action": "I've seen the three main acts", "result": "At this point the carnival has sufficiently creeped you out and you find yourself wondering whether you want to check anything else out. You begin to head for the exit when you are greeted by a midget dressed as a lion, he dances around you enthusiastically for a moment and then sings.\n\n\"Find the master, find the ring.\nfind your place, and begin to sing!\"\n\n\"What the hell are you going on about little man?\" You say with a mocking tone in your voice.\n\n\"You'll never leave this place unless you seek him out. Go to the FunHouse if you value life my friend.\"\n\nYou push past the little lion and make your decision...", "action_results": [{"action": "A little too creepy, I'll be on my way now.", "result": "You try to find the entrance, but too late, you realize that you have absolutely no clue where you are. You wander for what seems to be hours, never seeing the same booths twice. You're lost in the growing throng of people excitedly searching for the next thrill when you come to s sign that reads \"FunHouse\"", "action_results": [{"action": "FunHouse --->", "result": "Before you, the FunHouse appears, looming ominously above everything else around it. The exterior is brightly lit with hundreds of variously colored light bulbs, different shapes and characters adorn the space unoccupied by lights.\n\nYou bring your foot to the bottom step and begin to rethink going inside, but the little man said that you couldn't get out unless you go in.\n\nYou step through the door, and automatically regret coming to this carnival in the first place. Before you is a dark walkway riddled with clown faces and spider webs. You walk through anyway and find yourself in a large striped tent.\n\nYou try to make sense of what's around you but can't think of any possible explanation. In the middle of the tent is a ring, just like in a circus, the ring is surrounded by seating, and in the middle of the ring stands the man in the top hat.\n\nHe waves you over and you reluctantly step into the ring. When you reach the man, you hear the roar of an applauding crowd and turn to see that the stands have been filled by ghostly figures of mutilated children.\n\n\"Will you stay or try to go?\" He states simply, pulling you out of your shock.", "action_results": [{"action": "Stay", "result": "\"I want to stay here.\" You say without thinking. You don't know what's come over you, but you feel drawn to this place, and you want to stay and entertain the transparent children. The man snaps his fingers and three doors appear behind him.\n\n\"I am the Ring Master. I am a god among men, I am the darkness and I am the light. I am everything. You will now choose your fate,\" He waved his hands toward the doors and continued, \"These three doors represent three separate fates. Choose wisely, for once you are through the door, you cannot change your mind. Attached to each is an envelope with a hint as to what lies behind the door. You have ten minutes to choose.\"\n\nHe steps out of your way and you head to the door on the right. You grab the note out of the envelope and read it to yourself.\n\n\"Behind this door is nothing more than life.\" You take a moment to think of what the phrase might be referring to, and then move on to the middle door.\n\nThe note attached has the number \"1.77245385090\" inside of a square. Again, you take a moment to think about the strange clue. You finally move to the last and open the envelope quickly.\n\n\"The reward might be greater than the risk.\" You take the remainder of the ten minutes to think about each clue.\n\n\"Your time is up. Choose your fate.\"", "action_results": [{"action": "The door on the right", "result": "You place your hand on the knob,and turn it slowly. You walk through it's frame and it disappears, you find yourself in a small dark trailer, before you have time to explore, you fall to the floor in agonizing pain. You look at your hands and see that they are growing alarmingly large, and your legs are lengthening.\n\nWhen the episode is over, you stumble to your feet, and your head hit's the ceiling. You let out a pained moan, and make your way out of the trailer. You look around to see that it's daytime, and you realize that the great change in the length of you limbs is going to take some getting used to.\n\nYou vaguely remember coming through the door, but can hardly remember what came before that, still, snippets of your past still lingered. Everything around you is new and old at the same time. It's all familiar in the same way that Deja vu is once you've experienced it.\n\nA memory claws at the back of your mind, and you struggle to take hold of it. You sit with your back to the trailer until you remember exactly what it was you were supposed to do.", "action_results": [{"action": "Run away", "result": "After using all your strength to muster the memory, you slump over and try to rest a little. A few moments later the midget lion approaches you with a grin.\n\n\"You're enormous.\" He points out plainly, \"We could always use another giant. As you can see, I got the short end of the stick.\" The small man laughed at his own joke and walked away without another word.\n\nYou stand and prepare yourself for what you're about to do. Without wasting time, you break into a run and head for the treeline. Soon you come to a clearing with two obvious routes.", "action_results": [{"action": "Left", "result": "You turn to the left and run as fast as you can until you reach a road. You follow the road to a town next to the one you grew up in, grateful to be in the safety of city limits, you sigh with relief. You find the police station and tell them of what happened to you while at the carnival, and give them all your information.\n\nThey call your family only to find that you've never existed. You are away to a mental hospital where you spend the remainder of your days talking about the carnival. Still trying to convince people that such odd and horrible things really happened to you.", "action_results": []}, {"action": "Right", "result": "You run right, and soon find yourself back at the carnival. Thinking you'e only made a mistake you try again and again, but end up right back where you started.\n\nYou sit down between the two separate paths and rest before you make your decision to...", "action_results": [null, {"action": "Stay at the carnival", "result": "You make your way to a plain looking stage, somehow knowing that it was meant just for you. Buckets of paint are scattered on the platform along with brushes, all awaiting your eager hands to delight in creating a space of your own. You pick up your favorite color and begin to paint a base, and after stepping on the stage you have completely forgotten any will you had to rid yourself of this place.\n\nYour thoughts are only of happy things that may come your way in this new stage of your life. When you are finished, you step back to admire your work.\n\nIt's time to start the show.", "action_results": []}]}]}, null, {"action": "Talk to the Ring Master", "result": "You go in search of the Ring Master and find him shortly after. He is standing on his box, looking over the rest of the carnival, overseeing all the work being done.\n\n\"We need to talk.\"\n\nA smile stretches across his face as if he knows what you're about to ask of him, \"I suppose you're about to ask me if we can make a deal so that you can leave?\n\n\"Uh, yeah, actually,\" you pause for just a moment, and when he doesn't say anything you continue, \"So, can we... you know, make a deal?\"\n\nHe strokes his chin before answering, \"Yes, let's. This is the deal, You get me a hundred souls, and you may go. You will return to your previous size, and will forget everything that's happened here.\"\n\n\"What will happen to the people?\"\n\n\"Some of them will be given all the choices you were, but most of them will die.\"", "action_results": [{"action": "Take the deal", "result": "\"Fine, I'll do it. What do I do?\"\n\n\"You will feel in your mind all the people that have been marked, all you need to do is find a way to get a message to them. Tell them that they belong here, that they need to see me. once you've done that, they will come to me. I access the potentials mind and see who was most successful in conveying the message.\"\n\nYou dismiss yourself from the Ring Masters presence and begin to make your plan of attack.\n\nThat night, when your show begins, you sense someone in the audience, a target. You hone in on them, making eye contact, and send your message with a smile.\n\nIn their mind they see a fantastic show with acrobats, fire, dancers, and animals. When the show is over you approach them in the most dazzling outfit you can imagine, \"Stay and play at the carnival, and your fun will never end!\"", "action_results": []}, null]}]}, {"action": "The door in the middle", "result": "You laugh as you figure out that the hint on the paper was the square root of pi, you put two and two together and decide that being a clown wouldn't be so bad if you had to stay.\n\nYou walk through the door slowly, and find yourself in a dressing room. In front of you is a make-up station, several types and colors of face paint, brushes, sponges, and everything you need to transform yourself into a clown sits on the table.\n\nYou position yourself in front of the mirror, and begin to apply the paint to your face. Until you figure out what it is that you're going to do, you need to blend in. When you're finished, you pick a costume that matches your make-up, and dress yourself quickly. As soon as you stand in front of the mirror again, a searing pain takes a hold of your entire body as the costume and make-up fuse to your skin.\n\nAfter the pain is gone, find the door and go out into the painfully bright light of the sun, and you realize what you have to do.", "action_results": [{"action": "Try to buddy up to the Ring master", "result": "You search for the Ring Master, all the while thinking of the things you can do to become the Ring Masters right hand. When you finally find him, he greets you with a booming laugh.\n\n\"So you would like to be my right hand would you?\"\n\nFor a moment you're shocked that he knows exactly why you've come to him for, \"Yes, If I'm going to be staying with the carnival, I'm going to do it right.\"\n\n\"You don't say. Well, if that's the case, you can, but there is one thing you'll have to do for me.\"\n\n\"What's that?\" You say as you tilt your head in curiosity.\n\n\"Kill the midget in the lion costume.\"", "action_results": [null, {"action": "Agree, then try to Run", "result": "You are frightened by what just happened, and know you can't stay any longer, and without wasting time, you break into a run and head for the treeline. Soon you come to a clearing with two obvious routes.", "action_results": [null, null]}, {"action": "Do what he has asked of you", "result": "\"Alright.\" You say without hesitation, knowing that the only way that you're going to survive here is by making nice with the Ring Master.\n\nYou leave him and begin to plan how to go about getting rid of the little man. When you feel like you've struck gold, you put your plan into effect.\n\nYou lure him out to the edge of the forest with promises of drugs you got from some punk kid that wandered into the carnival during the day, and when he arrives, you hit him over the head with a large branch and he falls to the ground. You quickly bury the body and hastily make your way to the Ring Master to get things rolling.\n\n\n\"Well done, you are going to be valuable.\" The he says with a pleased look on his face.", "action_results": []}]}, null, null, {"action": "Talk to the Ring Master about a deal", "result": "You go in search of the Ring Master and find him shortly after. He is standing on his box, looking over the rest of the carnival, overseeing all the work being done.\n\n\"We need to talk.\"\n\nA smile stretches across his face as if he knows what you're about to ask of him, \"I suppose you're about to ask me if we can make a deal so that you can leave?\n\n\"Uh, yeah, actually,\" you pause for just a moment, and when he doesn't say anything you continue, \"So, can we... you know, make a deal?\"\n\nHe strokes his chin before answering, \"Yes, let's. This is the deal, You get me a hundred souls, and you may go. You will return to your previous state, and will forget everything that's happened here.\"\n\n\"What will happen to the people?\"\n\n\"Some of them will be given all the choices you were, but most of them will die.\"", "action_results": [{"action": "Take the deal", "result": "\"Fine, I'll do it. What do I do?\"\n\n\"You will feel in your mind all the people that have been marked, all you need to do is find a way to get a message to them. Tell them that they belong here, that they need to see me. once you've done that, they will come to me. I access the potentials mind and see who was most successful in conveying the message.\"\n\nYou dismiss yourself from the Ring Masters presence and begin to make your plan.\n\nThat night, when your show begins, you sense someone in the audience, a target. You hone in on them, making eye contact, and send your message with a smile.\n\nIn their mind they see a fantastic show, with everything they've ever dreamed of seeing, animals that do fantastic tricks, acrobats swinging from one swing to the next high in the air without nets, and other things that seemed to be impossible. When the show is over, you greet them with your message, \"Never ending fun is just around the corner, as long as you stay and play!\"", "action_results": []}, null]}]}, {"action": "The door on the left", "result": "You decide to go through the door on the left, only to find yourself in a room full of spandex and make-up. Something in your mind pushes you to get ready for your new life in the carnival. A voice tells you that you have a show tonight. You choose a spandex suit in your favorite color, and apply dazzling make-up to every inch of exposed skin.\n\nAs you look at your handy work in a mirror, a sharp pain racks your entire body and you fall to the floor. You feel the spandex and the make-up become apart of you, they are your skin. Your identity.\n\nWhen it's all over, you stand and run from the room, trying to think of what to do next...", "action_results": [null, {"action": "Hunt down the Ring Master", "result": "You decide that you need to talk to the Ring Master once again, and a few options come to mind, make a deal, or suck up. You think about your decision carefully and come to the conclusion that you need to...", "action_results": [null, null]}, null]}]}, {"action": "Go", "result": "\"I just want to go home.\" You say sullenly, thinking that he'll never let you leave. He snaps his fingers and three doors appear behind him.\n\n\"I am the Ring Master. I am a god among men, I am the darkness and I am the light. I am everything. You will now choose your fate,\" He waved his hands toward the doors and continued, \"These three doors represent three separate fates. Choose wisely, for once you are through the door, you cannot change your mind. You have ten minutes to choose.\"\n\nHe steps out of your way and you see that each of the doors are numbered, and under each number there is a picture.\n\nDoor one is a deep crimson color, and the picture on it looks to be a child.\n\nDoor two is a dull brown, and has a picture of a shovel.\n\nDoor three is a bright and cheery blue with a smiley face on it.\n\nAfter you've spent the full ten minutes examining each, and trying to decide, the Ring Master nudges you to make your choice.", "action_results": [{"action": "Door one", "result": "You move through door one and find yourself in a child's room, and when you look down, you realize that you're holding a piece of paper that simply says \"Kill him, or be mine forever.\" The red and blue walls of the room are lined with drawings, and upon closer inspection, each drawing reveals a different gruesome scene, nothing that a child should ever see, let alone draw. At this point you're far too distracted and disturbed to notice that a small boy of about seven has entered the room.\n\n\"Are you here to kill me?\"", "action_results": [{"action": "Kill The child", "result": "\"No, of course I'm not here to kill you!\" You say trying to sound reassuring.\n\n\"Then why is there a knife in your hand?\"\n\nStartled, you look at your hand and see that the paper has been replaced by a large knife. Without giving it a second though you race at the child and let the blade sink into his stomach.\n\nYou pull away and the scene starts to change in front of you. As the child dies, the room changes to your own. You see no blood, no weapon, nothing to make you think that it happened, except a sinking feeling in your gut.\n\nSomething made you stab the boy, something outside of you. You begin to cry hysterically, and make a radical decision...", "action_results": [{"action": "Go to the police", "result": "With everything that's happened to you, you decide you need to inform the police. You give them every last detail, and they take it all down skeptically.\n\nThe police search for the body and are successful, the news relieves you until you are charged with murder. In hindsight you realize that it wasn't such a great idea, but even jail has to be better than the carnival.", "action_results": []}, {"action": "Try to forget what you've done", "result": "You live out the rest of your days trying to forget everything that happened, but everywhere you go you see the young boy, his sad eyes pleading at you to save him.\n\nOn some occasions you even see the Ring Master, laughing at you, mocking you in plain sight. After so many years of these things, you are driven mad and find yourself in a mental hospital.", "action_results": []}]}, {"action": "Refuse to kill the child", "result": "\"No, of course I'm not here to kill you!\" You say trying to sound reassuring.\n\n\"Then why is there a knife in your hand?\"\n\nStartled, you look at your hand and see that the paper has been replaced by a large knife. Immediately you open your hand and let it fall to the ground.\n\nYou sit on the bed and bury your face in your hands, trying to figure out what you're going to do next.\n\n\"Where are we?\" You ask the boy as you look up.\n\n\"We're far far away.\" His melodic voice seems to carry itself through the room, a presence in and of itself.\n\nYou look through a window at the far side of the room and try to figure out what the boy means. After a few minutes, the boy begins to giggle. You feel a sharp pain rip through your lower back and drop to the floor. The boy leans over your bloodied figure, stabbing repeatedly, laughing all the while.\n\nYou die hearing the happy laugh of a demented child.", "action_results": []}]}, {"action": "Door two", "result": "You pass through door two and find yourself in the middle of a forest, holding a flashlight and a shovel. Directly in front of you is a note pinned to a tree.\n\n\"Dispose of this body, then turn off your light and you will be sent home. Try and run, and you will be mine forever.\"\n\nYou look around you to see that the body of a young woman sat lifelessly at the base of the tree. The sight and smell of the body makes your knees go weak and you retch into some bushes.\n\nWhen your finished, you make the decision to just complete the task so that you can go home. When you're sure that everything is in order, you click off the light, and find yourself back at home as if nothing had happened.\n\nYou now have one last choice to make...", "action_results": [null, {"action": "Keep everything to yourself", "result": "You know that the whole story will sound crazy to any sane person and decide to keep everything that happened to you to yourself. You live out the rest of your days fairly happy, but every once in a while you see the Ring Master out of the corner of your eye.", "action_results": []}]}, {"action": "Door three", "result": "You Walk through door three and find yourself in your room. You laugh happily until you see a piece of paper on your bed.\n\n\"You've made your choice well. Beware.\"\n\nYou throw the note in the trash and laugh it off nervously, after a few days you begin seeing the Ring Master. Every day for the rest of your life he haunts you, always out of the corner of your eye.", "action_results": []}]}]}]}, null]}]}, null]}, null, null]}]}