{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=30375", "context": "", "first_story_block": "The drive is a long one. It's the late evening and you are barely halfway to your destination. \n\n\n\"We're never gonna make it, the bar closes at 2:00am, and we're not even close. Everyone's gonna be gone by the time we get there.\" Kent exclaims. \n\n\nKent's always been worrisome. You've been friends for nearly fifteen years, and tonight you've planned on going to a bar in a town called Elk Valley. It's a small town, but is an attraction to many young adults, due to it's low police rate and high night life scene. \n\n\n\"Load up the map for a second\"\n\n\nYou load up the map on your phone and notice a detour road through a forest nearby. This looks to cut the trip a couple hours, and you'll make the bars in time. \n\n\n\"I say we take it. Nothing bad ever happens in this town, there's nothing to be afraid of. What do you say?\" \n\n\n ", "action_results": [{"action": "Take the detour", "result": "You are okay with taking the detour. \n\n\n\"Alrighty, we'll be there in no time now!\" Kent says in excitement. \n\n\nHe drives onto an empty road, into a forest. The rain falls and patters on the windshield. As you are driving, Kent opens a bottle of beer and begins to drink. You take the bottle away. \n\n\n\"Oh dude don't be like that! It's just a little pre-drink before the party, nothing to be worried about. If you let me finish it, I'll buy you a round of shots at the bar. Deal?\"\n\n\n \n\n ", "action_results": [{"action": "Give Kent the bottle", "result": "You give Kent back the beer. \n\n\n\"Thanks man. First round of shots is on me.\"\n\n\nAs he drinks it, he does not pay attention to the road and drives over a spike strip. The car spins as he slams on the breaks. \n\n\n\"What the hell was that!\"\n\n\nYou get out of the car to see the tires are busted. You look down the road to see the spike strip set up in the middle of it.\n\n\n\"Who would put that there?! Damn it all! My Dad is gonna kill me, this is his car!\"\n\n\nYou take out your phone, but notice you have no service. You look up from your phone and see a person coming in a hooded grey jacket. You cannot see their face, as it is too dark. \n\n\n ", "action_results": [{"action": "Ask the person for help", "result": "You shout across the road at the person. \n\n\n\"Excuse me!\" yells Kent, \"We need some help over here!\"\n\n\nThe person begins to slowly walk towards you. They remove their hood to reveal themselves as a young woman, about the same age as Kent and yourself. \n\n\n\"Hi, I'm Angel. Who might you be?\" she asks.\n\n\n\"I'm Kent and this is my good bud. We hit what looks to be a spike strip and have no service to call anyone.\"\n\n\n\"That's unfortunate. I'm afraid I don't know anything about fixing cars, so I won't be much help to you.\" she replies. \n\n\n\"Thanks anyway. Do you know the fastest way to get out of here on foot?\"\n\n\n\"You can't walk on foot in this forest at this time of night, it's way too dangerous If you don't feel like sleeping in a busted car tonight, you can stay at the sanctuary. I'm sure Byron has room for you two.\"\n\n\n\"The sanctuary? What's that?\"\n\n\n\"I live there. It's my home. I can explain more about it on the way, follow me.\"", "action_results": [{"action": "Follow Angel", "result": "You decide to follow Angel to the place she calls the \"sanctuary\". \n\n\n\"Excuse me, it's Angel right?\" Kent asks her.\n\n\n\"Yeah\"\n\n\n\"What exactly is the sanctuary?\"\n\n\n\"It's my home, but wasn't always. A few years ago, I lived with my father in Deer Valley. My life was horrible there, I was constantly teased by others at school. People tend to outcast someone who comes to class with a black eye everyday. My father drank, a lot. When he'd get angry, he'd take it out on me. I needed to get away. One night, I finally decided to run away. I ran into this forest and met Byron. He welcomed me to the sanctuary and said I could live there the rest of my life. I don't need to school, there's no abuse, no exclusion, no teasing, it's perfect. To put it simply, the sanctuary is heaven.\"\n\n\n\"Okay then.\" Kent says as he looks unimpressed. \n\n\n\"It's just up here.\" Angel claims. \n\n\nYou walk on top of a hill, where the sanctuary is revealed. You see three small cabins with lots of land around them. They are across from one another, forming a circle. You follow Angel down the hill and walk towards the cabins. Each cabin has the same symbol painted on the door. It looks like an upside down cross with an circle around it. One cabin's symbol is red, the other is blue, and the other is yellow. \n\n\n\"Stay right here, I'm gonna go find Byron and introduce you guys.\"\n\n\nAngel walks into the cabin with the red symbol on it. \n\n\n\"Dude, this place is weird.\" mentions Kent. \n\n\nA hefty man then walks out of the cabin. He has an unkempt beard and long slick brown hair. He smiles at you and Kent.\n\n\n\"Evening boys. The name's Byron Duke, but just call me Byron. This is my sanctuary, a place of inclusion and salvation. A long time ago, God and the devil appeared to me in a dream. They were fighting one another, trying to earn my faith. That's when I realized, I am no follower. I am a leader. I was born to lead those who need direction. People don't understand me, they don't understand us, so we stay here. All we need is each other, all we need is sanctuary. We'll watch the world burn from here.\"\n\n\n\"Sure man. Is it okay if we stay here tonight? Our car broke down...\" \n\n\n\"Say no more\" Byron interrupts. \"Like I said, this is a place of inclusion. All who want to be here are welcome. There are two beds in the cabin behind you, you can sleep there tonight. Sweet dreams, boys.\" \n\n\nByron walks back into his cabin. \n\n\n\"Dude, that guy is way far out. Do you think we should stay here?\" \n\n\n ", "action_results": [{"action": "Spend the night", "result": "You walk into the cabin with the yellow symbol over it, where you will spend the night. \n\n\nInside the cabin is two beds about three feet away from each other,a lit fireplace, a mini fridge, and a filled bookshelf. Kent walks towards the mini fridge.\n\n\n\"Just because we can't make the bar, doesn't mean we can't get drunk tonight. Lets see what they got to drink.\"\n\n\nKent opens the fridge to reveal a garbage bag wrapped around something. \n\n\n\"What is that?\"\n\n\n ", "action_results": [{"action": "Open the bag", "result": "You move towards the fridge, and remove the object in the bag. \n\n\n\"I'm seeing what's in there\" says Kent. \n\n\nKent grabs the bags and turns it upside down, causing a human hand to fall out.\n\n\n\"Holy shit! That's a hand! Why would there be a hand in here!\" Kent shouts. \n\n\nThe hand looks to have been sliced off from an arm using a knife. The grey shade of it shows it was cut off much later after the person had died. Suddenly, there is a knock at the door of the cabin.\n\n\n\"Hey guys, can I come in?\"\n\n\nIt is Angel.\n\n\n\"One minute please!\" replies Kent. \"Dude, we gotta hide this, quickly\". \n\n\n \n\n ", "action_results": [{"action": "Hide the hand back in the fridge", "result": "You grab the hand using the garbage bad as a glove, and put it back in the fridge. \n\n\n\"Come on in\" says Kent. \n\n\nAngel opens the door and enters the cabin. She looks at you and Kent. \n\n\n\"You guys look like you've seen a ghost. Everything okay?\"\n\n\n\"Everything's peachy, never better.\" Kent replies.\n\n\n\"Okay. I just wanted to make sure you were settling in alright.\"\n\n\n\"Oh yeah, we're fine. As a matter of fact, we were just getting ready to hit the sack.\"\n\n\n\"Alright then. I'll let you get some sleep. I'll come back in the the morning when you're up. Goodnight.\"\n\n\nAngel leaves the cabin. \n\n\n\"Good thinking hiding it in the fridge\" murmurs Kent. \"I don't feel safe here though. How did a hand get cut off and why was it in a fridge? This whole place is messed up, I say we check it out. Who knows what else is around here, we should search the grounds. Imagine we uncover more secrets, then when we leave here tomorrow, we go straight to the papers and tell them all about this place. I bet some reporters will pay good money for a story like that! What do you say, should we search the grounds?\"", "action_results": [{"action": "Search the grounds", "result": "You and Kent leave the cabin to search the grounds of the sanctuary.\n\n\n\"We have to be quiet, I don't want to know what happens to us if that guy finds out we're searching his land for murder evidence.\" Kent says. \n\n\nYou take slow paces, and the dark of the night benefits you're sneaking. \n\n\n\"Where should we look first?\" \n\n\n ", "action_results": [{"action": "The red cabin", "result": "You silently walk towards the cabin with the red symbol on the door. \n\n\nYou sneak around it to find a sole window on the backside. You peak in the window and see Byron sitting at a desk, writing something. You look to the other side of the room and see Angel sitting on a bed. She looks to be talking, but you can't read her lips. \n\n\n\"Let's keep moving\" reminds Kent. \n\n\nYou sneak to the side of the cabin, but don't find anything suspicious. Suddenly, you hear the door to the cabin open, and someone walks out. You hide at the side of the cabin, and peak over the corner to see who it is. You see Byron walk out with a garbage bag, with something inside of it. You are losing sight of him as he moves.\n\n\n \n\n ", "action_results": [{"action": "Follow Byron", "result": "You follow Byron, but stay far behind him so he cannot see you. \n\n\nByron goes to the cabin with the blue symbol on the door, and knocks. A naked man answers it. \n\n\n\"You're later than usual\" the man says. \n\n\n\"I promised I'd feed you, I never promised anything about when I would\" Byron responds. \n\n\nThe man takes the garbage bag and closes the door. You quickly sneak back to hide behind the cabin as Byron makes his way back over. He goes back into the cabin. \n\n\n\"Tell me that looked as fishy to you as it did to me, we should see what's going on in there\" Kent utters to you. \n\n\n ", "action_results": [{"action": "Investigate the delivery to the cabin", "result": "You go the cabin with the blue symbol on the door, and sneak behind it to peak in the window.\n\n\nYou see a naked man and woman sitting on the floor, with the bag in the man's hands. The man reaches into the bag and pulls out what looks to be organs. It is confirmed they are human organs after the man dumps the remains from the bag on the floor, revealing everything. He takes an eyeball from the pile and puts it in his mouth. The woman moves over to him and kisses him, then shows that the eyeball is his her mouth, then proceeds to eat it. \n\n\n\"Son of a bitch, their cannibals!\" Kent exclaims. \"Quick, take a photo with your phone so we have proof!\" \n\n\nYou pull out your phone and take a picture, but the flash accidently goes off. You and Kent duck under the window. \n\n\n\"Oh no. They know we're out here, what do we do?\"\n\n\n ", "action_results": [{"action": "Go into the bushes", "result": "You silently walk over to the bushes. \n\n\nAs you walk through them, you are not paying attention to where you are going and accidently step in a bear trap. \n\n\nSNAP!\n\n\nThe snap is very loud and you let out a bloodcurdling scream. Kent approaches you, but sees something behind you and runs away. You hear a voice getting louder behind you:\n\n\n\"Obey! Obey! Obey!\"\n\n\nYou turn to see a large bearded man with an axe charging towards you. The bear trap doesn't allow you to escape, and the man swings the axe and gets to in the side of the head, killing you. ", "action_results": []}, {"action": "Sneak back to your cabin", "result": "You sneak around the other side of the cabin, but stop at the corner when you see the door open. \n\n\nThe naked man walks out, and looks around the area. \n\n\n\"Maybe you're just seeing things\" you hear the woman say from the inside. \n\n\nThe man goes back into the cabin. You silently walk until you successfully make it back inside your cabin. \n\n\n\"I knew something was wrong with this place!\" notifies Kent. \"We are leaving here first thing tomorrow morning and going straight to the newspaper, we are gonna make so much off a story like this! I'm exhausted, we should get some sleep.\"\n\n\nAs you get ready to sleep, you hear a hard knock at your door. As you move towards it, you hear a voice on the outside: \n\n\n\"Obey. Obey. Obey.\" it says repeatedly.\n\n\n ", "action_results": [{"action": "Open the door", "result": "You open the door. \n\n\nA large bearded man holding an axe is on the outside. He gives you a blank stare. Kent comes beside you. \n\n\n\"Ugh, can I help you?\" Kent asks.\n\n\n\"Obey\" the man responds. \n\n\nYou are confused to what the man wants. You go to close the door, but he stops it with his hand. \n\n\n\"Obey\" he says again.\n\n\n\"Okay we'll be sure to obey.\" Kent tells him. \"Goodnight now.\"\n\n\nThe man does not leave, and continues to hold the door open. \n\n\n\"Obey\" he says once again. He removes his hand from the door and closes his eyes. He starts to shake. \n\n\n\"Obey\" he says. \"Obey. Obey. Obey. Obey. Obey! Obey! Obey! Obey!\" He shouts louder each time. \"Obey! Obey! Obey!\"\n\n\nYou shut the door, but can still hear him on the outside. \n\n\n\"Obey!!\" the man shouts as he begins to smash the door with the axe. \n\n\n\"Oh shit! What the hell's this guys problem!? Leave us alone!\" Kent yells at him. \n\n\n\"Obey! Obey! Obey! Obey!\" he says each time he hits the door with the axe. \n\n\n\"Okay! Okay! We promise we'll obey!\" Kent screams. \n\n\nThe man suddenly stops hitting the door. You hear his footsteps as he walks away from the cabin. \n\n\n\"My god. Never mind going to sleep I'm wide awake now.\" Kent tells you. \"That guy is insane. Everyone here is insane. Screw waiting until the morning, I say we leave here tonight!\"\n\n\n \n\n ", "action_results": [{"action": "Leave the sanctuary", "result": "You agree to leave the sanctuary now. \n\n\nYou and Kent leave your cabin and begin to leave, but are stopped by a voice behind you. \n\n\n\"Hey!\" you hear. \"Where are you going!\". \n\n\nYou turn around and see Angel. \n\n\n\"What are you guys doing?\" she asks. \n\n\n\"We're leaving. We were just attacked by a maniac, we can't stay here.\" Kent responds. \n\n\n\"A maniac? There's no maniacs here, the sanctuary is the safest place in the world. You just had a nightmare, that's all.\" \n\n\n\"No Angel. We weren't sleeping. Our door is destroyed, he smashed it with an axe. Look for yourself.\"\n\n\n\"I don't need to. I'm sure your door is fine, you just had a bad dream. Let me walk you back to your cabin\" she insists. \n\n\n\"No. We're not staying here, and neither should you\" \n\n\nAngel looks confused.\n\n\n\"Why shouldn't I stay here? This is my home.\"\n\n\n\"I really hate to break it to you Angel, but this place is not safe. We were just attacked by an axe wielding psychopath, and earlier tonight we saw Byron bring a bag to a couple in the cabin over there which contained human organs.\"\n\n\nKent takes your phone and shows Angel the picture you took. \n\n\n\"See, they ate human organs!\" he tells her. \n\n\nAngel looks at the picture, then back at you. \n\n\n\"She got the eyeball, that's the best part.\" Angel grimly responds. \"You two shouldn't have been sneaking around here. Byron will be very upset when he hears. A few days ago a police man came snooping around here too. He started having suspicions and accused what we do as being unnatural. He was going to shoot Byron, but he didn't have any right to. there's no laws at the sanctuary. We chopped him up into little pieces, and it looks like he became a delicious meal for John and Lisa.\"\n\n\nAs she talks, you hear another voice coming from behind you: \n\n\n\"Obey. Obey. Obey.\"\n\n\nYou turn around to see the large bearded man swing his axe and hack Kent in the side of the head, killing him.\n\n\n\"You should have obeyed\" snickers Angel. \n\n\nThe large bearded man leaves the axe in Kent's head, and charges towards you. He punches you hard in the head, knocking you out. \n\n\n ", "action_results": [{"action": "Wake up", "result": "You awaken. \n\n\nYou find yourself in a bed, with each of your limbs tied to a corner bed post. You look around you and recognize the site, you are in the red cabin. The door opens and four individuals walk in wearing white masks and black cloaks. Byron enters next, wearing a butcher's apron. He walks to the bedside as the individuals stay put. He speaks to you:\n\n\n\"The world is a very scary place. A place ruled by a despicable kind of creature called the human race. A creature who uses it's intelligence to start wars, cause pollution, and make those they see as inferior live in wastelands. There is an unknown truth to these creatures. Like many races, the human race is divided in breeds. I believe breeds can be determined by intellect instead of physical properties. It is in some humans' nature to think the way they do, they think that life is to be lived with class and order. This is the highest breed on the chain, and the breed that follows have the mindset of a sheep. They follow the higher ups, making them feel important in this world. I am of a different breed, and almost an entirely different animal. I believe I am a breed that is free from the chain. I am a consumer, someone who uses the energy of others to make the world better for more like me. I take in those like me, and let them live life in the way they were created to. When a lone deer walks alone in the forest, and walks into the wolves' den, the result is unsettling, but natural. That is how we live, you are the lone deer walking into the wolves' den. The world is a scary place, a very scary place.\"\n\n\nThe individuals remove their masks to reveal themselves. Angel, the large bearded man, and the couple from the blue cabin approach the bed. Bryon speaks again:\n\n\n\"I did not force you to come here. You were the deer, aimlessly walking in the forest. But like the wolves' den, once you enter, fate will be unfair to you. Welcome to the wolves' den. Welcome, to the sanctuary.\"\n\n\nByron takes out a revolver and begins to load bullets into it. \n\n\n\"I don't plan on making you suffer. I believe in death being quick and painless. The consumption is all I am concerned about.\"\n\n\nAs Byron continues to prepare the gun, you realize one of your hands isn't fully tied up. You can slip it out of the knot. Byron loads the revolver and points it at your head. \n\n\n\"God help you, my brother.\" \n\n\nBefore he can pull the trigger, you grab the gun out of his hands. He along with the others backs up as you aim the gun at them. \n\n\n\"Please don't!\" Angel shouts. \n\n\n\"There is only one bullet in that gun, he can't kill all of us. Looks like fate decided one of us has to die today. Who will it be I wonder?\" Byron states. \n\n\nAs you aim the gun at them, you free yourself from the bed. You notice the door is wide open still.\n\n\nWhat do you do?\n\n\n ", "action_results": [{"action": "Shoot Byron", "result": "You shoot Byron. \n\n\nThe others go into a blind rage, viciously attacking you. The man from the blue cabin slits your throat with the butcher's knife. As you are bleeding out, the bearded man picks you up and sucks some of the blood from the slit in your neck, then breaks your neck. ", "action_results": []}, {"action": "Shoot Angel", "result": "You aim the gun and shoot at Angel, but you miss her. \n\n\n\"You asshole! I was nice to you!\" she screams. \n\n\nEveryone charges you and attacks. After brutally beating you down, they move out of the way where you see the bearded man swinging the axe at you. \n\n\n\"Obey!\" he shouts as he swings the axe right into the top of your head, killing you. \n\n\n\"You should have obeyed bitch!\" Angel shrieks. ", "action_results": []}, {"action": "Shoot the bearded man", "result": "You shoot the bearded man.\n\n\nYou get up from the bed and try to escape, but the man from the blue cabin grabs the axe that belonged to the bearded man, and swings it at you. He gets you in the spine, paralyzing you. \n\n\n\"You just killed my little brother.\" The man tells you. \"I am going to feast on you, alive.\"\n\n\nThe man takes the butcher's knife from Byron and starts slowly slicing your heart out. The pain is excruciating. You feel his cold hands inside of your open chest wound as he grabs your heart, and tears it from your chest. ", "action_results": []}, {"action": "Shoot the man from the blue cabin", "result": "You shoot the man from the blue cabin. \n\n\nYou get up to escape, but the woman tackles you and starts scratching your eyes. The others pull her off, but you are blinded. You stand up, but don't know where you are going, until you feel an axe chop you in the neck, killing you. ", "action_results": []}, {"action": "Shoot the woman from the blue cabin", "result": "You shoot the woman from the blue cabin. \n\n\nYou get up escape, but the bearded man pulls out the axe and swings it at your neck, killing you. ", "action_results": []}, {"action": "Escape through the door", "result": "You keep the gun aimed at Byron and the others, while you slowly make your way out the door. \n\n\n\"That's right, escape. Run. That's what you were born to do, run from your problems. You'll leave this sanctuary, but you'll never escape. Every waking moment of your life, you'll think of this place. We are in your head, and we always will be. So run, run far away. You'll be back, I guarantee it. Goodbye, brother.\" Byron tells you as you leave out the door. \n\n\nYou still have the gun aimed at the door, but as soon as you reach a certain distance, you begin to run. You run into the bush. It is dawn outside so the sun is peaking, giving you light to see. You avoid any bear traps set up in the forest, and successfully make it back to the car. You see a man on a bike coming down the road and wave him down for help. He rides towards you and stops. \n\n\n\"Hey, you don't look so good.\" He says. \"Follow me onto the main highway to get service, looks like your car is busted. I don't know what spike strips are doing on this road, but I'm glad to see no one got hurt.\"\n\n\nYou don't tell him about Kent, or anything that happened during the night. You just follow him out of the forest and back onto the main highway. Before you call anyone, you delete the picture of the couple from the blue cabin off your phone. You call for help and on the sidewalk of the highway, waiting for the mechanic to arrive to get the truck, and drive you home. The biker leaves you as you sit and wait. \n\n\nAfter about fifteen minutes, the mechanic arrives. \n\n\n ", "action_results": [{"action": "Go home", "result": "After towing the car, the mechanic drops you off at home. \n\n\nYou walk into your house and lay on the couch. This was the worst night of your life. You are exhausted, but cannot fall asleep, as too many horrible images are playing through your head. Suddenly, there is a knock at your door. \n\n\nYou get up from the couch and slowly approach it. The knock continues. \n\n\nYou put your hand on the knob, and as you are about to open the door, you hear a voice:\n\n\n\"Obey\". ", "action_results": []}]}]}]}]}, {"action": "Ignore it", "result": "You ignore whoever is at the door. \n\n\nThe person keeps knocking. You still ignore them. The knocking stops for a moment, then the person begins to smash the door open with an axe. \n\n\n\"Obey! Obey! Obey!\" the man shouts as he takes swings at the door. \n\n\n\"Jesus christ!\" Kent shouts. \"What the hell is happening!?\"\n\n\nThe man successfully smashes open the door and enters the cabin. He is a large bearded man with a blank stare. \n\n\n\"Obey!\" he shouts at you. \n\n\n\"What?!\" Kent questions. \n\n\nThe man lifts the axe.\n\n\n\"Obey!\" he shouts. \n\n\nHe turns towards Kent, and winds up the axe. \n\n\n\"Obey!\" he lets out. \n\n\nKent covers his face with the hands. \"Okay! Okay! We obey! We obey!!\".\n\n\nThe man stops the attack, and leaves the cabin. \n\n\n\"What the hell was that about?!\" Kent says to you. \"Screw spending the night here. Everyone is insane! I say we leave right now!\" ", "action_results": [null]}]}]}, null]}, null]}, {"action": "The blue cabin", "result": "You silently walk to the cabin with the blue symbol on the door. \n\n\nYou creep around the back and find a sole window. You peak in the window to see a man and woman having sex. \n\n\n\"Nothing for us to see here.\" Kent proclaims. \n\n\nYou sneak around the cabin and notice you stepped on something after hearing a light crack. You pick it up to see it is a police badge. \n\n\n\"Looks like the cops were here I guess.\"\n\n\nYou put the badge in your pocket and keep sneaking around the cabin. \n\n\n\"That's all for this one I think. Where to next?\" \n\n\n \n\n ", "action_results": [null, null]}, null]}, {"action": "Stay in the cabin", "result": "You decide to stay in the cabin.\n\n\n\"I know you don't really want to stay in here. You want to find out what's going on here just as badly as I do.\" Kent tells you. \"And I know you're short on money too. The pay we'll get from blowing the roof off this place will solve all your problems. What do you say?\"", "action_results": [null]}]}, {"action": "Hide the hand under the bed", "result": "You hide the hand under your bed. \n\n\n\"Come in!\" says Kent. \n\n\nAngel enters the cabin. \n\n\n\"I just wanted to see how you guys were settling in.\" she informs. \n\n\n\"Oh we're just fine. Getting ready to go to bed now actually\" Kent replies. \n\n\n\"Alright. Let me just check something for you. Sometimes mice get into the cabins and hide under the beds.\"\n\n\nAngel looks under the bed, and sees the hand. She turns back to you, speechless. You turn to Kent but notice he has run out of the cabin, so you follow. You run behind Kent, and sprint towards the forest, but you trip on a stump. The fall sprained your ankle, and as you are tending to it, you hear a voice approaching in the distance:\n\n\n\"Obey! Obey! Obey!\"\n\n\nYou turn to see a large beared man with and axe charging towards you. You try and crawl as fast as you can but the man is too fast. He swings the axe and gets you in the back of the head, killing you. ", "action_results": []}]}, {"action": "Leave it alone", "result": "You leave the bag alone. \n\n\nKent closes the fridge. You wander around the cabin aimlessly until curiosity gets the better of you. \n\n\n\"I want to know what's in that bag\" Kent tells you. \"We should open it\".", "action_results": [null]}]}, {"action": "Leave the sanctuary", "result": "You decide not to stay at the sanctuary.\n\n\n\"Lets go.\" says Kent in agreement. \n\n\nAs you begin to leave, you run into a large man with an axe in his hands. \n\n\n\"Where do you think you're going?\" he asks.\n\n\n\"We're just leaving. We appreciate the hospitality but we'd rather sleep in our car.\"\n\n\n\"Too dangerous to leave here. Too dangerous to disobey. You must obey. Always obey. Obey. Obey. Obey. Obey...\" The man repeats as he walks away. \n\n\n\"What the hell was that about?\" Kent whispers to you. \"Maybe leaving isn't a good idea. I don't wanna run into people like him in the forest when it's this dark out. We might as well stay.\"\n\n\n ", "action_results": [null]}]}, null]}, {"action": "Try to find your way out of the forest", "result": "You and Kent try to get out of the forest yourselves. \n\n\n\"What about my car?!\"\n\n\nYou agree you will come back for it during the day tomorrow. You walk down the road and see through the trees that there is light from a highway on the other side. You cut through the trees, but suddenly...\n\n\nSNAP\n\n\nYour leg is caught in a bear trap. There is so much blood that it makes Kent faint. You're stuck. \n\n\n ", "action_results": []}]}, {"action": "Chug the beer yourself", "result": "You chug the beer down. \n\n\n\"What the hell man! That was mine! Your a shit friend, you know that!\"\n\n\nAs Kent lectures you, he doesn't pay attention to the road and drives over a spike strip. The car spins out of control. You get out of the car and see that the tires are busted. \n\n\n\"Oh no! This is my Dad's car! He's gonna kill me!\"\n\n\nYou take out your phone and notice it has no service. You turn your attention to down the road, where a person in a grey hooded jacket approaches. \n\n\n \n\n \n\n ", "action_results": [null, null]}]}, {"action": "Stay on the road", "result": "You choose to stay on the road and are against taking the detour. \n\n\n\"Come on man, we're never gonna make it on this road. We might as well turn back and not do anything at all tonight.\"", "action_results": [null, {"action": "Turn around and go home", "result": "You tell Kent you want to go home. \n\n\nKent turns the car around, and drives you home. He doesn't talk much to you afterwards, and sees you as being to scared to do anything fun. No one likes a sissy. ", "action_results": []}]}]}