{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=54187", "context": "", "first_story_block": "It's been 7 months since your dad got the job out here in the Adirondacks. You used to go hiking with him all the time back in Utah when you were younger. But his job keeps him pretty busy. You know this was a sweet opportunity for him and both you and mom supported this move. And you've been itching to get out here on these trails up in these mountains. Secretly you wished you were back out west, you miss your friends. You guys used to hang out all night on a mountainside.  \n\n\nNow you are lost in the forest by yourself, and this hike you've been anxious to take has turned into a race against time. Your phone died hours ago from listening to your stored music. It won’t even flicker on anymore. You have been on these back trails for hours now. Your water bottle is dry. It has to be close to 10 o'clock by now. You have gotten so turned around and need to find a way out.", "action_results": [{"action": "A Clearing Ahead", "result": "You see a small dilapitated cabin in a clearing. The moonlight shows through the trees a little more here. It looks abandoned and unused. Maybe you can sleep there. Maybe there are provisions... Maybe...", "action_results": [{"action": "Dark but has Furnishings", "result": "You peek inside the open door and see that there are some sparse furnishings; a fireplace, a rickety wooden chair and a table. It looks like no one has been here in years. Hermits used to live out here and some of these cabins are still used from time to time by groups of kids on weekends. It might be a quiet place to rest. You are tired.", "action_results": [{"action": "Decide to stay here and wait until morning to find your way back.", "result": "Inside the Cabin...\n\n\nAs you fumble through the dark cabin, the floor creaks under your shoes. Your hand rests on the back of a rickety chair. As your eyes adjust further, you see the fireplace and table more clearly. The table is bulky and heavy...\n\n\nYou are tired, and starting to get a little uneasy...\n\n\nDo you...", "action_results": [{"action": "Decide to light a fire...", "result": "You decide that a fire would be cheerful and might help. People coming by might see the light and give assistance too. \n\n\nYou are going to need some wood...", "action_results": [{"action": "Decide to go out and gather sticks and wood to light the fire...", "result": "You need to find some firewood...\n\n\nAs you use the moonlight to search the ground outside for sticks and wood to make a fire, you hear something...\n\n\nFaintly in the trees at the edge of the clearing comes a sound like a bird chirping maybe. Or maybe a child giggling. It is faint, but you can feel the hairs on your neck stand up. Your eyes try to penetrate the tree line deep into the woods, but you see nothing in the dappled shadows. \n\n\nYou hear it again, but now it sounds like it is coming from the area behind the cabin. Or is it in the cabin? You are getting worried and the sound seems to fade away a little.\n\n\nNow you hear nothing except the pine trees bustling occasionally in slight cool breezes. \n\n\nDo you...", "action_results": [{"action": "Clutch the thickest branch you can find and wield it like a baseball bat and re-enter the cabin...", "result": "Batter Up!\n\n\nUpon entering the cabin, it is clear that nothing has changed. You listen to the still night air. You can't hear the chirping anymore. It must be your imagination. Probably just a bird or fox or something. You take a moment to check your phone again. Nope. Still won't turn on. \n\n\nYou feel even colder and more tired than before. You need to get that fire going...", "action_results": [{"action": "Decide to return outside and gather firewood...", "result": "Firewood, Take 2...\n\n\nWith a sigh, you drop the large stick you were wielding by the fireplace and proceed back out into the night air to fetch more wood.\n\n\nAs you step out into the old porch, a board gives way and you tumble out onto the ground striking your head on a rock. \n\n\nYou are knocked unconscious and blood drains from a gash on your head onto the ground. \n\n\nYou are found 2 days later by a fellow hiker, you are rushed to a hospital with a broken ankle and a  gaping head wound via helicopter-  but it was just too late. \n\n\nYour legacy...\n\n\nThe cabin is renamed after you in your honor, and is a landmark on the backwoods trails.Your parents and friends plant a memorial in your honor in front of the cabin for all future hikers to see.\n\n\n ", "action_results": []}, {"action": "Decide you probably should just break up this rickety old chair and get the fire going...", "result": "Burn the chair.\n\n\nYou need to get this fire going. The chair is old, and definitely dry.\n\n\nSure enough, using some old fashioned camping skills, the splintery wood ignites and a robust fire is crackling in the fireplace, casting light into all the unseen corners of the small cabin. You sit on the floor staring into the flames, and you reminisce about campfire you and your dad shared out under the stars a few years ago. You are mesmerized for a while, living in that memory. ", "action_results": [{"action": "You notice something in the room.", "result": "Looking around the small cabin, you see that on the far wall is a collection of young faces staring from newspaper clippings. Each is an article about a young person who has been missing.\n\n\nThe oldest clipping is from 30 years ago, and the most recent appears to be only a couple of months old. Someone has been collecting these articles here in this spot for a long while. \n\n\nWhat should you do now?\n\n\nDo you...", "action_results": [{"action": "Decide to stay here and barricade the door, but there is no way you are getting any sleep tonight...", "result": "The sturdy table weighs a ton and will do a good job of barricading the door. You slide it across the rubble on the floor and flip it on its side against the old door. You sit down behind it on the floor and lean your back against the wood. You have no intention of becoming a statistic. You can make it through one night. \n\n\nThe crackle of the fire is comforting but the light is beginning to die down. ", "action_results": [{"action": "The fire is dying.", "result": "As the light from the fire grows dimmer, you become concerned. Maybe your imagination is getting away from you. \n\n\nYou stare into the orange embers and you see the faces on the wall start to fade away again into the orange glow. \n\n\nSuddenly you are startled by an unfamiliar sound. It sounds like a baby giggling or a strange bird warbling somewhere nearby.  \n\n\nYou are now spooked and terrified. \n\n\nDo you...", "action_results": [{"action": "Decide to stay barricaded and investigate the cabin thoroughly before your light runs out.", "result": "You find some suspicious claw marks along the floor that lead to a corner with some loose floor boards.", "action_results": [{"action": "Remove the loose boards.", "result": "The planks of wood are covering a crawl space that is filled with something that is heaped in there like sacks. You can't tell what is down there. You see a glint reflecting back at you and wonder if it some critter's eyeshine but you can't see well enough. You  walk over to the fire and pull a stick out. You blow on the glowing end of the stick until it perks up and you get a small yellow flame. You hold the stick out over the hole, and you finally see clearly what is in there. The shock makes you drop the stick and back away to the fireplace. \n\n\n ", "action_results": [{"action": "In the hole...", "result": "You slowly steady yourself and creep back to the edge of the hole. You see that there are heaps of bones and tattered coats and clothes stuffed into the underside of the cabin. One of the skulls glares up at you with empty sockets. There is a glint of blue and your eyes see in the faint light that there has been a trinket or something with a blue jewel in its center that has been deliberately placed into the top of the pile under the floor boards. \n\n\nThere is a blue glow now emanating from the trinket. It looks like it was placed there on purpose. But why?", "action_results": [{"action": "The Amulet", "result": "The Amulet is strange with markings all around it. It seems that you don't want to look away from it. Strange, that among all the bones and carnage, the only thing you are thinking is about the amulet.\n\n\nDo you...", "action_results": [{"action": "Decide that the amulet would be worth having and take it?", "result": "As your fingers close around the amulet you feel tingling and sense that it has some force to it. Something exciting. You lift it and see that it comes attached to a chain. You place the chain around your neck. You feel light-headed. You look around and your vision becomes brighter. You look back into the hole. You see some movement. You lean a little closer and can hear the sound again. The chirping giggling sound from before.\n\n\nThe empty eyes of the skull you were looking at now are glowing with a blue that resembles the trinket's blue jewel. Other glowing eyes peer up at you from the hole.", "action_results": [{"action": "Laughter grows louder", "result": "The laughter grows louder and from the hole, the spirits of all the corpses flood at you and strip you of your soul. \n\n\nYour body is now a new addition to the heaps under the floor. Your life force added to the Amulet. \n\n\nThe newspapers run an article about your disappearance in the weekend edition and news teams flood the area with coverage for two weeks. \n\n\nThe cabin is not found. You are not found. But your picture now stares into the empty room of an old dilapitated cabin from a wall with other faces in newspaper clippings.  ", "action_results": []}]}, {"action": "Feel uneasy about moving it from its final resting place.", "result": "You leave it alone. \n\n\nThe amulet will remain in place. In the morning, you can bring the police back here and they can investigate.\n\n\nYou throw the pulled up floorboards into the fire. They should last a few more hours.\n\n\nYou press your back firmly against the table and before you know it, you have fallen asleep.", "action_results": [{"action": "Hours Pass...", "result": "It is morning.\n\n\nAs the sun climbs into the sky, you hear voices again. But this time, they are familiar voices. Your mom and dad are yelling out from up the trail. \n\n\nYou are saved.\n\n\nOver a good hearty breakfast at the nearest diner, you tell them about all your adventures. \n\n\nPolice are called to search the cabin and they discover the corpses and the clippings. They investigate and tie it all to one person who is arrested quickly and brought to justice.\n\n\nIn the papers and on national news stations,  you are congratulated as a hero for helping to solve 18 cold cases of missing persons!\n\n\nYou are just glad it wasn't 19. You still love to hike and the outdoors, but you stay to the main trails now.", "action_results": []}]}]}]}]}]}, {"action": "Decide this is just TOO creepy and you'd feel safer away from this cabin.", "result": "The forest looks like a better option...\n\n\nYou scan the clearing and find a path leading away from the cabin.\n\n\nThe path is dark and visibility is poor.\n\n\nAs you enter the forest, your eyes adjust to the poor light and your ears pick up everything scurrying away from you into the shadows.\n\n\nAs you walk, you can't be sure if it's your own echo or if there is someone, or something, walking behind you.\n\n\n \n\n ", "action_results": [{"action": "You quicken your steps...", "result": "There is fork in the path ahead.\n\n\nYou come upon a sign in the path that indicates the way to Route 20.\n\n\nIf you can make it there, you are sure you can find your way back.\n\n\nUnfortunately, the sign has been damaged and the direction is unclear...\n\n\nThe way you should take is a total coin toss. You see no difference and can't figure out which way is better.\n\n\n ", "action_results": [{"action": "Decide to go left.", "result": "The woods this way are thick and dark.\n\n\nThe sound of leaves on the path are the only thing you can hear. \n\n\nThe air is thick and you feel an oppressive sensation. You slow down. You feel like someone is watching you from up ahead.\n\n\nIt feels just wrong. Maybe you are doubting your decision to go left. Maybe right was easier and not so dark.\n\n\nYou see a light up ahead on the trail. You quicken your steps. In front of you, clear as day is a  girl sitting by a tree, in the only light that has filtered through the tree tops. She has her face in her hands and is crying. But there is no sound. \n\n\nIt's like watching a silent picture. You speak up, \"Hey little girl, are you lost?\"\n\n\nNo answer. No reaction. You speak a little louder, \"Hi little girl, can I help you?\"", "action_results": [{"action": "Something's not right Run past her on the trail.", "result": "You slide by as far away as possible on the other side of the path and hurry up the path.\n\n\nThere was something 'off' about that little girl.", "action_results": [{"action": "You see car headlights flicker.", "result": "You see car headlights flicker through the trees up ahead. You hurry to them as quickly as your sore legs can take you.", "action_results": [{"action": "The Road!", "result": "You found the road. You can do this alone. \n\n\nYou now just have one important decision to make...\n\n\n ", "action_results": [{"action": "Decide to go up the road...", "result": "After about 15 minutes of walking up the road, a car pulls into view in the distance.\n\n\nYou are tired, but you are also alone.", "action_results": [{"action": "Decide to see if they can help you.", "result": "The car pulls over ...\n\n\nThe man in side gives you a warm smile. He reminds you of someone's grandfather. \n\n\n\"You're out here pretty late. Do you need a lift? You seem lost.\" There is a twinkle in his eye. \n\n\n ", "action_results": [{"action": "Decide to get in the nice man's warm car.", "result": "You \"hop on up,\" as he phrased it.\n\n\nYou are never seen again!\n\n\nNo one ever knows what happened to you. \n\n\n ", "action_results": []}, {"action": "Decide to walk away and pretend you don't need any help.", "result": "You are not going to get into his car...\n\n\nHe seems nice, but you know not to take rides from strangers.\n\n\nStill, he might be able to help...", "action_results": [{"action": "Decide to ask to borrow a cell phone...", "result": "\"Well, I could use a little help.\" \n\n\nThe man continues to smile and you ask him to do you a small favor.\n\n\n\"May I borrow a cell phone?\"\n\n\nHe fumbles through his shirt pocket and hands you an older cell phone.\n\n\n\"Thank you so much.\" \n\n\n \n\n ", "action_results": [{"action": "Decide to call Mom and Dad...", "result": "You dial the number quickly.\n\n\nYou hear a couple of rings and turn your back away from the noise of the car for privacy.\n\n\nYou hear a couple of rings. The voicemail picks up...", "action_results": [{"action": "Leave a message...", "result": "Before you can leave a message, a strong arm grabs you around your neck and you are pulled into the car violently and you BLACK OUT!\n\n\nYour parents and police search for you and trace the last call that rang through on the night of your disappearance to a pay-as-you-go type phone and the trail runs cold. \n\n\nYou are never seen again. ", "action_results": []}]}, {"action": "Decide to call the Police for help...", "result": "\"Thanks for the phone.\"\n\n\nYou want help and you want it fast!\n\n\nYou dial 9-1-1.\n\n\nThe line picks up immediately. \"9-1-1, What is the nature of your emergency?\"\n\n\nYou give them your name and tell them you have been lost for hours...", "action_results": [{"action": "Continue...", "result": "\"Police are on their way.\" You tell the man in the car.\n\n\n\"Well that is great, I'm so glad. I really need to get going. May I please have my phone back?\"\n\n\nYou hand the phone over and he quickly grabs it and steps on the gas and is gone. \n\n\nAfter about 10 minutes and no other cars showing up, a squad car pulls up, closely followed by your parents in their car...", "action_results": [{"action": "Where will you go?", "result": "You are Saved!\n\n\nThe first place your mom and dad take you is for a good hearty breakfast at the local diner, where you tell all about your adventures.", "action_results": []}]}]}]}, {"action": "Decide it's better to get away and quickly. Start jogging away with no explanation.", "result": "You decide to keep walking and after less than 3 miles of walking, you find the town.\n\n\nYou stumble into the first gas station that thankfully is open 24 hours and ask to use their phone. They do not refuse due to the hour and how dirty your look after your ordeals.\n\n\nYour mom and dad are there in less than 5 minutes.\n\n\nThe first place your mom and dad take you is for a good hearty breakfast at the local diner, where you tell them all about your adventures.\n\n\nYour shoes are ruined, your muscles ache, and you are thirstier than you've ever been in your life, but you are home. ", "action_results": []}]}]}, null]}, null]}]}]}, {"action": "Maybe she's deaf,", "result": "You are lost and you don't know if you can really help. But at least you'll have company and maybe help someone else.\n\n\nYou approach the sobbing girl. Still no sound, but the girl has buried her face in her hands and pays you no attention. \n\n\nYou reach out to tap her shoulder gently...", "action_results": [{"action": "The girl...", "result": "Before you touch her, she snaps her head up and stares at you with lifeless sockets. You are dead. Your body was found 2 minutes from Route 20 when people came looking for you. Coroner said you died of a heart attack!\n\n\n ", "action_results": []}]}, {"action": "NOPE! NOPE! NOPE! - Too freaky- I'm going back to the right.", "result": "After a short while, you see this way lets in a little more moonlight and seems more traveled. \n\n\nQuickly moving down the path, you feel the ground get softer and the incline lets you know that you are traveling down a slight hill. \n\n\nThe sounds of the forest seem to die away and in the distance you can hear water...", "action_results": [{"action": "At the river...", "result": "You arrive at the banks of a river. The water looks pretty deep. You seem to recall passing by this wide stream somewhere earlier in the afternoon and it was right by where you entered the forest. If you follow the stream, it can lead you out. \n\n\nBut... Which way?", "action_results": [{"action": "Follow upstream...", "result": "A houseboat? Well, more like a raft with a wooden shack on it. \n\n\nLooks like the old boat has been here for years. It has tons of spider webs and the frogs are virtually living on its deck. But it looks harmless enough and It is getting late.\n\n\nYou are hungry and tired. You have been walking for hours.\n\n\nYou peek inside the boat.  It is abandoned, but doesn't seem to have any problems with floating. Even if it sank, the water is probably 2 feet deep maximum here by the shore.\n\n\nThe sound of frogs croaking is soothing and the small cabin on the boat seems almost cozy.\n\n\nWill you...", "action_results": [{"action": "Wait for morning on the boat?", "result": "You find the corner of the cabin cozy enough and hunker down for a quick snooze.  But as soon as your eyelids close, you are awakened by a wiggling of the boat. \n\n\nHas someone gotten on? You can't see anyone through the glassless windows of the cabin. You sit up for a moment and look in all directions. \n\n\nIt must've been a rouge wave that slapped up against the side of the boat.\n\n\nSomething else is different. It's quieter. The frogs croaking has stopped. Maybe a cloud has come over the moon or something. \n\n\nYou call to the outside, \"Hello?\"\n\n\nThe only response you hear is a far away owl hooting as if in reply.  ", "action_results": [{"action": "Back to sleep.", "result": "It is morning.\n\n\nAs the sun climbs into the sky, you hear voices again. But this time, they are familiar voices. Your mom and dad are yelling out from up the trail. \n\n\nYou are saved.\n\n\nOver a good hearty breakfast at the nearest diner, you tell them about all your adventures. ", "action_results": []}, {"action": "Get the heck outta here and keep moving until you're safe.", "result": "Gotta Get Away! \n\n\nYou reach the doorway and step out onto the deck of the boat. The moon is being covered by a dark cloud. The light is dim. You step forward to move to the shore side of the boat and trip over a thick hard log onto the deck. \n\n\nThe log is moving?\n\n\nQuicker than you realize what is happening, an alligator has you in its jaws and the pain in your leg is so intense that you scream out as loud as you can.\n\n\nBefore you can inhale again, you are already dragged under water. Your lungs are empty and you drown quickly.\n\n\nLooks like the alligator is getting more than frogs for dinner tonight. \n\n\n ", "action_results": []}]}, {"action": "Continue Upstream?", "result": "You continue for what seems like an hour and you stay as close to the banks of the water as you can.\n\n\nYou see car headlights flicker through the trees up ahead. The sound of the engine speeding away into the distance encourages you to quicken your pace...\n\n\n ", "action_results": [null]}]}, {"action": "Follow downstream...", "result": "A waterfall?\n\n\nYou don't remember passing a waterfall. You need to get a better look...", "action_results": [{"action": "Waterfall...", "result": "Too close...\n\n\nYou step on some loose wet rocks and slide into the water. You hit your head on the way into the water and slip into unconsciousness. \n\n\nYour bloated corpse is discovered 2 days later 7 miles downriver on the shore. ", "action_results": []}]}]}]}]}, null]}]}]}]}, null]}]}]}, null]}, null]}, {"action": "Decide that you are just too sleepy, and the sooner you sleep, the sooner it will be morning...", "result": "As you lay your head down in your arms to sleep, you listen to the night sounds outside the cabin...", "action_results": [{"action": "Can't Sleep", "result": "You are just about to fall asleep when you hear a sound that is unfamiliar...\n\n\nIt sounds like a strange bird warble or a child's giggle.\n\n\nIs it coming from inside? It is hard to tell...\n\n\nDo you...\n\n\n ", "action_results": [{"action": "ignore the sound.", "result": "You are discovered by the serial killer that uses this cabin as his safe hous\ne. and you are added to his long list of victims. ", "action_results": []}, {"action": "investigate the sound...", "result": "You squint your eyes and peer into the corners of the small cabin. \n\n\nYou are straining your ears and willing yourself to hear the smallest sounds. All you hear is your heart beating in your ears. \n\n\nDo you...", "action_results": [null, null]}]}]}]}, null]}]}]}