{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=38891", "context": "", "first_story_block": "Porras\n\n\n\"I don't drink,\" you say.\n\n\n\"You don't drink? How can a man not drink? Come on, one drink, on me!\" Blanco says. \"Have a drink, Porras! Live a little!\"\n\n\n\"It leads to immorality.\"\n\n\n\"It leads to immorality?! Rivera's drinking so much he's pissing lager, yet I will bet my fucking house he'll be in church tomorrow! He's not immoral!\"\n\n\nRivera smiles and gives a thumbs up and downs another shot.\n\n\n\"Going to church doesn't mean shit. Half the kids here in Tijuana are clutching a gun in one hand and a crucifix in the other,\" you reply.\n\n\n\"Ah, here he goes again! Fuck, somebody get a few drinks in this man!\" Blanco exclaims loudly, annoying the other residents of the bar.\n\n\n\"Calm it down, gentlemen! We're all friends here!\" Rivera smiles cheerfully.\n\n\n\"Captain, order Porras to have a drink!\" Blanco exclaims loudly.\n\n\nCaptain Mendez allows his stone face to crack slightly as he gives a tiny smile, but he doesn't reply.\n\n\n\"I can understand it. I wish I didn't drink so much,\" Rivera says.\n\n\n\"Once you see what the Cartels can do to a man, you'll be glad for it to ward off the nightmares,\" Blanco says.\n\n\n\"Maybe,\" Rivera shrugs. \"Hey, alcohol breaks up families. My wife is pregnant. I want to be at my kids graduation rather in a bar.\"\n\n\n\"If you want to be a family man, what the fuck are you doing in SWAT? This job takes a lot of our time, is very stressful and the Cartel have a price on all of our heads,\" you say.\n\n\n\"I want to make a difference,\" Rivera says defensively.\n\n\n\"You are,\" Captain Mendez says.\n\n\n\"If there has ever been something to toast to, it's that!\" Blanco says, raising his shot glass as he tries to fill it with vodka, spilling half on the table.\n\n\nYou raise your glass of coke, and nod.\n\n\n\"To making a difference!\"\n\n\n\"To making a difference!\" you all shout.", "action_results": [{"action": "The Next Morning...", "result": "Blanco\n\n\n\"Fuck!\" you shout, staring at your reflection in the mirror as you cut open your face again in a pathetic attempt to shave.\n\n\nYou made some bad choices last night. You could've handled the drinks you had with your friends, it was the additional bottle of whiskey matched with the speedball you put into your veins after you got home and invited some lady friends off the street and back into your room that did you in. You think Rivera and Porras suspect, and Captain Mendez must know about the amount of evidence disappearing and the reports of dealers being shaken down by an off-duty caught, but because of your otherwise squeaky clean record, he's let you off.\n\n\n\"Are you sure you don't want to come back in bed for a few minutes?\" the ugliest of the prostitutes calls.\n\n\n\"Get out of my house, we're finished here!\" you call with annoyance, before finishing shaving.\n\n\nYou sigh, before hearing your work phone ring.\n\n\n\"Fuck!\" you scream, punching the mirror.", "action_results": [{"action": "One Hour Later...", "result": "Rivera\n\n\n\"Anyone want coffee?\" you ask, staring at Porras and Captain Mendez, as well as the other four members of your team, Garcia, Gallo, Perez and Sindile.\n\n\n\"Black,\" the Captain replies, as the others remain quiet.\n\n\nBlanco bursts through the door, a cigarette clenched between his teeth.\n\n\n\"Sorry I'm late,\" he says, grabbing a chair and sitting. \"What's the situation?\"\n\n\n\"We have reports of the location of a group of kidnappers known as the Espada de Dios,\" Captain Mendez says as the projector shudders to life to display an old, massive wooden mansion in the middle of the desert.\n\n\n\"Espada? We'll be killing priests? Porros rejoiced and Rivera wept!\" Blanco laughs.\n\n\n\"Priests don't kidnap people. These are criminals, Satanists. They do not have the Lord's protection,\" you reply as your fingers absent-mindedly wrap around your rosary.\n\n\n\"Satanists? Says who? When I was a boy, I had a man on my street who was an alien android, a mad psychologist, a prince, a general and the horseman of war. You can't trust rumors,\" Porras says.\n\n\n\"I don't give a damn. We move in, kill any hostiles and save any hostages. Same as usual,\" Captain Mendez says.\n\n\n\"Yes, sir!\" you all respond.\n\n\n\"Everyone in the truck. We'll go over the plans inside.\"", "action_results": [{"action": "Forty Minutes Later...", "result": "Mendez\n\n\nYou've done this many, many times before. You've led countless raids, and have one of the lowest causality per raid rates of any SWAT team. Still, you feel fear as you approach this mission, a heavy pit in your stomach. This is the kind of fear you've felt sitting up in bed, alone in the house as Papa drinks at the bar and Mama works the streets, hearing noises from every shadow outside your window, or under your bed, or in your closet. You need to stay strong for your men, though.\n\n\n\"Alright! Everyone clear with the plan?\"\n\n\n\"We split up and everyone gets a scooby snack?\" Blanco smiles from the driver's seat.\n\n\n\"Gallo and Garcia go in through the back, sweeping through the kitchen. Sindile and Perez head through the side entrance into the lounge, and they both head through the hallways to meet with us in the central chambers as I take Rivera, Blanco and Porras into the main entrance. Then, we clear the upper floors while Rivera and Porras defend the lower floors, and then we sweep the basement.\"\n\n\n\"Got it, boss,\" Blanco says.\n\n\n\"Yes, sir,\" the others reply.\n\n\n\"I want to move quickly. If we haven't secured the ground floor in sixty seconds, we've fucked up. Got it?\"\n\n\n\"Yes, sir!\" they bark.\n\n\n\"Good!\"\n\n\n\"Five minutes!\" Blanco barks, as the van goes silent.\n\n\n\"Three minutes!\"\n\n\n\"Sixty Seconds!\"\n\n\n\"Ten Seconds!\"\n\n\nThe van pulls up outside the house, and the group bursts out. Silently, you move out of the back, motioning for Gallo and Garcia to head around the back as Perez and Sindile head to the side. Blanco and Rivera take position on either side of the door as Porras jogs forward holding a sledgehammer. You stand by the door as Porras raises the hammer, before swinging.", "action_results": [{"action": "Enter the house", "result": "Porras\n\n\nYour sledgehammer breaks the door open after a hefty swing, and it caves inwards. You toss the sledgehammer aside as Blanco, Rivera and Captain Mendez charge in. You quickly follow in afterwards, raising your submachine gun. A waft of warm air hits you, blasting your senses with the smell of rotting meat and burnt wood. You quickly scan the room, before pausing momentarily in shock.\n\n\n\"Jesus Christ...\" Blanco says.\n\n\nThe room has a grand stairwell, and piled all along it are mutilated bodies, all missing arms, legs and heads with their torsos hacked apart, gaping holes where each of their hearts would be. You see some have their mouths and eyes stitched shut, but thankfully they're all dead. Then, you see at the top of the grand staircase is a massive crucifix. Affixed to it is a pale man, his eyes gouged out to leave two bloody holes that stare into your eyes. His mouth has been carved into a brutal Glasgow grin, before being stitched shut, leaving a creepily long smile that stand in contrast with the sheer desperate terror on what remains of his face. His naked body is covered with scars, some old, some recent. His genitals are missing, a horrified, infected hole where they once were. He stares at you in terror, somehow seeing you. His body writhes in pain as his joints twist despite being nailed to the cross, desperately moving as his stigmata begin to bleed onto the floor suddenly. \n\n\n\"God our father, grant this...!\" Rivera begins praying.\n\n\n\"Men! Check those corners! Secure the floor! Stay on target!\" Captain Mendez barks. \"Rivera, call in med...\"\n\n\n\"Captain!\" the radio crackles to life. \"We're under attack! They're everywhere! They took Gallo... AAH! Get off me! Get off me! Captain, we need...\"\n\n\n\"Shit! Rivera, Blanc...\"\n\n\nThe radio goes silent.\n\n\n\"Captain!\" the radio bursts out again, and you recognize Perez's voice. \"Sindile and I got seperated! What the fuck are these...? No, please! Please, I...!\" \n\n\nPerez's voice is replaced by a long, horrified scream of terror, pain and desperation.\n\n\n\"AAAH!\" a voice screams, this one not coming from the radio.\n\n\nYou turn and look as the crucified man's stitches tear open, releasing a wave of blood as his lips are torn apart.\n\n\n\"Expergiscere!\" he screams in a deep, garbled voice, before he bursts into a deep laughter.\n\n\nSuddenly, the bodies on the ground begin shuddering, and they begin to stand. The crucified man continues laughing as the bodies continue to stand, pulling themselves up via the banister and standing up on legs, arms and even wrapped around other corpses. The monsters all stand, and there's a second of silence as the crucified man stops laughing. The monsters slowly turn, staring at you.", "action_results": [{"action": "Get out via the front door", "result": "You run to the front door, before pausing.\n\n\n\"What the fuck?\"\n\n\nYou turn to see that now standing in front of the door is a completely white, humanoid creature that hangs on the door frame, stretching across the door way. The creature has completely black eyes, and its hands and feet have long, sharpened bone claws. \n\n\n\"What the fuck is that?\" Captain Mendez barks.\n\n\n\"Its a demon...\" Rivera whimpers.\n\n\n\"Fuck that, shoot it!\" Blanco shouts, stumbling to take out his gun.", "action_results": [{"action": "Open fire on the creature", "result": "You raise your gun and open fire on the creature, but your bullets simply bounce off its white hide. It continues hanging there, as your and your comrades unleash all you have.\n\n\nClick\n\n\nYou're out of ammo. Suddenly, the creature bursts forward, grabbing Captain Mendez with immense strength and flinging him over its shoulder, and climbing along the stairwell to the upper floors. Captain Mendez screams as he fires his gun repeatedly in the creature's head to no avail. You stare as he's dragged away, and see that the only way to get to him is through the monstrous dead.", "action_results": [{"action": "Charge through the monsters", "result": "You charge into the packs of monster, ramming your shoulder into the creatures, knocking them aside. Then, they attack. You feel dozens of rotting hands grab the plates of your SWAT armor and begin to scratch and tear at your face.\n\n\n\"Get the fuck off me!\" you scream.\n\n\nYou're lifted up, and flung along the room. You scream in terror as you smash into the wooden floor as it bends and snaps, smashing open as you go through the floor with a scream.", "action_results": [{"action": "Fall", "result": "You fall through the floor, falling for a second before landing painfully on the cold concrete floor. You feel your legs snap as you let out a terrified scream, crumpling to the floor as you look around, seeing nothing but darkness. You hear the horrible noises upstairs go silent, and are left alone in the darkness.\n\n\n\"Hello? Hello?\" you call.\n\n\nYou hear sniffling, wheezing and gasping around you in the darkness as the other residents of this basement hear you. Deep breathing slowly gets louder as they begin heading towards you. You begin to crawl desperately backwards, your broken legs painfully scraping along the floor as you bite your lip until it begins to bleed profusely as you try to prevent yourself from whimpering and alerting the creatures as you're left alone in the dark.", "action_results": [{"action": "Keep crawling away", "result": "Blanco\n\n\nYou're running desperately away from those fucking undead when the door bursts open in front of you. You see a tall, gaunt man wearing a priest's outfit with the classic black clothes and a white collar with midnight black hair. He stares at you for a second, before grabbing you. A black cloth sack goes around your head, tightening as you lose sight and it tightens. You grab at the priest's throat as he pulls you into a side room, throwing you to the ground. You fumble to pull the sack off your head, and finally drag it off. You look up in time to see the boot slam into your face as blood spurts out of your nose and you collapse backwards again, this time losing consciousness.", "action_results": [{"action": "Awake", "result": "You awake naked in a small metal cage, unable to move. You bend your head slightly, looking up to see the priest.\n\n\n\"Who the fuck are you?\" you scream. \"Let me out! Let me out, bastard!\"\n\n\n\"I am Father Borgogni,\" he says.\n\n\n\"Why are you doing this? Let me out! What the fuck did you do to those bastards?!\" \n\n\n\"Hush now. They were sinners, and hence, they were targets of them. You are a target. You are a sinner.\"\n\n\n\"Fuck you, you son of a bitch,\"\n\n\n\"We are all sinners, child. Yours are particularly obvious.\"\n\n\n\"You don't know me! You don't know my sins!\"\n\n\n\"They are written across your arms, child.\"\n\n\nYou look down at your arms, spotting the various track marks that cover your arms.\n\n\n\"Fuck you! Let me out you monster!\"\n\n\n\"We are all monsters,\" Father Borgogni says.\n\n\n\"Let me out, then!\"\n\n\n\"I can't do that. You need to face your sins. From the fires, we find redemption.\"\n\n\n\"What are you talking about, you crazy bastard?\"\n\n\nYou crane your heard around, seeing that your metal cage sits above a small, gas-operated fireplace.\n\n\n\"Wait, wait, what are you...?\"\n\n\nFather Borgogni starts the gas, and it begins to spray up at you.\n\n\n\"No! Please, no!\"\n\n\nFather Borgogni pulls out a small lighter, and holds it by the gas.\n\n\n\"For fuck's sake, don't! Please, I'm a sinner! I have sinned, and I...\"\n\n\nFather Borgogni lights the gas, and it bursts into flames as you feel the flames lap at your stomach and knees. You scream in pain, as the bars begin to glow red and seer into your flesh.\n\n\n\"STOP! STOP! STOP IT!\" you scream.\n\n\nYou desperately writhe around in the flames as Father Borgogni stares at you.\n\n\n\"Help me! Please! AAH! AAH!\"\n\n\nYou scream in desperation, before Father Borgogni turns off the gas. You continue to scream as the fire stops and the bars begin to cool, before it grows down to a whimper. \n\n\n\"Have you found redemption among the fire? Are you pure of heart and as innocent as the lamb?\"", "action_results": [{"action": "\"Yes!\"", "result": "\"I hope so, though I doubt it. The son and the beast are here, but not the father. We can prevent this.\"\n\n\nYou scream as you see the priest pour a bottle of lighter fluid on him.\n\n\n\"God, father, forgive us both for our sins,\" he says.\n\n\nFather Borgogni falls forward, collapsing onto the burning cage as he bursts alight. You scream as the flames wrap around you, stuck in the cage as the heat chars your flesh and melts your bones.", "action_results": [{"action": "Burn", "result": "Rivera\n\n\nYou're left surrounded by chaos as your group disbands. You raise your rifle and fire into the masses of demonic undead, before desperately backpedaling to escape their clawing hands. You back away as you hear a new round of horrified screams over your coms.\n\n\n\"Stay away from me! God our father, grant your blessings upon me. I am a sinner, but I beg you protect me from the darkness and flames and allow me safe passage...\" you mutter quickly.\n\n\nThe demonic undead continue sprinting towards you, but thankfully your bullets manage to at least force them back through sheer force if failing to hurt the demons.\n\n\nClick\n\n\n\"Shit!\" you cry, turning and breaking away.\n\n\nYou find an oak door and stumble through it as you hear growling right behind it. You slam the door shut, before hearing the thump of creatures charging into the door. As the door shuts, you're left in complete and utter darkness. You quickly switch on your flashlight, and freeze. A tall, fur covered humanoid creature stands in front of you, gazing at you with a single black eye and a mouth filled with jagged teeth. It's fur is wet, covered with thick red blood. It sniffs the air, and looks around the room, continuing to sniff the air.", "action_results": [{"action": "Open fire", "result": "You raise your gun, pointing it at the demon's head, and pull the trigger.\n\n\nClick\n\n\nYou remember your gun is out of ammo, and the demon fixes its gaze on you. Then, it charges forward. It slams a hoofed foot into your chest, breaking several ribs and slamming you into the door. You cough up blood, and it kicks once more, crushing your skull.", "action_results": [{"action": "Darkness...", "result": "Mendez\n\n\nAs soon as you go for the door, you're faced with a horrible abomination. A large, humanoid creature stands at seven feet with skin as white as bone. It's face is a horrible scarred mess, with a smile that goes from ear to ear as it breaths heavily. It raises a long, thin claw, and reaches out to touch you.\n\n\n\"Get the fuck away from me!\" you cry.\n\n\nThen, the beast attacks. It leaps forward, grabbing you, and with the second hand grabs the banister to the stairwell. It flings itself up to the upper floor as you draw your handgun. You unload a full clip into its head, but the bullets bounce off against the creature as you stare at it in horror.\n\n\n\"What the fuck are you?\" you say, aghast, as you're dragged into a room lit only by a single candle.\n\n\nYou're flung into the center of the room, before the demon starts chuckling like a baboon. You back away, before hearing a small, faint whisper that you can barely make out, seemingly coming from all around you.\n\n\n\"Yes... this one will do...\"\n\n\n\"Stay away from me!\" you shout, backing away.\n\n\nYou look around the room, seeing two possible hiding places, and the door. You could hide in a small fireplace or behind a massive wooden bookcase, or you could charge the door and try get out.", "action_results": [{"action": "Hide in the Fireplace", "result": "You quickly break into a crawl, climbing into the fireplace. You hear the demon's laughter, before a chair is flung at you, breaking as it hits you and you yell in pain. You feel another chair slam into you, before a heavy plastic fuel cannister smacks into you. It breaks open, spraying you with fuel which begins to puddle around you and soak into your clothes. You spit to get the droplets that went into your mouth out, before watching as the demon approaches you. It scrapes its claws along the bricks of the fireplace and begins to laugh.", "action_results": [{"action": "Light the gas", "result": "You fumble through your pockets and pull out your lighter, immediately lighting the fuel. It bursts into flames, and you let out a scream as the heat rips around you. Your flesh begins to sear and cook as you scream in pain, before being consumed by the fire.", "action_results": [{"action": "Death", "result": "Porras\n\n\nYou whimper in the darkness as you try to crawl backwards, your broken legs painfully scraping along the floor. You hear the moaning, breathing and muttering increase. Your hands reach backwards to pull yourself away in the massive basement, but they land on your gun. You quickly grab it and pull it forward, flicking the flashlight on. Immediately, you illuminate mangled, horrific corpses crawling towards you. The monsters have broken, bent and snapped limbs, and are horrifically disfigured by flames or through skinning. They moan, and you let out a yelp, firing your gun at them. The bullets whizz through the air, thudding into the creatures, but they continue to advance. Suddenly, you hear something moving behind you.", "action_results": [{"action": "Turn", "result": "You turn, to see a figure emerging from the darkness.\n\n\n\"Stay back! Stay the fuck away from me!\" you scream.\n\n\nThe figure stops, raising its hands.\n\n\n\"Porros! It's me!\" the figure, Rivera, cries.\n\n\n\"Rivera! Oh, thank fuck. There's monsters everywhere! We need to move! Give me a hand. I think my legs are broken.\"\n\n\nRivera jogs over, grabbing you.\n\n\n\"Ready?\" he asks.\n\n\n\"Go!\" you say, gritting your teeth.\n\n\nRivera lifts you into the air, throwing you over his shoulder as your legs bang against him.\n\n\n\"AH!\" you scream.\n\n\nYour scream is echoed by the howls of the monsters dragging themselves towards you.\n\n\n\"Go! Go!\" you yell.\n\n\nRivera grunts, and begins carrying you along the darkness as you struggle to keep a steady beam ahead of you, illuminating the darkness. You see the creatures crawling towards you, but they're slow, and the adrenaline pumping through Rivera's veins are enough to give him the strength to carry you and the speed to easily pass them out. Then, you light illuminates chains.\n\n\n\"Wait! There's chains!\" you say, before groaning as your legs bump against each other as he stops.\n\n\nYou run your flashlight along the wall, and whimper as Rivera tenses up, and immediately begins whispering a prayer. Kneeling on the ground is a priest, who prays silently. Chained to the wall in front of him is a horrifying creature standing on all fours. It's the size of a truck, barely fitting in the basement. It's body is covered in a black fur, slick with red blood and bits of guts and organs. Its legs turn from mammalian to reptilian, ending in massive, sharp bone claws. At the creature's shoulders, the neck splits into nine necks, each ending with the head, similar to a lion's, but thinner, and with more teeth that barely manage to fit in its mouth. Its yellow, reptilian eyes flicker from the priest, and stare at you. It hisses, long, snake-like tongues flickering from their mouths. It tries to move towards you, but the chains that bind its limbs, body and heads keep it in place.", "action_results": [{"action": "Fire your pistol", "result": "You draw your pistol, and fire at the beast. You fire several rounds before your gun clicks empty, but all the bullets blow holes into the beast, which are quickly healed within seconds. Despite this, the beast still lets out a furious, rage-filled roar as it begins to pull at its chains.\n\n\n\"You won't hurt it,\" the priest says, not opening his eyes.\n\n\n\"Fuck you!\" you yell. \"Rivera, how many bullets do you have?\"\n\n\nRivera fails to respond, and continues to pray.\n\n\n\"The Beast will not be harmed by bullets, children. I have tried. I have tried all my life to stop what is to come. I have put it off. But I am failing. There were many citizens lured here by the faint whispering of the adversary. They were in his grasp before I could save them. I tried with my brothers to purify them, to cleanse them of sin, but I could not. When I finally sent them into his arms to stop the adversary from taking them, the adversary still managed to take control of the bodies. You both need to flee. Get out of here, now, before he takes hold of you. Do not come back.\"\n\n\n\"What the fuck are you talking about?\" you shout.\n\n\n\"We need to go!\" Rivera says, turning and running as the priest begins to pray aloud behind you.", "action_results": [{"action": "Escape", "result": "Rivera\n\n\nAs Porras fires his gun at the roaring beast, you sprint as fast as you can through the darkness, away from the beast and Father Benedict. You find a door, and with the arm not wrapped around Porras, pull it open. You see a small, wooden staircase and quickly head up. You find yourself in a small lounge area. Two torn apart SWAT corpses lie on the ground.\n\n\n\"Blessed God, please have mercy on the souls of Gallo and Garcia,\" you mutter under your breath as you look at the.\n\n\nYou see the door to outside has been busted open in Gallo and Garcia's entry, and spot sunlight coming in.\n\n\n\"Thank you, God...\" you mutter.\n\n\nYour hear a horrible roar from downstairs, before the floor is torn apart. The nine heads of the Beast bursts through the floor, and the clawed legs boost the horrible beast up. Immediately, two heads dart towards you, and snap Porras out of your grip and fling him onto the floor. They begin biting into Porras as they begin to tear him apart.\n\n\n\"Ah! Help! Fuck! Get them off me!\" Porras screams in horror.", "action_results": [{"action": "Help Porras", "result": "You charge over, firing your gun at the neck of one of the mouths tearing into Porras. A mouth grabs the back of your leg, flipping you through the air. Another mouth goes straight for your stomach You feel sharp teeth bite down and tear into your armor before flinging your around as the teeth shred your armor. After a few seconds, your stomach is in bit. It drops you to the ground, and you look up at three heads, all six yellow eyes staring into your soul. You scream as they fly forward to tear you apart, and your screams mix with Porras' screams to create a cacophony of horror.", "action_results": [{"action": "Hell Is Nothing But Darkness", "result": "As the sun set, the old wooden mansion lay still. The entire SWAT team had been massacred upon entry, awakening dark spirits and terrifying demons that would spill out to the earth. That day, several priests did something, or failed to prevent something, that led to such a massacre.", "action_results": []}]}, {"action": "Leave Porras", "result": "You turn, and run towards the door. As you hear the beast roar behind you, you sprint out the door, hearing Porras screams behind you. Within seconds, you hear the crunch of bones and silence.", "action_results": [{"action": "Run", "result": "You burst outside, and quickly spot the truck. You begin sprinting towards it, and open the side door. You find the keys, and quickly start the engine, before driving away from this place as quickly as you can. You watch in the rear mirror as the sun sets over the mansion. You know everyone else is dead. You can feel it. You wince as you feel your horrific burns, wishing you could've done something. No, you think. There was nothing you could've done. At least you've survived. Your entire team is dead, but you made it. You continue driving down the road.", "action_results": []}]}]}]}, {"action": "Talk to the priest", "result": "\"What the fuck is that? Who are you?\" you ask the priest.\n\n\n\"I am Father Benedict. I am part of an order that have been delaying the apocalypse for years. I have tried all my life to stop what is to come. I have put it off. But I am failing. There were many citizens lured here by the faint whispering of the adversary. They were in his grasp before I could save them. I tried with my brothers to purify them, to cleanse them of sin, but I could not. When I finally sent them into his arms to stop the adversary from taking them, the adversary still managed to take control of the bodies. You both need to flee. Get out of here, now, before he takes hold of you. Do not come back.\"\n\n\n\"What the fuck are you talking about?\" you shout.\n\n\n\"We need to go!\" Rivera says, turning and running as the priest begins to pray aloud behind you.\n\n\n\"No! I have to kill that thing!\" you roar.\n\n\n\"We need to go!\" Rivera yells.", "action_results": [{"action": "Fire at the beast", "result": "You draw your pistol, and fire at the beast as the priest sighs and Rivera begins running away, carrying you. You fire several rounds before your gun clicks empty, but all the bullets blow holes into the beast, which are quickly healed within seconds. Despite this, the beast still lets out a furious, rage-filled roar as it begins to pull at its chains. Still, soon you're back into the darkness with Rivera.", "action_results": [null]}, {"action": "Tell Rivera to run", "result": "\"Rivera! Go! Run!\"\n\n\nRivera turns and begins to run away from the beast, stumbling through the darkness as the priest begins to pray aloud.", "action_results": [{"action": "Escape", "result": "Rivera\n\n\nAs Porras yells to run, you sprint as fast as you can through the darkness, away from the beast and Father Benedict. You find a door, and with the arm not wrapped around Porras, pull it open. You see a small, wooden staircase and quickly head up. You find yourself in a small lounge area. Two torn apart SWAT corpses lie on the ground.\n\n\n\"Blessed God, please have mercy on the souls of Gallo and Garcia,\" you mutter under your breath as you look at the.\n\n\nYou see the door to outside has been busted open in Gallo and Garcia's entry, and spot sunlight coming in.\n\n\n\"Thank you, God...\" you mutter.\n\n\nYou hear the growls of the undead at the second door to the room that begins to shudder. You quickly rush outside, heading to freedom.", "action_results": [{"action": "Run outside to freedom", "result": "Porras\n\n\nRivera carries you outside, and heads straight towards the van. He runs to the back, and gently helps you in. You watch as he quickly runs to the the drivers seat, finding the keys and starting the van. He slams your foot on the accelerator and you quickly begin speeding away from the mansion.\n\n\n\"We did it... we made it...\" Rivera pants.\n\n\n\"We did...\" you reply. \"Let's get the fuck out of here.\"\n\n\nYou nod, and continue driving. You've escaped with Rivera. As you speed away from the mansion, you know you're lucky to be alive.", "action_results": []}]}]}]}, null]}]}]}, {"action": "Climb up the chimney", "result": "You begin to push yourself up the bricks of the chimney and climb along up, before the abomination's hand wraps around your ankle. It drags you down the chimney, scraping your arms, before dragging you into the darkness.\n\n\n\"Now...\" the voice whispers from everywhere. \"Now I am reborn.\"", "action_results": [null]}, {"action": "Attack", "result": "You charge out of the fireplace, towards the abomination, but the abomination is faster. It leaps forward, slashing its claws across the side of you face. You scream as blood flows out and you collapse on the floor. It lets out a howling laughter, before grabbing your ankle and dragging you off into the darkness.\n\n\n\"Now...\" the voice whispers from everywhere. \"Now I am reborn.\"", "action_results": [null]}]}, {"action": "Hide behind the bookcase", "result": "You crawl behind the bookcase, but the abomination attacks. It leaps forward, slashing its claws across the side of you face. You scream as blood flows out and you collapse on the floor behind the bookcase. It lets out a howling laughter, before grabbing your ankle and dragging you off into the darkness.\n\n\n\"Now...\" the voice whispers from everywhere. \"Now I am reborn.\"", "action_results": [null]}, {"action": "Make a run for the door", "result": "You charge towards the door, but the abomination attacks. It leaps forward, slashing its claws across the side of you face. You scream as blood flows out and you collapse on the floor. It lets out a howling laughter, before grabbing your ankle and dragging you off into the darkness.\n\n\n\"Now...\" the voice whispers from everywhere. \"Now I am reborn.\"", "action_results": [null]}]}]}, {"action": "Hide", "result": "You freeze, staring at the demon, and begin backing away. You roll behind a bookshelf, as you hear the sniffing continuing. You stop as you release the creature hasn't appeared to see you. It must be blind, or its vision incredibly impaired for it not to see you. You hear the sniffing demon nearing you, and take a deep breath as its face nears you, reciting prayers in your head. Then, its head rolls around, its thick, fur covered face staring at you with its terrifying eye. ", "action_results": [{"action": "Run past the demon", "result": "You charge past the demon, but it head butts you, knocking you back. It slams a hoofed foot into your chest, breaking several ribs and slamming you into the door. You cough up blood, and it kicks once more, crushing your skull.", "action_results": [null]}, {"action": "Drive your thumbs into its eye", "result": "You grab the demon's head, and begin pushing your thumbs into its eye. It roars, but you continue to drive your gloved thumbs forward, popping the eye open like a boil and releasing horrible, black pus running all along your hands. The demon falls backwards, lying limp on the floor. You hear the thuds of undead on the door, and stumble around in the darkness. You find another wooden door, and push it open, finding a staircase descending into a lower floor, the basement.", "action_results": [{"action": "Descend into darkness", "result": "You walk into the darkness, before you see a small glimpse of a terrifying face. The pale face of a preteen boy appears briefly from the darkness. Its mouth and eyes are stitched shut, and its ears have been lopped off. It, or he, or whatever the fuck this is be it demon or victim, stares at you, it's shut eyes peering into your soul, before turning and disappearing into the dark. You flick on your flashlight, although you catch no glimpse of the child. You hear the demonic undead up the stairs break into the room you were in, and you realize you have no other choice than to explore the darkness to try find a way out.", "action_results": [null]}]}, {"action": "Pull the bookcase on top of it", "result": "You jump backwards, grabbing the top of the bookshelf and pulling it down on top of the demon. You jump on top of the bookshelf, increasing the pressure and crushing the demon. You hear the thuds of undead on the door, and stumble around in the darkness. You find another wooden door, and push it open, finding a staircase descending into a lower floor, the basement.", "action_results": [null]}]}, {"action": "Attack the demon with the butt of your rifle", "result": "You charge the demon, slamming the butt of your rifle into the side of its head. It roars. Then, it charges forward. It slams a hoofed foot into your chest, breaking several ribs and slamming you into the door. You cough up blood, and it kicks once more, crushing your skull.", "action_results": [null]}]}]}, {"action": "\"No!\"", "result": "\"We will never be pure without the lord. I hope so, though I doubt it. The son and the beast are here, but not the father.\"\n\n\nFather Borgogni turns off the gas, before unlocking the cage. You desperately crawl out of the cage, before collapsing on the ground, gasping.\n\n\n\"You can prevent everything that has happened to this house from happening to the outside world. Perhaps, through recognizing your sin, you can stop this. Get out of here. Once you're out, I need you to kill everything that tries to leave.\"\n\n\n\"Sure fucking thing!\" you agree frantically.\n\n\n\"Just do it!\"\n\n\nYou watch in horror as the priest lights the gas fire again and pours a bottle of lighter fluid on himself.\n\n\n\"God, father, forgive me both for my sins,\" he says.\n\n\nFather Borgogni falls forward, collapsing onto the burning cage as he bursts alight. You back away desperately from the fire, before desperately looking around. The pain is incredibly, and you struggle to move, although the adrenaline that's begun coursing through your veins is helping. The undead are attempting to make it through the door, but you spot your rifle and you know that you might be able to fight your way through them. You could also smash open the window and climb through, although that runs the risk of slicing open your weak body on broken glass.", "action_results": [{"action": "Fight through the undead", "result": "You limp over to your rifle, grabbing it and checking the clip before flicking the safety off. You slowly walk over, seeing an undead hand grasping at you. You slowly open the door, before backing away as you scream and open fire. You unload a full clip into the undead as they slowly stare at you, exploding heads and tearing off limbs.\n\n\nClick\n\n\nYour gun goes out of ammo, and every single one of the undead are left standing. They growl, and you continue to back up. Then, they charge. They sprint forward, and the first grabs the side of your face with a rotting hand. It begins to tear your face as another goes for your throat, ripping out the side of your face as you scream in desperation as the undead tear you apart.", "action_results": [null]}, {"action": "Go out the window", "result": "You crawl towards the window, and smash it open with the butt of your gun. You hear the growling increase, and smash the glass out of the way and pull yourself out, scraping your burned, charred flesh along and causing yourself to scream as you collapse onto the ground outside. Thankfully, it's a first story window, so you collapse on the pavement outside, screaming. You stand slowly, and begin panting as you stumble towards the SWAT van. You grab the side of it, and look inside. You see the keys are there, just like you left them, as well as a three spare rifles in the back. You look back at the building, knowing the rest of your squad are in there, but going back is suicide. You could very easily take the van and get help to storm the building and rescue your friends.", "action_results": [{"action": "Grab a rifle and go back inside", "result": "You grab a rifle and some spare body armor, slowly strapping it on, and take a deep breath. Time to rescue your friends.", "action_results": [null]}, {"action": "Take the van and find help", "result": "You sit in the van, and quickly start the engine. You quickly pull away from the mansion, and begin driving quickly away from mansion.", "action_results": [null]}]}]}]}]}]}]}, {"action": "Abandon Captain Mendez and attempt to escape through one of the side rooms", "result": "You turn, and head into one of the side rooms, followed quickly by Blanco.\n\n\n\"Keep going, keep going!\" Blanco screams, as you spot a small staircase heading downstairs to the basement.\n\n\nSuddenly, a door bursts open, and a man with a priest collar bursts out. He holds a sack, and quickly pops it around Blanco's head, tightening it.\n\n\n\"Ah!\" Blanco yells, as you raise your gun.\n\n\nThe priest throws the now blind Blanco into a side room, before grabbing your gun barrel and pushing it aside. He quickly jabs you in the face and you fall backwards. You hit the stairs, bouncing along as you painfully rumble down the stairwell, knocking your head and arms on the hard stairs as you scream. ", "action_results": [{"action": "Tumble", "result": "You bounce along the stares with a terrified scream before landing painfully on the cold concrete floor. You feel your legs snap as you let out a terrified scream, crumpling to the floor as you look around, seeing nothing but darkness. You hear the horrible noises upstairs go silent, and are left alone in the darkness.\n\n\n\"Hello? Hello?\" you call.\n\n\nYou hear sniffling, wheezing and gasping around you in the darkness as the other residents of this basement hear you. Deep breathing slowly gets louder as they begin heading towards you. You begin to crawl desperately backwards, your broken legs painfully scraping along the floor as you bite your lip until it begins to bleed profusely as you try to prevent yourself from whimpering and alerting the creatures as you're left alone in the dark.", "action_results": [null]}]}]}, {"action": "Run", "result": "You turn and run, following Blanco. You run from the creature, into a side room of the house.\n\n\n\"Keep going, keep going!\" Blanco screams, as you spot a small staircase heading downstairs to the basement.\n\n\nSuddenly, a door bursts open, and a man with a priest collar bursts out. He holds a sack, and quickly pops it around Blanco's head, tightening it.\n\n\n\"Ah!\" Blanco yells, as you raise your gun.\n\n\nThe priest throws the now blind Blanco into a side room, before grabbing your gun barrel and pushing it aside. He quickly jabs you in the face and you fall backwards. You hit the stairs, bouncing along as you painfully rumble down the stairwell, knocking your head and arms on the hard stairs as you scream. ", "action_results": [null]}]}, {"action": "Open fire", "result": "You raise your gun and open fire on the monsters. They shudder under the hail of your bullets, but they don't drop. They continue standing, as your and your comrades unleash all you have.\n\n\nClick\n\n\nYou're out of ammo, and the monsters are all still standing. They're covered with bullet holes, staring at you with those terrifying dead eyes.\n\n\n\"Get away from me!\" Captain Mendez screams, and you turn.\n\n\nYou see a completely white, humanoid creature that hangs on the door frame, stretching a long hand to touch Captain Mendez. The creature has completely black eyes, and its hands and feet have long, sharpened bone claws. Suddenly, the creature bursts forward, grabbing Captain Mendez with immense strength, flinging him over its shoulder and climbing along the stairwell to the upper floors. Captain Mendez screams as he fires his gun repeatedly in the creature's head to no avail. You stare as he's dragged away, and see that the only way to get to him is through the monstrous dead.", "action_results": [null, null]}, null]}]}]}]}]}