{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=38276", "context": "", "first_story_block": "", "action_results": [{"action": "Start", "result": "In this game, you play as Nicole;  a short, petite structured, 19 year old girl; who is a quiet/shy sort of person. She is smart, pretty, loyal, and well loved by all of her friends. She is also the backbone that holds the friendship between the group together, as everyone within the group has varying personalities that sometimes tend to clash. She brought them all together with her accepting and overall friendly personality. The group became even closer after Nicole lost her boyfriend, Cody, the year before this story takes place. They have all tried and failed to bring Nicole out of the depression brought on by his death. During gameplay, Nicole makes different choices that lead to many endings for the story. This story is depicted almost entirely from Nicole's perspective, with a few glances at some of the events that happen to her friends throughout the story. I also added an optional page that you can read to learn about each of your friends, if you want to know who each of them are. You can meet them by clicking the link on the next page, but as I said this is completely up to you.\n\n\nThis story has MANY possible endings. There are some endings that can end the story before it ever really begins, some random death endings but not often and not every page, there are good endings where you escape, and there are bad endings where you are killed. There is only one \"best\" ending, but it is very hard to find and not one many people would choose. This ending is just my own little twist on the story that I think will make it unique and memorable. Tip: there are a couple \"true\" endings that have an epilogue, but you will know you got the best ending if the final scene shows where your character is \"one year later...\" Even after you finish playing and rate the game, feel free to come back and explore the many different endings. Also, if your game ends soon after you begin, please restart and try to get further into the game before you rate it. Thanks! I hope you enjoy playing my game. :P", "action_results": [{"action": "Begin", "result": "Your friends are gathered at your house one day, about a week after graduation, just hanging out. Everyone begins discussing their various plans for the immediate future. Davis plans to try his luck in the big city, hoping to become an actor or male model. Although he tends to be negative and can even come across as harsh at times, you don't doubt that he could in fact become famous as he is rather good looking. Your best friend, Sarah, who is dating Davis, plans to attend community college in the next town. She wants to stay close to home and has no other aspirations in life than to begin her own family in the town she grew up in. She recently confided in you that she believes she is pregnant, but that she doesn't know yet for sure.\n\n\nYou share with everyone your own plan to also attend the community college, but that you are planning to take night courses instead, so that you can keep your current job at the local grocery store. Although several of your friends try to persuade you otherwise, you remain firm with your decision. You don't feel like sharing with everyone in the room the real reason for your decision, not wanting to sour everyone's good mood. The real reason you are staying so close to home, rather than attending the state college you had originally planned to attend, is due to your father's recent diagnosis of cancer. Although the cancer is still in its beginning stages, your father is the only family you have; you do not want to leave him living alone as he undergoes treatment for the cancer.\n\n\nAs Michelle launches into another spiel as to why you should try to get into a Bachelor's degree program rather than attend night classes, Steven tries to get her to leave it be. Michelle is the smartest among your friends and tends to be bossy. She is planning on attending one of your state's most accredited schools. Her boyfriend, Steven, is exactly the opposite. While he isn't very bright, he is very laid back and tries to be the peace maker whenever Michelle becomes too aggressive or bossy.\n\n\nMark suddenly sits up from where he is reclining on your sofa, and asks the group at large, \"Why don't we have one last adventure together before we all go our separate ways?\" You glance up from your conversation with Michelle, mostly to see if Mark is being serious or not. Mark is the stoner of the group and known for blurting out random comments, just to get a reaction.\n\n\n\"Because you're not, technically, a part of our group.... You're only even here because you're boning Heidi. You aren't even our age, loser...\" Davis bluntly points out, in typical Davis fashion. Mark is Heidi's boyfriend and much older than everyone else, having graduated two years before. Davis is oblivious of anyone else's feelings except his own and tends to be an ass, in your opinion.\n\n\n\"And because some of us have packing to do and real jobs waiting for us,\" Michelle tacks on, in a superior tone of voice she sometimes uses that you can't stand.", "action_results": [{"action": "Continue the Story", "result": "\"I'm being serious this time, swear. We can go camping or something. It will be fun. Do you really just want to leave and go to college and not have one last fun time together with your friends? Think about it, please. Let's do something. Just for a week. What do you all think?\"\n\n\n\"Sounds like the best thing you have ever suggested, Mark,\" Sarah blurts out. \"I was going to suggest something like that myself...\"\n\n\n\"Sounds awesome to me,\" Amanda tacks on. Amanda is the youngest of your friends, and her response surprises you. She and Robbie had just broken up a few days before, and she had seemed to be depressed in the days since. Maybe she wanted to go as a final chance to get back with Robbie. Who knows?\n\n\nHeidi, Mark's girlfriend, agrees that the trip sounds fun. She and Mark have been dating several months, and Mark has begun hanging out with your group of friends more and more ever since.\n\n\nAfter much debate, everyone finally decides to go on the trip. \"Alright, Smartie Pants, where exactly are we going?\" Michelle questions. \"It was your idea, so what do you propose?\" she continues in a snide little voice, obviously upset everyone is agreeing with Mark's plan.\n\n\n\"I have the perfect idea. We can go camping for a week at my dad's old hunting cabin. We used to stay there every summer before my parents got divorced. It will perfect. And it has three bedrooms, so there will be plenty of space for everyone. It's only about a three hour drive from here.\"\n\n\nWith the destination decided on, everyone makes plans to meet back at your house the next morning. Everyone slowly leaves, until only Sarah remains. Sarah thanks you for agreeing to go on the trip. She tells you that she is indeed pregnant and that she plans to share the news with Davis during the trip. You congratulate her, knowing that this is what she's always wanted, although you don't agree with starting a family so soon. You also fear that Davis' reaction won't be the one Sarah is hoping for.\n\n\nWhen you are finally left alone in your house, you realize you have a decision to make. When should you pack for the trip?", "action_results": [{"action": "Pack Now", "result": "Wanting to hurry up and get the packing out of the way, you hurry upstairs to your room. You pack all of the essentials and even grab your toothbrush from the bathroom. Then, you zip your overnight bag and place it at the foot of your bed. That done, you go back downstairs and begin fixing a meal for you and your dad. Knowing you will be gone for a week, you even fix extras and put them in the fridge, after sealing them in Tupperware containers. You eat your dinner at the table and try to think of anything else that needs to done before you leave. You go ahead and clean the kitchen. You even fix your dad a plate of food and put it in the microwave, knowing he will find it when he gets off work in a few hours.\n\n\nThat done, you look around to make sure everything looks good. You realize you forgot to let your dad know where you are going, and scrawl him a quick note that you attach to the refrigerator door with a magnet. Confident that you are as ready as you possibly can be, you head upstairs again and dress for bed. You set your alarm and find an old horror flick on the television to watch. You watch the movie as your eyelids begin to droop. The last thing you remember is the woman in the film screaming as she is brutally stabbed to death in a hotel bathroom.", "action_results": [{"action": "The Next Morning", "result": "You wake up to your alarm clock''s insistent beeping. You reach over to shut it off and sit up in the bed, wiping sleep from your eyes. You feel like you haven't slept at all, like you only seconds before had fallen asleep. Hoping it will refreshen you, you decide to take a quick shower, while you wait for your friends to arrive. The shower does help some. You enter your bedroom after your shower and quickly towel off. You slip on your undies, a pair of blue jean shorts, and a cute black tank top, with a pink bunny figure being sarcastic on the front. You then slip into your sneakers, grab your bag, and head downstairs.\n\n\nEntering the kitchen, you set your bag down and grab a cereal bar out of the cabinet. As you are finishing your quick breakfast, the doorbell rings. Standing on the doorstep when you open the door is Sarah, grinning broadly.\n\n\n\"You all set?\" Sarah asks. \"I'm about to explode; I'm sooo excited! You better be ready, Nicole, or I'm gonna strangle you,\" she giggles.\n\n\n\"Yes, I'm ready. Just let me grab my bag and lock up,\" you reply, feeling your own excitement beginning to build.\n\n\nYou hurry back inside, grab your bag out of the kitchen, grab your cell phone and keys from the foyer bar, and pull the door shut, locking it as you go. Everyone except Davis is standing between your truck and Mark's beat up van. A couple of your friends are loading their luggage into the back of your truck. You realize that apparently you are going be driving. Davis is impatiently leaning against his motorcycle, having a smoke and scowling at everyone, with his foot tapping a mile a minute. Finally, everyone has their luggage packed and quickly divide up between the vehicles.", "action_results": [{"action": "Start Trip", "result": "And so, your adventure begins. Mark leads the way in his van. Riding with him are Heidi, Michelle, Steven, and Robbie. You follow in your extended cab pickup. Riding with you are Amanda and Ben, who are in the back seat, and JR, who is sitting beside you in the passenger seat. You smile shyly at him, as you pull out of the driveway. Following your truck are Davis and Sarah on the motorcycle.\n\n\nThe hours pass slowly as you travel, only stopping once for gas. The three hour drive feels more like six, as you finally near your destination. Entering the small town of Moody, it seems abandoned at first sight. Shops that face the main street that you are driving down, all look abandoned and neglected almost completely deserted. Some even display hardwritten signs hung on the doors, exclaiming the businesses within are out of business. It has the feel of a ghost town, and the whole scene is starting to give you the creeps. You follow closely as Mark enters the parking lot for a gas station, and slowly pulls to a stop at the curb in front.\n\n\nMark climbs out of his van and hurries over to your vehicle. He leans into your window and says he is going inside to ask for directions. The camp site is apparently on the outskirts of town, and he doesn't recall exactly how to get there. The town of Moody has nine camp grounds to the north of town. Your destination is Site 59. You decide to follow Mark inside, and as you leave your vehicle, you ask JR to let Sarah and Davis know why you have stopped. You and Mark, meanwhile, head inside.", "action_results": [{"action": "The Gas Station", "result": "You enter the gas station behind Mark and follow him to the counter. Seeing no one anywhere in sight, Mark impatiently hits the bell on the counter to summon the attendant. He taps it several times in succession, as you finally hear footsteps approaching from the doorway at the back of the shop.\n\n\n\"I'm a'coming. Hold your gosh darn horses. I swear if this is another fricking prank, I'ma kick your rearend, Pete.\" The weathered old man finally steps into view and approaches his side of the counter. \"Ah hell. My 'pologees folks. A youngen from town has been playing pranks on me all darn week. Can I help you's with anything?\" The man is wearing blue coveralls covered with grease stains, and his hair stands up at all angles, like it hasn't seen a comb in ages. He has filmy, grayish eyes, a scraggly beard, and a pointed, sharp nose; but also a kind, shy smile. His hands shake a little, as he reaches for a rag and begins wiping the counter.\n\n\n\"Yes, we need directions to Site 59 please,\" Mark responds. At these words, the old man's eyes get big and his hands begin to tremble even harder than before. He swallows hard before answering, his eyes darting around nervously.\n\n\n\"Ya mean you aren't just passing through? Ya'll don't wanna stay in these here parts. You should try Miner's Hill instead. It's about an hour south of here...\"\n\n\n\"I asked how to get to Site 59. We've already been driving for three hours. We are planning on staying at my dad's old cabin. He used to camp and hunt up here, before my parents divorced. I just don't remember how to get up there. Can you help us or not?\" Mark asks impatiently.\n\n\n\"But you don't understand, \" the old man insists. \"The town here isn't safe. Not like it was when you visited last. Young people are disappearing left, right, and sideways. Just this year, eight youngens were taken. Most were about your age, I suppose. This town is cursed. People have moved off, afraid for their youngens. Please camp somewhere else. For your own safety.\" The old man's eyes fill with tears. \"My grandson, Mikey. He's been missing a year and a half now...\"\n\n\nYou and Mark exchange an uneasy glance. Finally, Mark explains to the man that you have a large group of friends with you. He tells the man he will warn everyone about the danger, and then everyone can decide as a group whether to stay or not. The old man urges you to leave the town once again as you are leaving, but Mark doesn't seem to be paying him any mind.\n\n\nFinally, Mark cuts the man off. \"Sir, if you would, could you possibly draw me a map? I know we can't stay right now, but one day I need to come visit my dad's cabin. I need to clean it up, so that it can be sold. My mom could really use the money.\"\n\n\nMark sounds so sincere, you almost believe him. But you know he is lying, just to get the directions. It makes you uncomfortable. On your way out of the store, Mark asks you not to tell anyone about the strange encounter just yet. He wants to at least look at the cabin before you tell everyone else about the old man's warning. Then everyone can decide what they want to do.", "action_results": [{"action": "Warn Everyone Now", "result": "You decide not to do as Mark instructed. Everyone needs to know the danger that could possibly lie ahead. After all, you are all fairly young and someone was obviously killing off teenagers in the area. If the old man is to believed, that is. Even though you sense he was being honest, he could also be mistaken. You tell everyone what just occurred inside. Mark and Sarah argue that he is just a paranoid old man trying to scare teenagers away. Probably doesn't want drugs, sex, or booze mucking up his precious town, they argue. Finally, you make a choice as no one else can seem to decide.", "action_results": [{"action": "Camp Elsewhere", "result": "No one wants to give up on the trip, so you finally manage to talk everyone into camping at a safer site.  You have a rather uneventful trip, aside from almost everyone getting a rash from exposure to poison ivy. Returning home itchy as hell, you look up the town of Moody on the web. A police investigation is ongoing, reads the top story, as investigators continue the search for 16 young adults who remain missing from the area...\n\n\nHoly hell! That could have turned out very bad, if you had decided to stay. Guess you lucked out!\n\n\nThe end.... or is it??", "action_results": [{"action": "Next", "result": "Your score was: -5!!!", "action_results": [{"action": "END GAME", "result": "Congratulations! You got one of the few good endings!\n\n\nFeel free to play again, anytime! There are 16 total endings. Try to find them all!\n\n\nThanks for playing! Scare ya later! XD", "action_results": [{"action": "Reset Game", "result": "", "action_results": [null]}]}]}]}, {"action": "Head Home", "result": "Disappointed with the trip, and wanting to forget Mark's plan entirely, you decide to head back home. You don't get very far, however, when your truck suddenly begins to overheat. Signaling to the other vehicles, you pull to the side of the road to try to figure out a solution to this new problem. You pop the hood and climb out of your truck to check the engine. You immediately discover the problem. Your truck is bone-dry. The oil is low, and the radiator is empty. Damn! With your Dad being sick and unable to upkeep your truck as he usually had before the cancer, it now seriously needs attention. You hadn't planned on driving it this far in the first place...", "action_results": [{"action": "Next", "result": "You let everyone know the problem as they all gather around. After much debate, half of the group decide to head into town to get water and oil to bring back. Sarah and Davis follow on the motorcycle as everyone in the van heads to town. JR, Amanda, and Ben stay behind with you, to wait for the others to return. You roll down all the windows in your truck and sit behind the wheel, bored as hell and mad you didn't check your fliuds before starting the trip. You apologize to the friends who are stuck waiting with you. Ben complains of the heat, and Amanda announces her anger that you've landed them in this predicament, but JR accepts your apology.\n\n\n\"It's alright, Nicole. You didn't even know you would be driving on this trip originally, so how could you have know to check the fliuds anyway?\" he reasons. You smile appreciatively at him. He grabs your hand, and you look down at your joined hands uncomfortably before looking away.", "action_results": [{"action": "Next", "result": "The heat starts to become almost unbearable, as the time crawls by at almost a snail's pace. At least Amanda has finally stopped complaining, and she is now too busy trying to swallow Ben's tongue to say anything else. She and Ben have been busy making out for the last fifteen minutes or so. Your palm has begun to sweat, held tightly in JR's grip. He has tried to kiss you a couple of times, but you continue pushing him away. You are unsure if you are ready for that yet. It is hard to even think about kissing someone with your feelings still lingering for your lost love.\n\n\nJR finally drops your hand and climbs out of the truck. You do the same. You notice JR walk around the vehicle and lower your tailgate. He sits down. You walk back and sit beside him. You sit in silence for a few minutes until JR finally speaks up.\n\n\n\"I really don't get you, Nicole. I know you like me, but you seem uncomfortable just holding my hand and won't let me kiss you at all. What's the deal?\"\n\n\n\"I'm sorry,\" you say, trying to sort out your feelings. \"I do like you, JR. A lot. It's just hard to let go of my feelings for Cody and allow myself to move on. I mean, he only died last year.\"\n\n\n\"Is that all? Hell, I was starting to think I was wrong, and you didn't like me or something. Or maybe you even thought I was a bad kisser.\" He chuckles and smiles down at you.\n\n\n\"That's just silly,\" you reply, smiling shyly up at him. \"You're a great kisser, by the way,\" you add quietly, looking away.\n\n\nHe grabs your chin, forcing you to meet his eyes. \"Don't be afraid, Nicole. It's time for you to move on with your life. You can't hide from love forever. It's been a year since he died...\n\n\n\"I know, but it's still hard,\" you whisper. You lean your head against JR's forehead and sigh, inhaling his male scent. He lightly kisses your forehead. You take a deep breath and look back up at him, slowly bringing your lips against his. You kiss his mouth lightly. You then try to pull away, but JR grabs the back of your head and deepens the kiss. You allow yourself to stop holding back and just enjoy the moment for once.", "action_results": [{"action": "Meanwhile", "result": "While you and JR are sitting on your tailgate, your other friends are just getting back onto the main road, headed toward town. Sarah and Davis are a few miles behind the van, not wanting to drive so close behind it in case any loose gravel flies back at the motorcycle. They are rounding a narrow curve when another vehicle suddenly appears out of nowhere. The two vehicles collide, throwing Sarah into the ditch. Davis somehow remains on the bike as the other car runs completely over both the bike and Davis, finally coming to a stop near the edge of road just past the curve. The half-blind old woman behind the wheel of the car, looks into her rearview mirror and almost faints at the sight of the poor young man still clutching the handle of his motorcycle.\n\n\nThe woman then climbs out of her car, looking for the young woman who had been also been riding the bike. She spots the young lady, lying in the ditch. The poor girl's neck was clearly broken. The woman returns to her car, searching for her cell phone in order to call for help.", "action_results": [{"action": "Continue", "result": "You and JR are still kissing passionately when you suddenly hear a car approaching from town. JR hops down from the tailgate and helps you down. The two of you head towards the front of the truck. Just as you reach the front bumper, another car appears and comes to a stop a few feet in front of you. A young man of about twenty-five steps out of the vehicle and walks toward you.\n\n\n\"You folks need any help?\" the young man asks, eyeing you and JR curiously.\n\n\n\"We're fine, sir,\" JR replies. \"Just waiting for our friends to return. Had a little engine trouble,\" he continues, gesturing towards the truck.\n\n\n\"Just thought I would stop and offer assistance,\" the young man says.\n\n\n\"We appreciate your offer, sir,\" you reply, smiling gratefully. The man looks at you intentedly for a few seconds. Just then, Ben and Amanda climb out of the truck. The man eyes Amanda before glancing disinterestedly at Ben. He makes you uncomfortable for some odd reason.", "action_results": [{"action": "Next", "result": "\"What's going on?\" Ben asks, as he Amanda reach the back of the truck. The young man suddenly draws a pistol from behind his back and shoots Ben straight between the eyes before you even have a chance to react. You hear Amanda scream as you stare at Ben's body, watching as it crumples slowly to the ground. You hear another gunshot and look around wildly, still in shock. JR clutches his midsection, covered in blood, as another gunshot rings out. You watch as another bullet hole appears on his chest. He falls backward and hits the ground. You look back at the gunman, wondering if your life is about to end as well?\n\n\n\"Don't even think about running or I swear I will shoot you dead,\" the gunman states flatly, with no emotion in his voice. He steps forward and tells Amanda to turn around. She complies, and the man cruelly pulls her arms behind her back before tying her hands together with a cord he takes from a pocket of his jeans. He commands you to turn around as well. You look around wildly for some way to escape before finally giving in and turning around. Your arms are forced behind you, and you feel your hands being bound as well. The cord bites cruelly into the skin of your wrists as you are lead towards the man's car.\n\n\nYou and Amanda are then forced into the back seat of his car. It's very awkward to sit with your hands tied as they are behind you. You finally manage to sit at an angle with your arms out to the side. Amanda sits on the other side of you as the man shuts the door. You watch as he drags Ben's body into the treeline at the edge of the road. He does the same with JR's body. Apparently the man doesn't really care if their bodies are found or not, as he doesn't make much of an effort to hide them. He shuts the doors of your truck and returns to the car. Amanda asks what he plans to do with you. He tells her to shut up and says that if you value your life at all, neither of you will say another word. You sit quietly for the remainder of the ride, wondering what fate awaits you...", "action_results": [{"action": "The Shack", "result": "You ride silently in the car for a few miles and watch as the man turns onto the road that leads toward Site 59. He stops the car in the driveway of a shack. He disappears inside the shack for a few minutes before returning to the car. He tells you to get out but instructs Amanda to wait inside the car. Terror consumes you as you panic, fearing the worst. The man leads you into the shack. Inside is an empty room, with several doors leading off of it. You are lead towards one of the doors. Inside is a stairwell leading into darkness. The man flips a lightswitch beside you and leads you down. At the bottom of the stairs is a dimly lit hallway with many doors to the left and right. You are lead into the second doorway. Inside the room, the man switches on the overhead light. You see a bed in the center of the room and begin to whimper.\n\n\nThe man tells you to quiet down and leads you past the bed to one corner of the room. There is a chair in this corner. You are forced into the chair. The man handcuffs you to the chair before leaving the room. You try to pull yourself loose but find yourself unable to escape your bonds. You survey your surroundings. Aside from the chair that you are sitting on, there is the bed a few feet away in the center of the room. Aimed at the bed, you notice a camera on a tri-pod. Beside the bed is a small nightstand. Atop the nightstand, you notice many sharp knives and other scary looking items. You begin to really struggle against your bonds as Amanda and the man enter the room.\n\n\nHe points a gun at you and demands you be still as he leads Amanda to the bed. Amanda begins struggling as she sees the items on the nightstand. The man slaps her and forces her to sit on the mattress. He unbinds her hands and forces her to lie back onto the bed. She begins to try to fight him, but he draws back his arm and punches her square in the face. She immediately stops fighting and grabs her face, now streaked with blood. The man pulls her legs apart and handcuffs each leg to one corner of the bed. He then grabs one of her arms and handcuffs it to the headboard, before grabbing her other arm and handcuffing it, as well.\n\n\nHe walks past you with a huge grin on his face. He heads for the camera and turns it on. \"Well, ladies, let's begin. Shall we?\" he announces. He grabs a roll of duct tape off the night stand and walks towards you. He quickly tapes your mouth shut. You watch as he crosses the room, returning to the night table.", "action_results": [{"action": "Next", "result": "\"What's your name?\" he asks Amanda. She refuses to answer. He raises his arm above her head, as if to strike her again. \"I asked your name,\" he demands. \"Or would you rather me hit you again?\"\n\n\n\"Amanda,\" she finally admits, whimpering.\n\n\n\"Well, Amanda. You are about to suffer. Just so ya know,\" he says, flatly. He grabs a pair of scissors off of the table and begins cutting off her jeans. She begins crying, begging him to stop. He doesn't respond, just keeps cutting. After her pants are removed, he cuts off her shirt as well.\n\n\n\"Please, don't,\" Amanda begs as her removes her bra. He ignores her plea and cuts away her final garment of clothing, a pair of bright pink panties. \"Why are you doing this?\" Amanda asks.\n\n\n\"To make a film that will make you and me famous,\" the man answers. \"Of course, you won't live through this to enjoy the fame, though.\" Amanda begins crying, begging him not to kill her. You watch in horror as he picks up a whip and begins lashing Amanda with it. Amanda screams as the whip cuts into her bare skin. Lashes appear across her stomach, legs, and breasts. He continues whipping her for a few minutes until her screams have begun to sound hoarse.\n\n\n\"I'm sorry about this next part, Amanda,\" he says, reaching for a knife. \"This will be very painful for you.\" Amandas tries to back away as he moves the knife towards her. She screams as the knife is thrust into her stomach. You watch as she is stabbed repeatedly, brutally. This goes on for about ten minutes, until Amanda has stopped screaming. The man checks her pulse and curses. \"Damn it all! That was too soon! I thought it would last longer than that.\" He walks over and shuts the camera off, before walking over to you.\n\n\n\"I will make sure you last longer, I promise,\" he says, turning your face towards him as you try to turn away. He removes the handcuffs and forces you to stand. You are lead from the room and down the hall. He leads you into another, similar room. He throws you down onto the bed. \"Don't worry, I'll be back soon,\" he promises, pulling the door closed. You hear the door latch as he locks it from the outside.\n\n\nYou look around the room and try to decide what you should do.", "action_results": [{"action": "Accept your Fate?", "result": "You decide that there's no point in trying to escape. He would probably catch you anyways and make your death that much more painful because of it. You wait in silence for the man to return, crying and begging for God to spare you somehow. Your prayers go unanswered, as the man eventually returns. He handcuffs you to the bed, just as he did with Amanda. He then leaves and returns with the camera and tripod. He sets up the camera across from the bed and turns it on.\n\n\nWalking back across the room, he picks up some scissors and removes all your clothes, same as he did before with Amanda. As he removes the last of your clothing, he reaches up and peels the tape from your mouth. He asks what your name is. Not caring what he does to you, realizing he will kill you either way, you spit in his face. This apparently excites him.\n\n\n\"Yes! You have more fight than your friend.\" He wipes your spittle from his face and looks at the night stand, debating which weapon to use on you first.\n\n\n\"Fuck you, asswipe,\" you scream, to get his attention back on you and not the table of death. He raises his hand and lowers it to strike you, before suddenly stopping.\n\n\n\"Damn, I didn't realize before how beautiful you are,\" he says, before reaching out and fondling one of your breasts. You try to pull away to no avail.\n\n\n\"Get your fucking hand off of me,\" you demand. He suddenly pinches your nipple hard, causing you to cry out.\n\n\n\"Watch your fucking mouth before I cut your tongue, ya hear?\" He lets go of your nipple and reaches for a condom you didn't notice before lying on the night stand. \"I think I want to have fun with you first,\" the man says as he stands up beside the bed and begins to strip. After he is naked, he mounts you. You look at the size of his manhood and nearly faint. You do faint eventually as he repeatedly rapes you for the next few hours.\n\n\nYou are kept chained to the bed for several days before the man finally finishes playing with you and ends your life....", "action_results": [{"action": "The End", "result": "Your score was: 25!!!", "action_results": [{"action": "END GAME", "result": "Oh no! You got a bad ending!\n\n\nYou should play again and try for a better ending!\n\n\nThanks for playing! XD", "action_results": [null]}]}]}, {"action": "Try to Escape?", "result": "You examine the nightstand for anything useful and spot a knife. You turn around and put your back against the table, trying to grab the knife with your bound hands. Finally grabbing it, you somehow manage to free your hands, only slightly cutting into your skin as you cut through your bonds. You examine your wrists when they are free, but the cuts aren't too deep. Spotting a screwdriver, you head for the door. Using the screwdriver, you somehow manage to pry the door open. Glancing up and down the hallway and not seeing your captor, you enter the hallway. Trying to make as little sound as possible, you try each door. At the end of the hallway, you finally find one that is unlocked at hurriedly enter the room, pulling the door closed behind you.\n\n\nYou find yourself in an apparent storage area. Boxes surround you, some stacked haphazardly. There are shelves along the far walls, some of which house tools of various sizes. On one of these shelves, you find a machete. You drop the knife and screwdriver you had taken from the room you just escaped from, and you heft the machete. It isn't as heavy as you had feared. You look around the room some more. There is a door at the other end of the room with stairs leading up.\n\n\nYou realize you have a choice to make. You can try to escape through this other door. Or you can try to hide and wait, and maybe disable your captor with the machete. Which would you like to do?", "action_results": [null, {"action": "Escape", "result": "You decide the machete is too heavy and don't take it with you. You run towards the back of the room. Running up a small set of stairs, you open the backdoor. You run across the backyard, heading for the woods. Suddenly, a shot fills the air. Looking over your shoulder, you see the man standing in the middle of the yard shooting at you with a pistol. You look back in front of you, but it's too late. You ran smack into a huge tree. You hit the ground in a daze and look back towards the man. He is upon you in seconds.\n\n\n\"You stupid little bitch! You should have stayed inside.\" He shoots you in the face...", "action_results": [{"action": "The End", "result": "Your score was: 40!!!", "action_results": [{"action": "END GAME", "result": "Aww... shucks! You got one of the worst endings and died a horrible death!\n\n\nYou should play again! (Come on, you can do better than that!!! XD)\n\n\nThanks for playing! :P", "action_results": [null]}]}]}]}]}]}]}]}]}]}]}]}, {"action": "Continue Trip", "result": "You decide to go ahead with the trip, despite your misgivings. All of your friends pile back into your various vehicles. You follow Mark's van back onto the main road, as he heads north out of town. After a mile or so, he turns on a loosely paved gravel road. You slow down, as your tires are churning up the loose gravel, flinging it in your wake. You hope Davis isn't too close behind you and that he is driving carefully on the loose gravel. You look into your rearview mirror but only see dust. A couple of miles later, Mark turns onto a narrow, overgrown dirt road.\n\n\nA sign on the left side of the road proclaims you have finally reached Site 59. The sign is old and weather beaten with faded, hand painted letters. As you continue to follow Mark's van, you notice several log cabins that appear to be run down and abandoned on either side of the road. The cabins begin to thin out. As you pass, you notice an empty trailer house with the door hanging off its hinges. You also pass a house that appears well maintained with a black suv parked out front. You pass a couple more cabins and travel a few more miles before reaching a dead end. You follow the van down the last driveway and pull up beside it to park. Davis pulls in and parks on the other side of the van.\n\n\nYou climb out of your truck and stretch, checking out the cabin. It appears just as abandoned and unkempt as many of the others that you had passed on the way in.  You help everyone unload the vehicles and gather all of the bags on the porch.", "action_results": [{"action": "Explore the Cabin", "result": "Mark hands you the keys to the cabin. He asks if you will start carrying all the luggage inside with Amanda. He and Robbie meanwhile, head into the backyard to get the lights and water turned on. You put the key in the lock and turn the knob, pushing the door open all the way. You are greeted by the smell of mold and disuse and the sight of more cobwebs than you care to count. There are rodent droppings littering the floor, and apparently the last person to visit left the cabin pretty trashed. You and Amanda decide to call the other ladies together and to give the a cabin a quick once over before bringing anything inside.\n\n\nIn no time at all, the cabin looks at least semi-habitable. Mark finally manages to get the water running. After more tinkering, the power soon follows. You all have a quick celebration, consisting of everyone patting themselves on the back for a job well done. Then, everyone gathers in the living room to discuss sleeping quarters. Mark and Heidi claim one room, as it is technically Mark's cabin. Sarah quickly claims a room for herself and Davis. Michelle and Steven announce their intent to enjoy the great outdoors by spending their evenings in a tent, which they are planning to set up in the backyard. Amanda looks quickly at her ex-boyfriend, Robbie, before asking JR or Ben if they wanted to share the last bedroom with her. Robbie looks at the floor, his face turning red. JR rejects the offer outright; but Ben finally accepts, causing catcalls from some of the male friends. \n\n\nThis leaves you, JR, and Robbie. Mark says that there is a foldout bed under one of the couches. He also brought along a double air-up mattress. Robbie quickly claims the couch, as JR states that he doesn't mind taking the air mattress. Looking between the two guys nervously, you announce your intent to sleep in your truck before running outside, tears pooling in your eyes.\n\n\n\"What the hell was that about?\" you hear Davis ask.\n\n\n\"You know why she's upset, Dumbass. Don't play stupid. Cody, remember? Your best friend, who died last year? Hello!? She's doesn't want to sleep with another guy\" Sarah defends you. You don't want to hear anymore... You just want to leave. Damn, Davis; ever the insensitive prick, you think to yourself. You sit on the porch step and look at the poorly tended yard. Sarah comes out to check on you, but you wave her away. No one understands. Yes, it has been over year. But the pain is still there, right under the surface. It still hurts so bad sometimes...", "action_results": [{"action": "Cody...", "result": "The memories suddenly come flooding back...\n\n\nThe first time you had met Cody... You were standing in front of your locker, freshman year, clueless as to where to go next. It was your first day at a new school, and as you stood there, trying to get your bearings among all the unfamiliar faces, there he was. You happened to glance up and had found yourself staring into the most beautiful eyes you had ever seen...\n\n\nYour first kiss... You were on your first date, and you kept nervously looking down at your lap, afraid of the emotions building up inside of you for this strange boy who could seemingly read your every thought. He had finally grabbed your chin, forcing you to meet his eyes, before slowly lowering his head until his lips had met yours...\n\n\nThe first time you had made love... It was the summer between your sophomore and junior year. After swimming all day in the creek behind your house, Cody had gently pulled you against him as you lay on the shore waiting for your clothes to dry. His lips had found yours, as his hands lazily explored your curves. You kisses had become more frantic as you had begun to feel an unfamiliar desire building inside, a need that only Cody could fulfill...\n\n\nAnd then the day you would never forget... Cody's brother on the other end of the phone, telling you to sit down, that there had been an accident. Your heart shattering into a million pieces as the news had sunk in. Visiting the hospital before they had pulled the plug. The funeral that had followed but that you can now barely recall. You screaming into your pillow every night at the emptiness inside. The gaping hole his death had left where your heart once resided...", "action_results": [{"action": "Continue Story", "result": "You are suddenly brought back to the present by the sound of someone stepping out onto the porch behind you. You hurriedly wipe your eyes and glance up to see JR standing behind you.\n\n\n\"You okay?\" he asks.\n\n\n\"Fine.\" You respond. But you don't feel fine at all.\n\n\n\"Well if you ever want to talk, I have lost someone close to me, too. So, I can probably relate better than any one else here,\" he offers. You smile gratefully up him, but insist that you're fine. \"You can have the air mattress, by the way. I don't mind sleeping on the floor,\" he says, before walking back inside. \n\n\nFeeling much better after releasing all your pent up energy and depression, you decide to head inside to enjoy the rest of the night with your friends. Besides, it has been over a year since Cody's death. And you can't resist the attraction you are beginning to feel towards JR.\n\n\nYou and your friends enjoy your first night together. You all drink too much beer, play too many drinking games, and generally act like idiot teenagers. After all, this was probably the last time for awhile that any of you would be able to have some fun, as the real world is looming over your heads. Some time during all the craziness, when you are pretty tipsy and ready to sleep; you stumble into the living room and throw yourself on the air mattress, not realizing JR is already laying on it. You land right on top of him and before you even realize what's happening, you find yourself kissing him passionately. It's been so long since you kissed anyone, you had forgotten how amazing it can feel. You find yourself giving in to the passion that is slowly consuming you.\n\n\nYou deepen the kiss, inviting his tongue into your mouth. He groans, and you feel him harden beneath you. You sigh, as he wraps his arms around you and presses you closer against him. You kiss him deeply, loving the feelings of passion stirring inside of you. It's been too damn long since you've felt anything but numbness inside. JR suddenly rolls you over, pressing himself against you harder, making you instantly wet. He begins tenderly stroking one of your nipples, through the fabric of your shirt. You realize how long it's been since you actually had a man inside you, and realize you want JR to fuck you and hard! This thought scares you, causing you to pull away. JR senses your hesitation, though you try to play it off. He grabs your hands and pulls you gently against his chest.\n\n\n\"It's okay if your not ready yet, Nicole. I'm not planning to go anywhere,\" he promises, into the darkening gloom. You fall asleep in JR's arms, and awaken the next morning, not knowing what memories from the night before are real and which are all a dream....", "action_results": [{"action": "Continue", "result": "You wake up the next morning, hungover and slightly disoriented. You feel someone next to you and look over to find JR lying beside you. What happened, you groggily wonder as you try to remember all the events from the night before. The memories begin to slowly come back to you, one at time, like scenes from a movie. The feel of his lips on yours, and his hands exploring your body. You remember all the kissing and touching, the emotions he stirred deep inside your prevously numb heart. And the need that had suddenly arisen inside you to be with him intimately. You can clearly recall those memories. But how is it possible for you to feel so strongly about someone that you barely even know?\n\n\nThe rest of your memories are vague and hard to recall. But for some reason, your mind insists on believing that there are other memories as well, hidden just below the surface. As you struggle to remember everything, other memories do begin to appear in your mind, but these memories are different. Harder to focus on and blurry around the edges. They are also more shocking and explicit; did they actually happen? You begin to see and feel these memories, as if they are happening right now. Touching bare skin, a tongue on your navel, a hand stroking your breasts; sensation making you feel alive again. Teeth nibbling your earlobe before latching onto a nipple, a hand slipping into your jeans to discover your most sensitive place, clothes being tossed aside in a hurry, and something pressing firmly against your womanhood, trying to ease its way in...\n\n\nNo! You yell in your mind... That never happened! I wouldn't have let it go that far, you reason with yourself. The more you try to focus on these \"memories\" though, the more blurry they become. You tell yourself it all must be just part of a dream, brought on by alcohol and the want that had suddenly arisen inside you, as you were kissing JR. Inside you are unsure, and you are haunted by the possibilities of what had transpired the previous night. The last thing you can clearly recall is kissing JR until your passion had built unbearably high, which had caused you to withdraw. But the more you try to pin down these other more faded memories, the more they elude you. You finally give up this task, praying it really is just part of a dream, and sit up looking around the room.", "action_results": [{"action": "Next", "result": "You suddenly notice that Robbie and Amanda are standing in the corner, obviously in the middle of a heated argument and trying not to wake anyone up. You try to tune out their conversation, not wanting to eavesdrop, and begin to quietly tiptoe out of the room. But as their whispered voices become louder by the second, you can soon hear every word.\n\n\n\"How could you, Amanda? How could you sleep with that ugly, nerdy, tub of lard?\" Robbie nearly growls.\"I thought you were better than that. I thought you had standards, damn it!\" He suddenly lashes out and punches the wall, inches from Amanda's face. She doesn't even flinch, making you wonder how long she has been dealing with Robbie's obviously violent tendencies.\n\n\n\"You know why, Robbie!\" She finally answers in a tired voice. \"Don't act stupid! You're the one who cheated on me, remember? You don't have any idea how that made me feel, Robbie. And everyone knew! Everyone was always looking at me with pity, but no one was brave enough to tell me the truth. I didn't need their damn pity! I just needed someone, anyone, to care about me... To love me.\" She starts crying, and Robbie reaches for her, but Amanda suddenly steps away from him. As you are stepping into the kitchen, you hear Amanda finally defend herself. \"Don't touch me! And what fucking business is it of yours who I choose to sleep with? Huh? You broke up with me, remember. Your loss! Now, leave me the fuck alone so I can enjoy hanging out with my friends one last time!\" She storms back to her room.\n\n\nYou enter the kitchen and head for the fidge, hoping to find a non-alcoholic drink. You finally spot a coke, pushed all the way against the back wall, behind everything else on the refrigerator shelf. You grab it and pop the top, wondering if you and the arguing ex couple are the only ones awake. You head to the kitchen sink, lost in thought about the argument you had just witnessed and still pondering the events of last night. As you set your cola on the counter and reach to turn on the faucet, intending to wash your hands and rinse your face, you happen to glance out the window. The sight before you causes you to freeze with your hand still reaching across the sink.\n\n\n\"There you are, beautiful...\" JR stops with one look at your face.\n\n\n\"What's wrong?\" He questions. You point one shaky finger at the window. He comes behind you and looks over your shoulder at the scene you cannot look away from. The tent that Michelle and Steven had spent last night sleeping in hangs in bloody tatters, and there are what appear to be torn clothes covered in blood scattered across the yard, leading into the wooded area at the far edge of the property. Michelle and Steven are nowhere to seen. You mind is numb, as you take in the horror of the scene in the backyard.\n\n\n\"Hey, EVERYONE, in the kitchen, NOW!!\" JR yells, in a loud enough voice to wake the dead... or possibly loud enough for whoever had done this to come back for the rest of you. You try to hush him and motion at him to lower his voice. You start to panic as you realize the severity of your situation.", "action_results": [{"action": "Next", "result": "\"What should we do now?\" you hear Amanda ask, in a strained voice as everyone gathers in the kitchen. She is obviously near panic. Everyone turns to look at you. You try to clear your thoughts, refusing to allow fear to consume you. You consider all of your options.\n\n\nWhat do you want to do first?", "action_results": [{"action": "Investigate the Backyard", "result": "You decide to investigate the backyard, in the hopes of finding out what happened to your friends. Perhaps it's just a prank? Steven always had been a bit of a prankster. You tell your everyone your plan, and JR insists on accompanying you. Mark, Davis, and Heidi join you and while the rest of your group stay inside. You open the backdoor and step onto the back porch, JR right behind you. You head across the yard to the edge of the property where the tent is set up.\n\n\nYou look inside the tent, and the sight before you makes you nauseous. There is blood everywhere inside of the tent. Streaks of it are across the walls, soaking into the sleeping bags, and it's even splattered on the ceiling. Scattered on the ground at your feet are bits and pieces of what appear to be the clothes Michelle had been wearing the night before. There are bloody footprints leading into the woods behind the property, down an overgrown trail that Mark's dad must have used during hunting season. Steven is no where to be seen.\n\n\nDeciding to at least peek down the trail for any hints as to Steven or Michelle's whereabouts, you follow the bloody footprints. As you near the woods, you see someone crumpled on the ground, a few feet down the trail. You heart starts to sink as JR runs past you and reaches the crumpled figure. You reach them just as JR flips Steven onto his back, and you immediately begin to scream.\n\n\nSteven lies at your feet with his throat slashed. There are many stab wounds on his abdomen and chest. His feet are bloody, as well. You realize that he must have been wounded at the tent and had tried to follow his assailant. He must have tried unsuccessfully to save Michelle. You can't tear your eyes away from Steven's bloody corpse. The blank staring eyes, the gruesome look on his face, the bloody gash in his throat, and all the blood... You had never seen so much blood. Someone had murdered your friend and abducted Michelle. Who would do something like this?", "action_results": [null]}, {"action": "Too Scared to Decide", "result": "You stand there in shock. The view of the backyard haunts your thoughts. Blood... so much blood. And the ripped clothing scattered everywhere, what had happened? Panic builds in your chest until you can't stand it anymore. You decide that standing here stupidly is just wasting time. You need to decide what to do. Fear gets you nowhere in life.", "action_results": [null]}, {"action": "Call the Police", "result": "You immediately head into the living room and search for your bag. You locate it in the corner of the room and search through it, looking for your cell phone. Finding your phone, you dial 911 and put the phone to your ear. After a minute, when it still doesn't start ringing, you pull the phone away from your ear. Reading the screen, you notice you have no signal bars. Apparently, being this far out in the woods has its disadvantages. You curse and walk around the room, pointing the phone in all directions. Still nothing... You tuck the phone into your pocket and head back to the group, still standing around the kitchen with shock etched upon their faces.", "action_results": [null]}, {"action": "Give Up", "result": "Fear swallows all of your other emotions, and you lie down on the floor and begin to sob, pulling your knees to your chest. Your friends look at you in shock. You have given up the will to survive. There is no point in continuing, you tell yourself. We are all going to die...\n\n\nYou friends all leave and try to escape. You hear a gun ring out, from somewhere outside, shortly after they leave. You continue to lie there, sobbing uncontrollably. You hear a door open in another room, followed by footsteps.\n\n\n\"Well, well, well. What do we have here?\" you hear an unfamiliar voice ask. You feel someone grab your ankles and look up into a face of pure evil. You let out a single blood-curdling scream before you are knocked unconscious by a blow to the head. You never regain consciousness.", "action_results": [{"action": "The End", "result": "Your score was: 0!!!", "action_results": [{"action": "END GAME", "result": "Oh no! You died! Please play again.... there are six better kinds of endings!\n\n\nReally, though... I know you can do better! Please play again before rating the game!!!\n\n\nThanks for playing! Scare ya next time! XD", "action_results": [null]}]}]}]}]}]}]}]}]}]}]}, {"action": "Wait", "result": "Despite your misgivings, you decide to go along with Mark. No sense in getting everyone worked up right here, where anyone could be listening. Your group continues toward the cabin. You head north on the main road through town, following Mark's van. Turning off the main road a mile or so from the town center, you drive up a more loosely paved gravel road. In the rearview mirror, you notice Davis slow down considerably and swerve slightly to avoid the worst of the gravel your truck is tossing up in it's wake. You slow down yourself to avoid accidently  causing your friend to wreck his bike. After a couple of miles, Mark turns left onto a bare dirt road.\n\n\nA crooked, weather-beaten sign that appears to be hand painted is on the left side of the road, announcing Site 59. You slow down even more and continue at a snail's pace. You pass a old abandoned trailer house, a few spooky looking cabins, and one house that appears to be occupied. It is the only sign of life that you have seen since leaving town. A black SUV is parked in the driveway. Passing by, you think you see a curtain part in one of the windows, but you aren't certain. You pass a few more cabins and drive a few more miles before reaching a dead end. You turn your vehicle into the last driveway behind Mark and pull up beside his van. Shifting into park, you watch as Davis parks on the other side of the van.\n\n\nGlad to finally get off the road for a few minutes, you exit your truck and walk toward the van. Everyone seems relieved to finally get a chance to stretch. You notice the cabin appears to be just as run down and unkempt as all of the others you had passed. Aside from that one random house, that is. Before anyone can unpack or even relax, you immediately recount your experience with the gas station clerk and his warnings. Unfortunately, no one seems to care about some crazy old man's opinion. You insist everyone discuss the situation seriously. How can you be sure he wasn't telling the truth and genuinely worried about your group, you reason. After much debate, with Sarah and Mark against any suggestion to leave, you finally vote on what you should do.", "action_results": [null, null, null]}]}]}]}]}, {"action": "Wait and Pack Later", "result": "You decide to wait and pack after dinner. Heading into the kitchen, you fix a quick dinner and even make sure to put a plate aside for your dad in the microwave. He will eat it when he gets home from work in a few hours. You then proceed to clean the kitchen and scribble a quick note to your dad explaining your plans, before grabbing your plate and heading to your bedroom upstairs. In your room, you sit down on the bed and turn on the television. Finding a comedy after channel surfing for a few minutes, you finally eat your dinner while you enjoy the movie.\n\n\nA few hours later, you look up at the clock on your bedroom wall and realize how late it is. You chide yourself for your own stupidity. It's very late, and you have to get up early to meet your friends for the trip. You decide to pack in the morning.\n\n\nYou lay down on the bed and stare at the ceiling, wondering about the trip and worrying about your dad. Although his cancer isn't too bad at the moment, you know it will soon worsen as your father is refusing to get treatment. Lost in your troubling thoughts, you soon fall asleep. Unfortunately, you forgot to set your alarm...", "action_results": [{"action": "Uh-oh...", "result": "You wake up to Sarah standing over you, yelling your name. You sit up, groggily wiping your eyes. You finally stand up and try to focus on Sarah's face as you struggle to fully awaken.\n\n\n\"Really, Nicole? You haven't even packed! Everyone is downstairs and ready to go....\"\n\n\n\"I'm sorry. Just gimme like five minutes. Swear. Go tell everyone I'm coming down in a few,\" you answer.\n\n\n\"Whatever, Nicole. But I swear if you aren't downstairs in ten minutes, we are leaving! With or without you, okay? You aren't going to ruin this weekend for me!\" she angrily starts downstairs.\n\n\nFudge! What's her problem, you wonder to yourself as you quickly change into a pair of blue jean shorts and a black tank top. You slip on your sneakers and grab your overnight bag. You hurriedly stuff in a couple of outfits, your deodorant, a hair brush, your small make-up bag, and a pair of flip-flops. Heading to the bathroom, you grab your toothbrush and stuff it into the top of your bag, zipping it closed. You run downstairs, grabbing your cell phone and key ring off the bar in the foyer as you leave your house, locking up behind you.\n\n\nIn the driveway, Davis stands by his motorcycle arguing with Sarah. Everyone else is gathered between Mark's beat up van and your truck. You notice all the luggage piled in the back of your truck and sigh inwardly. Looks like you're gonna have to drive...", "action_results": [null]}]}]}, {"action": "Meet the Gang!", "result": "These are the friends who travel with you on your trip:\n\n\n-Sarah is your best friend. She has been your closest friend since elementary school. She is dating Davis.\n\n\n-Davis is the so called \"bad boy\". He drives a motorcycle and is usually the first to cause any altercation within the group. He is dating Sarah.\n\n\n-Mark is the stoner aka the pot-smoking hippie. He is also the funniest of all your friends. He is dating Heidi.\n\n\n-Heidi is the shy one. Everyone tends to forget that she is even around sometimes, as she rarely speaks. Heidi is currently dating Mark.\n\n\n-Michelle is the smart one. She is dating Steven.\n\n\n-Steven is the athletic one, and he is also the only member of your group that is considered to be one of the \"popular\" crowd. He gave up his popularity and began hanging with your group of friends, soon after he and Michelle had begun dating.\n\n\n-Amanda is the youngest person among your group. She is only 17. She is a free-spirted young girl who loves to tell jokes. She is also very short, but that doesn't stop her from being the loudest of you all. She and Robbie recently broke up.\n\n\n-Robbie is the \"player\" of the group aka the womanizer or flirt. He and Amanda have just broken up.\n\n\n-Ben is the nerdy one. He is also the most overweight. He is currently single, but he has shown interest in you recently, much to your dismay.\n\n\n-JR is the newest member of your group of friends. He transferred to your school only six months ago. He is currently single.", "action_results": [null]}]}]}]}