{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=63463", "context": "", "first_story_block": "\"Wait, so how long have you been doing this?\"\n\n\nPutting down a Polaroid photo of a blonde woman leaning against a Mustang, you lift your head to see who's talking to you. He's a fresh-faced teenager, eighteen or nineteen years old, and he's looking at you with this absolute shit-eating grin. You deign to give him a response. \n\n\n\"Since 1965. I was one of the first Marines to land on the beaches of Vietnam, at Da Nang.\"\n\n\n\"Holy shit!\" He bumps his friend with an elbow and points at you. \n\n\n\"Hey look, old Gramps has shown up here!\"\n\n\nYou grit your teeth against the sound of the whirring helicopter rotors, ten thousand feet up in the sky. The other troops in the helicopter talk among themselves, laughing and sharing profanities. Some of them jeer at you, a relic of the earlier stages of the war. They've just finished boot camp and are full of all that restless energy from getting plenty of sleep, exercise, and three hot meals a day. Hell, some of them bet that they could single-handily win the war now they're in 'Nam. \n\n\nYou turn your attention away from them and look down at the land below you. The vast, sprawling jungle stretches before you, it's green immensity blocking any view of what lurks underneath. It's a dark place, one of the last untamed areas of the world. However, you feel an unnatural bond to it. While other men have faltered and deserted, you've returned to it, to the crucible of this war, again and again. \n\n\nThe helicopter descends towards a small outpost, a \"firebase\" dotted with large 155mm howtizers. As the 'copter's landing gear touches the ground, the cannons unleash a devastating barrage, shaking everyone inside. One by one, the troops get out, covering their ears. You stuff the photo in your pack and prepare to do the same, but the pilot calls out to you. \n\n\n\"Hey Sergeant! Be careful, it's pretty bad out there, from what I hear.\"\n\n\n\"Alright, I got it. Thanks for the lift,\" you respond.\n\n\n\"Roger that. Welcome back to the jungle.\"", "action_results": [{"action": "Continue", "result": "You head over to the barracks, where others like you are hustling to find their assigned platoons.  Inside, a single ceiling fan provides the only relief against the heat, which is magnified by the army green walls. You are surprised to see someone you recognize among the rows of identical bunk beds. \n\n\nA powerfully built dark-skinned man scowls as he glances at his cards in an intense game of poker with a few other Marines. The pot seems to consist of pornographic photos and a generous amount of alcohol. Once he sees you, however, he drops his cards and grins. \n\n\n\"Johnny, what are you doing here!\" he yells, getting up and hugging you. \n\n\n\"Corporal Bronski,\" you say with a smile, \"I should be asking you the same.\" You are stifled by his monstrous embrace. No one calls you \"Johnny\" other than Bronski, and when someone does, they'll be counting their bruises the next day. \n\n\n\"Johnny, I thought you were on leave for at least another few weeks. Why are you back in the bush?\" he asks you.\n\n\n \"The moment I arrived at Okinawa, I got called back. Well, I thought, there goes my hopes of scoring with some of the Japanese girls!\"\n\n\nBronski lets out a deep belly laugh and bends down, clutching his knees. You smile politely as you wait for him to catch his breath. \n\n\n\"Oh, that makes sense. You see, the Gooks broke their own damned truce for the Tet holiday, and they're attacking us almost everywhere. Some of them even made it into the fucking U.S. embassy. We held them back though, and now we're gonna strike at them. I think you can ask the Lieutenant if you wanna find out more.\"\n\n\n\"Lieutenant?\" You look around the barracks and see only about twenty-five men total, counting you and Bronski. \"This is barely a squad, let along a platoon. What do we have a Lieutenant for?\"\n\n\n\"Well, most of 2nd platoon is either AWOL, in the hospital, or dead. We've been trying to get replacements, but without much luck. We've got you, which is good, but they also flew in the Lieutenant, fresh from the Naval Academy to command this 'platoon'.\"\n\n\nThe Marines at the poker table clamor for his attention. \"Hey, we gonna finish this game or what?\"\n\n\nBronski looks at them, then back at you with a smile. \"Why don't you join us for some poker, like back in the old days.\" \n\n\nWhen you were a lowly private, you and Bronski gambled and whored and drank. It passed the time and was hell of a lot of fun. However, you're now a Sergeant; you've got responsibilities to put in order. \n\n\n\"Bronski, we should probably first talk to the Lieutenant before do anything else.\" \n\n\n\"Come on, Johnny, just a round. I'll introduce your new men, too.\" ", "action_results": [{"action": "Stay for a round of poker", "result": "It's been a while since you've spent some quality time with your fellow Marines, so you can't refuse. The men cheer as you take a seat at the poker table, and Bronski claps you on the back. You find yourself caught up in the game, so when you find you've run out of money, you're surprised to see that a few hours have passed.\n\n\n\"You gonna bet something, old man?\" The platoon machine gunner, Lance Corporal Simmons, grins at you with his heavily scarred face. Getting a face full of shrapnel from a mine earned him the nickname \"Capone,\" but his attempts to make you uncomfortable fail miserably. \n\n\nYou pull out your Polaroid photo of the woman leaning against the Mustang, and place it into the pot. \n\n\n\"Who's that?\" says PFC \"Doc\" Roe, who's really grating on you. The pampered college boy keeps spewing out how he's a conscentious objector. With his freckles and blue eyes, it's hard to take him seriously though. \n\n\nYou're a bit drunk and your lips are loose. \"She used to be my wife,\" you say, \"but I don't need to see her face anymore.\" \n\n\nBronski looks at you sympathetically, and clasps your shoulder with his hand. The veterans around you nod their head and keep quiet, not willing to press you for more information. A silent agreement among soldiers. However, the privates keep bitching about the sun, the food, and the local girls. Some things never change. \n\n\nDoc Roe goes on, \"Like I was saying, this war is injust. We shouldn't be going to foreign countries and bombing and killing people, while sending our own boys to die for nothing.\" \n\n\n\"Shut the hell up, will you! Pussies like you can't handle the Marines. I'd personally like to go out there and shoot me some commies,\" says Private Lering, his skinny frame betraying his boisterous ego. The two go back and forth, until you are ready to strangle them. However, someone in the room shouts. \n\n\n\"Atten-hut! Officer on deck!\" \n\n\nEveryone in the room immediately springs to their feet. The new Marines adopt a clumsy parade rest, but the vets don't bother. You get up and waver a little, unbalanced from the alcohol you've drunk. \n\n\nA young man, dressed in immaculately pressed fatigues and shined boots walks into the barracks. He stares at you with a cold grimace. Light reflects off his rank: a single gold bar, or \"butter-bar.\" He must be the Lieutenant. \n\n\n\"Sergeant, I've been waiting for you to report to me in my quarters, yet you failed to show. I come here and see you gambling while drunk and convorting with the other enlisted. You have failed to act as a responsible leader and broke several military regulations as well!\" \n\n\nAnger flares up inside you as the Lieutenant continues to rip into you. Who is this boy to insult you: a soldier who's a decade his elder with three years of combat experience? Your men hide looks of disgust as well. You're one of them, the Lieutenant is not. After the Lieutenant is done yelling at you, he moves on to Bronski, who seems to have broken rules since the moment he arrived here. \n\n\nThe Lieutenant finishes his tirade by saying \"you two are a disgrace to the entirety of non-commissioned officers in the United States Marine Corps. It is because of men like you that we are not winning this war!\" \n\n\nFuck that. The kid probably has never seen combat before in his life. You stay quiet though, and quickly sober up. \n\n\nThe Lieutenant sighs, sliding a piece of paper over to you. Orders. \n\n\n\"We are to participate in a helicopter assault at 0430 tomorrow. Get your men ready. I'll check in the equipment in four hours, there better not be a single defect.\" He spins around and marches away, his boots sounding against the hardwood floor.\n\n\nYou look at Bronski. \"He's quite the officer, ain't he?\" \n\n\nHe replies, \"Look, I'm sorry about the Lieutenant, but it isn't the first I got you in trouble with your superiors. Plus, he's like that to everyone.\" \n\n\nLaughing, you say, \"Ok, that's fair.\" \n\n\n You push away your feelings about the Lieutenant as you and Bronski get to work. You muster your half-drunk men and begin preparing equipment, but you are pissed when you find out many can't even disassemble an M-16 rifle. Bronski has the patience to help out, but you mostly yell and intimidate. Part of you is still mad from being scorned by the Lieutenant. \n\n\n\"What do you mean you can't clean your weapon? What are you gonna do when Charlie's on your ass and your rifle jams?\"\n\n\nLuckily, your hope is restored when you walk past Simmons. He sits in front of you with the various parts of his M-60 machine gun spread out and oiled in record time. \n\n\n\"Well Simmons, you've got here a pretty display, but can you use it?\"\n\n\n\"The Lord trains my hands for war, Sergeant.\" \n\n\nWell, at least there's one part of your platoon that not totally FUBAR. After somehow managing to pass the Lieutenant's inspection, your men go to bed. They seem jumpy, as for many of them it would be their first taste of the jungle. You can only hope it will not be their last. ", "action_results": [{"action": "The Assault", "result": "In the darkness of early morning, your platoon pile into helicopters, burdened by packs weighing excess of a hundred pounds. C-Rations, ammunition, explosives... you doubt command can confidently resupply you. As they take off, a sense of dread comes over even optimistic men, crammed together in the helicopters. Several take out rosaries and start praying, while others take final glances at pictures of loved ones back home. Some close by glance at you for reassurance, but your grim face offers none. \n\n\nThe helicopter ride was smooth until the end, where you braved light anti-aircraft fire on landing. Small explosions of black smoke dot the sky as the helicopter descends. Your squad is unscathed, but another helicopter's rotor is hit by the flak. It trails black smoke as it swirls out of control, going down in a great fireball in the jungle. There's no time to mourn as rest of the helicopters land and men start getting out. Mortars go off in the landing zone, their deafening explosions halting your disembarking men in their tracks as they squirm for cover. \n\n\n\"Get moving! Get to the tree-line or we'll be sending you home in a plastic bag!\" you yell while dragging the less courageous soldiers out of cover. \n\n\n\"Shit Sarge, I don't wanna die here!\" one says, with tears dripping down his dirt-covered face. \n\n\n\"Then pick up your feet and keep moving!\" \n\n\nWith Bronski's help, you push them into the jungle. As the squad enters, the towering trees block the daylight and they are plunged into darkness. Suddenly, it falls silent. You feel swallowed up by the rainforest, as if it were a great beast that forced you into its giant maw. Counting your men, you are relieved none were hurt, aside from a few damaged egos. \n\n\n\"It didn't look like much from the air, but now the jungle makes me feel so... small,\" says Doc Roe, though he quickly draws the attention of a jeering Private Lering. \n\n\nAfter marching for a while, you receive orders over the radio for your first operation. A search-and-destroy mission, you have to relocate your men twenty miles to arrive at the objective. The Lieutenant navigates with a map and compass, confident that he is on track. You arrive at the bank of a small river, with no choice but to wade across. \n\n\n\"What the hell! You make us go through twenty miles of thick jungle, you give us mosquito repellant that doesn't even work, and now this?\" says Lering. You silence him with a glare. Leading the squad across the river, your men keep complaining about the conditions, the conscripts making the most noise. \n\n\nYou mutter to Bronski, \"And this is even before they get malaria and dystentry.\"\n\n\nOnce you get to the other side, you are covered in leeches. The city boys in your regiment start screeching at the sight of them, but Lance Corporal Simmons simply walks over and burns them off with a cigarette. You continue forward, water sloshing in your boots while your wet fatigues stick to your body- they'll never dry in a climate like this. \n\n\nThe Lieutenant splits the platoon into two, him leading one half and leaving you and Bronski with the other. His detachment is to attack an enemy village harboring guerillas, while your men entrench and cut off escape routes. Finding a nice vantage point, you keep your men in a small grove of trees, concealed by the underbrush. The Lieutenant's squad leaves you and your men behind. Anticipation quickly turns into boredom, as they say: ninety percent of war is waiting for the other ten percent. \n\n\nAfter a few hours, you hear something moving through the forest around a hundred yards to the west. You set your binoculars on them, but you can't see what's making the noise. \n\n\n\n\"Is that the Lieutenant and his men?\" whispers Bronski. \n\n\n\"I don't know,\" you reply. \"They went to the east, but they could've circled back here.\"\n\n\nYour men, readying their weapons, look at you expectantly. Fear and excitement can be seen in their eyes. \n\n\n\"What are your orders, Sergeant?\" one says. \n\n\nYou doubt that they're friendlies moving in the brush, but you can't be sure. However, you are set up in a perfect ambush position, and whatever's in there can't see you. With a single word, you can launch a heavy wave of automatic fire at the potential enemies. Your eager men await your command. ", "action_results": [{"action": "“Hold your fire”", "result": "Raising up your right palm, you whisper \"Hold your fire!\" Your men look at you, confused. Keeping your focus at the possible enemy location, you call for the Simmons and the anti-tank team to ready their heavy weaponry. A few minutes pass, the air filled with tension as your men take aim. Then, out of the brush a few figures emerge. They are well camouflaged, leaves and branches covering their bodies. Viet Cong scouts, you think. They search the area, but can't discern your presence. They gesture behind them, and are followed by almost two dozen more men. They walk quietly out of cover, crouched to the ground. It is the perfect opportunity. \n\n\n\n\"Now!\" you yell. You and the rest of your squad opens fire. Most of your men fire their M-16s in automatic, spraying at the enemy. You know better though, and take accurate single shots. Simmons' machine gun cuts through the enemy, who fall like scythed wheat. The launcher roars and a high-explosive rocket impacts the center of the enemy column, sending dirt and body parts into the air. The Viet Cong are massacred before they even have a chance to fire back. The shooting ends as quickly as it had begun. In the silence, you hear moans of pain from the Viet Cong position, but your men did not receive a single casualty. \n\n\n\n\"What do we do with the survivors?\" asks Corporal Bronski. You flip over one who's still alive, checking for insignia, symbols of rank. Nothing. \n\n\n\"He doesn't have a uniform. These ones, we don't take prisoners,\" you reply with a grimace. As the sun starts to sets, a few more shots ring out, ending the suffering of the Viet Cong. ", "action_results": [{"action": "Continue", "result": "You regroup your men as dusk comes upon you. Private Lering boasts about his marksmanship, while Doc Roe shakes his head in disgust. The other Marines are shaking from the adrenaline of the fire-fight, silent about the things they have done. Today, they have finally killed- a baptism of fire.\n\n\nYou are concerned about the whereabouts of the rest of platoon, led by the Lieutenant. Confiding in Bronski, he assures you that they will found, eventually. As he says those words, a flare soars up the sky, basking the jungle with a blood-red light. \n\n\nBronski snorts. \"See, I told you.\" \n\n\nYou fail to see the humor of the situation. \"What is that kid doing! He's revealed his position to everyone in a ten-mile radius!\"\n\n\nThe squad marches over to a small clearing containing a single wizened tree, which is the center of a hastily built camp. Green tents flutter in the wind, barely held down by spokes, while the musty smell of gunpowder lingers in the air. By now, a thick fog has covered the jungle.They find their counterparts entrenched in the ground, along with a visibly shaken Lieutenant. They raise their rifles at the sight of you until you yell and reveal yourself. His eyes dart all over until he finds you, and he sighs with relief.\n\n\n\"Sergeant, thank god you're here! When the mist came, we heard sounds from all around the jungle. My men fired at them, but we hit nothing. I have no idea what they are!\" Well, at least he didn't friendly fire at you. \n\n\nHe starts rambling, \"We were supposed to attack a guerilla-controlled village, but I didn't find it. I checked my map, but I have no idea where we are! And my compass...\"\n\n\nHe takes it out. It's needle is erratically spinning, deciding on five different Norths in a few seconds. \n\n\n\"Sir, you have to calm down,\" you say authoritatively. \"These men's lives are in your hands. Once you panic, they will follow. We'll try the radio and contact friendly elements.\" \n\n\nYou walk over to Private Lering, who's skinny frame strains under the weight of his heavy backpack radio. He's in the process of bartering his chewing tobacco to a larger Marine so that he wouldn't have to carry it, but he quickly snaps to attention at the sight of you. \"You catch any signals on that radio?\"\n\n\n\"Sorry Sergeant. Nothing but static.\" You curse the obsolete radio your platoon has recieved. Reassuring the Lieutenant, you advise him to stay bunkered down here until dawn, which he agrees. You walk back to see your squad struggling to set up their own tents. Simmons smokes a cigarette, cradling his machine gun while laughing at the display. \n\n\n\"Good shooting out there, Simmons. I'd say that you were single-handily responsible for wiping out half of the VC.\" \n\n\nSimmons' smile fades. \"Well...thank you, Sergeant.\"\n\n\n\"Simmons, your shooting made it so not a single one of our men was hurt. You should be proud.\"\n\n\n\"I don't know, Sergeant. I keep thinking now, when this war is all done and over, how will I feel when I look back on what I've done? How am I going to tell my family what we did here?\" You don't answer back, but give him a reassuring pat on the back. You've been having these thoughts with increasing frequency, but they haven't been as distracting to you, as you have no more family to justify yourself to.\n\n\nA piercing scream drives you awake. Rifle fire erupts soon after, but as you poke your head out, you fail to see what is being fired at. You rush out with your M-16 towards the screaming, barely keeping your footing under the dim moonlight. \n\n\nYou arrive to find one of your Marines with a rusty metal object embed in his chest. His hands are wrapped tight around the wound, unable to stifle the blood, which flows in rivulets down his uniform. He looks at you with milky eyes, cloudy as the suffocating mist that surrounds you. He gasps for breath, pronouncing barely coherent words. You hesitate, not sure of the best course of action. You don't see the infiltrator who stabbed this man, but you know he must be close by. However, your fellow Marine is dying in front of your, and a medic may take too long to arrive. ", "action_results": [{"action": "Call for a Medic and Search for the Infiltrator", "result": "You don't have any medical experience, and may do more harm than good. \"Corpsmen!\" you shout, calling for Private \"Doc\" Roe to come help. There's nothing for you to do here, so you grab your rifle to try to find what attacked your men. \n\n\nVenturing outside of the platoon's perimeter, you look for imprints in the ground or broken twigs, anything that would suggest someone infiltrated here tonight. Nothing. Just as you give up the search, the surrounding mist thickens and engulfs you. A burning sensation wraps around your throat as a chill in the air makes you suddenly cold despite the jungle heat. You fall to the ground gasping for breath, strugging against the invisible vice-like grip around you neck. \n\n\nAs you start to lose consciousness, you see a tall figure standing above you, his features blotted out like ink. All you can see is a green beret on its head, as well as two fiery orange eyes staring at you with contempt. A Green Beret- they're supposed to be on your side!\n\n\nYour last words before you die are \"Why?\"", "action_results": []}, {"action": "Try to Treat His Wound Yourself", "result": "You may have no medical experience, but damn it! He's one of your men and it's your duty to protect his life. You call for a Private \"Doc\" Roe, but don't expect him to arrive, as rifle fire makes movement too dangerous. \n\n\nYou come to the Marine's side, whispering words of reassurance as you dress his wound. He look up and your horrified to recognize him- he's young Marine who ridiculed you on the helicopter! In his gasping breath you can make out certain words, \"The green beret... leeches with teeth... black blood...\" He falls unconscious, forcing you to double your efforts save him. The wound gushes out blood, so much blood. It soaks through the bandages, covering your hands and uniform. \n\n\n\"Don't you give up on me!\" you yell, as you scrounge your pack for fresh bandages. You can't find any. You tear off a piece of your sleeping bag and rush back over again, but stop when you see it. A tall figure stands next to the fallen Marine, and bends down to close his eyelids. The figure's face turns towards you but his features are inscrutable, as if blotted with ink. All you see is two orange eyes.\n\n\nIt wears a green beret, a hallmark of the United States Army Special Forces Division, but you realize that he must have been the one who stabbed your comerade. You raise your M-16 and spray at him, but the figure disappears among a wave of mist.\n\n\nA chill comes over your body despite the jungle heat. You run over to the wounded Marine and feel his pulse. Nothing. Your tears began to flow, though its not the first time you lost a man. You cover your face with your blood-covered hands and grieve. Around you the smothering mist dissipates, leaving you and the dead Marine alone. ", "action_results": [{"action": "Continue", "result": "As the sun rises, the gunfire stops. Someone puts his hand on your shoulder.\n\n\n\"Johnny, I know it's bad, but your men need you.\" You recognize Bronski's soft voice and dry your tears. You get up and wash your hands with your canteen, but suddenly you hear a cry of a pain from the camp. You jump in shock and reach for a rifle, only to see Bronski attempting to calm you down. \n\n\n\"This is serious, then.\" You run back to camp, and see your men in a circle around the tree. Your eyes fall upon what they are looking at. \n\n\nSeveral of your men lie on the ground, twitching in pain. Their rolled-up sleeves reveal their veins, black as night, showing through their skin. Most are silent in their suffering, waving their heads and whispering words from feverish dreams. At the very least, they are stacked under the shade of the only tree in the clearing. \n\n\nAmong them is your platoon medic, PFC \"Doc\" Roe. Private Lering is next to him, trying to comfort him but failing to hide his own distress at seeing his comrade wither away, even though they've never been on the best terms.  \n\n\nYour mouth opening in shock, you yell \"What the hell is going on here?\"\n\n\nThe Lieutenant walks up to you, a veneer of confidence on his pale face. \"Sergeant, when the mist came, something attacked us from it. Some of our men report seeing bloody Viet Cong uniforms, even though you reported wiping them out yesterday. However, the worst happened after we drove them back, when the mist left.\" \n\n\nBronski explains, \"We all felt a chill after the mist left, and some even felt kind of sink. However, the men in front of you began showing symptoms. An unnatural darkening of the blood visible on the surface of the body. Their skin turning grey and peeling off. Pain and hallucinations. Medicine didn't work for them. Painkillers were ineffective and ran out fast.\" Bronski was studying nursing in college before enlisting in the Marines. What a waste, you think, but you're glad someone understand's what's going on. \n\n\nThe Lieutenant says, \"What's strange, though, is that only the men who you led in the ambush are sick.\"\n\n\n \"They probably had been weakened by malaria and dysentry, though,\" replies Bronski. \n\n\nA decision needs to be made. Your platoon has several \"wounded\" and one dead. They need medevac, but you're lost and the radio isn't working. The diseased members of your platoons thrash and spasm in pain, making it impossible to transport them in stretchers. If you stay in this place, you are certain that everyone will die if the mist returns. \n\n\nBronski argues, \"We don't leave men behind! We stay here, and send a small party of men to search the surrounding area. If they can find help, or at least get our bearings, then we go.\" \n\n\nShaking his head, the Lieutenant says, \"I'm not sacrificing a whole platoon for a few men. We stay here, we will be butchered. We have to get moving, and unfortunately those wounded must stay here until we find help.\" \n\n\nAfter inconclusive arguing, they turn to you to break the deadlock. Staying would be a noble choice, part of the Marine code. Yet, you know more men will die if you do. You see Lance Corporal Simmons trying to comfort Private Lering, while a grave is dug for the Marine who died last night. You look at your men, at the fear in their eyes. You look at the newer Marines, their shaking hands as they try to muffle out the screams of their dying comrades. Their lives are in your hands. Shouldn't you try to save them?", "action_results": [{"action": "Stay with the Wounded", "result": "\"We're Marines! No man left behind. We can't leave our friends dying in this forsaken hellhole of a jungle!\"\n\n\nThe men of your platoon are gathered around you. Their sweaty faces brighten at the conviction in your voice, though you already doubt yourself. Do really believe that? You continue. \n\n\n\"We stay here and send a team to find help. Meanwhile, let's get this position fortified.\"\n\n\n\"Oo-rah!\" your men call out, inspired by your show of leadership. Their mood brightens for a little as they begin to get to work. You notice, though, that some of them aren't so enthusiastic. Those are the draftees and the grizzled veterans. \n\n\nThe Lieutenant glares at you. \"You've just consigned us to death, Sergeant.\" \n\n\n\"Die in honor than live in shame, eh?\" You reply in a hollow voice. \"I don't have the heart to leave these men behind. We have to stay in this clearing, where it's safe.\"\n\n\n\"Sergeant, I ask you to think again, is this really the right choice? No matter. If the search party doesn't return in two days, I'll be leading the next one for sure.\" He walks away, leaving you and Bronski.\n\n\n\"Johnny, don't let him bother you. We'll fortify, stay together, and survive this mess, you hear me?\" You nod, but aren't totally convinced by your decision. You could never live with the shame of leaving men behind when you held a dying man in your arms. You get lost in your thoughts as you watch the erection of a hospital tent, where the diseased are put inside.\n\n\nBronski leads the efforts to build up the defenses around the area, digging trenches and putting up sandbags and log walls. Your men aren't sappers, but they have a good showing and you are confident in the strength of your defences. However, you look at the ammunition boxes stacked near the walls. You realize that's not enough for a prolonged siege, and your hopes sink agan. \n\n\nLots are drawn and a team of five men, led by the Lance Corporal Simmons, is sent out into the jungle. They are to locate the river you traveled across a few days ago. Then, they will walk along it until they find something or run out of provisions, whichever comes first. You desperately hope they will find help, but part of you doubts they will. ", "action_results": [{"action": "A few days pass...", "result": "You glance over the wall, searching for any evidence of the returning search party. Nothing, except for the swaying trees of the thick jungle. You sigh, as this is the second search party you've sent that hasn't returned. The hospital tent has filling up with more and more diseased men, all from your ambush squad. The ones who die from the disease appear again as one of the creatures that attack you from the mist. You also feel some pain as well, veins blackening under your dirt-covered hands. You know you can't last much longer. You come back down to address your men, whose numbers have dwindled from the nightly attacks and the mist. They are grim and silent, waiting for you to confirm what they know. \n\n\n\"Men, I'm sorry. The Lieutenant didn't come back.\" They stiffen at the news. \n\n\n \"I can't tell you how proud I am of you. Only a week ago were you struggling to disassemble your weapons, but now, you fight with bayonets and machetes to save ammo. Your courage and bravery make one thing clear in this hellhole of a jungle- you are the finest Marines I've ever had the privilege to command. However, everyone has a limit. If anyone wants to leave right now, I will let you. Understand, this is the point of no return.\" \n\n\nA voice rings out from the crowd, and an injured Private Lering hobbles up to you. \n\n\n\"Sergeant, to be honest, if you told me this four days ago, I wouldn't hesitate. However, now I could never leave this squad. This squad is all I have, and the men within it have saved my life countless times. I will fight and die together with my brothers in arms.\" The rest of your platoon mutter their agreements.\n\n\n\"I see. Well, night falls in a couple of hours. Get the last of the ammunition ready, and sharpen your bayonets. We'll give the jungle one more good fight.\" \n\n\n\"Oo-rah!\" Your men get to work, repairing damaged fortifications and moving the wounded to strategic locations so that they continue fighting. You turn to Bronski, who's wiping away a tear as he watches the squad. He composes himself and straightens his uniform before talking. \n\n\n\"How about one last cigarette?\" he says, taking out a pack of Marlboros. \n\n\n\"I thought those ran out days ago!\" you laugh. You and Bronski smoke in peace, watching the sun slowly fall, painting hues of blue and red on the sky. \n\n\n\"You know Bronski, I've never thought I'd die like this. To me, death was always going to be a mine or a sniper, always something that would come out of nowhere.\" Bronski nods, giving his cigarette a long drag before puffing out smoke from his nose.\n\n\n\"Johnny, I feel the same. I've lived too long, and my time has come to join the ones who died long ago. I can only hope my family could make do without me.\" He says, trying to keep back the tears. You stamp your cigarette on the ground and pick up your rifle. The sun falls below the tree-line, once again revealing the sinister jungle. \n\n\n\"It's time for us to join our friends who died before us.\" He looks you in the eye and gives you one final handshake before moving to his flank of the barricade. You join your men, weapons readied at the surrounding jungle. The birds and the insects stop their chirping as the mist returns.\n\n\nDark shapes appear all around you, but you know better to shoot know, not wanting to waste ammunition. The first of the shadows appear, the mangled corpse of the Lieutenant. You put his hateful orange eyes in your sights and take him down with a single shot to the head. More figures emerge- the withered corpses of the dead members of the squad. They scream in familiar voices, but your men destroy them without hesitation. Then, mist thickens, and hundreds of shadows emerge. Some seem to be the dead bodies of Viet Cong, others wear what you guess to be French uniforms. In the middle of them, all stands the Green Beret, directing the corpses to attack. \n\n\n\"Fire at will!\" you yell, and your men put down a wave of bullets at the massive horde. Many of the figures are downed, but some jerk back when hit but keep moving forward. Your rifle runs out of ammo, so you pull your pistol and keep firing. The horde quickly closes in, as the gunfire falters. Ammo has run out. There's but yet one thing to do. \n\n\n\"Affix bayonets.\" There's a widespread clicking sound as your men attach their bayonets to the tips of their rifles. Their solemn faces look to you, and a sense of pride emerges within you. \n\n\n\"Charge!\" you yell, your rifle extended towards the horde. Your men yell out war cries and rush towards the enemy, their bayonets gleaming in the pale moonlight. The squad impacts into the front of the horde with such force that many of the shadows are knocked over. However, more move in to replace them, and brutal combat erupts. You stab your rifle bayonet into a battered French shadow, only for it to get stuck. Cursing you draw your machete and finish it off. Suddenly, a whoosh of air comes from behind and you instinctively dodge. You are now facing to face with the Green Beret. He wields a rusty bayonet, drawing your anger as you remember the young Marine he killed before. \n\n\n\"I won't let you go this time,\" you say. The Green Beret lunges towards you, but you dodge and trip him onto the ground. However, he grabs your ankle as well, making you plummet as his bayonet makes a gash in your leg. You ignore the pain and roll over, stabbing into the ground as he dodges. He tries to get back up, but you tackle him back down, slashing his throat with your machete. The Green Beret flails his arms, struggling to escape, but you won't let him. Finally, it's body disintegrates in the mist. You've done it. \n\n\nSeveral blades stab into your back, and you collapse. You watch your dwindling men fight against the overwhelming horde. Private Lering uses a wooden branch and clobbers several shadows before being cut down. Bronski has accumulated several slashes in his strategy to push down shadows and stomp them to dust. He too is stabbed in the back and falls. The sounds of fighting grow dim as darkness overtakes you. You smile at the thought of seeing your dead comrades once more. You'll have a lot of war stories to share. ", "action_results": []}]}, {"action": "Leave the Wounded Behind", "result": "Your men are gathered before you silent. You open your mouth to announce your decision, but the scream of a dying Marine interrupts you. When you do talk, it is barely a whisper. \n\n\n\"We can't stay here. You know that just as well as I do. We must leave and find help, but we can't take the wounded with us.\" \n\n\nArguments break out immediately. Your men are furious at your dishonorable orders. Some are secretly relieved, especially the conscripts, but show no outward support for you. \n\n\n\"I'm not leaving Roe behind,\" yells Private Lering, and a few other men join with him in agreement. \n\n\n\"Okay, if any of you wish to stay here, I will allow it,\" says the Lieutenant, but he fails to quell the anger of the platoon. You feel sick that you've decided to side with a man who's only out here to save his skin. However, there's no other way to keep your platoon alive. \n\n\nBronski looks at your men with a forlorn gaze. \"Johnny, why?\"\n\n\nYou stutter, \"Bronski, it was the only-\" but Bronski shakes his head and leaves your side. You observe the healthy men exchange their last farewells with the ones who decided to stay, before packing their tents and gear. All that's left is a small hospital tent, erected to house the diseased and give them a modicum of dignity. \n\n\nThe rest of the platoon departs from the clearing, leaving behind eight men, four of whom are sick. To find your bearings, you decide to locate the river you'd crossed earlier, and travel along it in search of help. You take one final glance at the clearing, at the men left behind to die, who are staring at you emotionlessly. ", "action_results": [{"action": "Continue", "result": "It takes hours to trudge back to the river, which is now stagnant and cloudy. You caution your men not to fill their canteens from it and continue along the river bank. It is late afternoon when you find something of interest. \n\n\nAfter walking around five miles, you find a rickety wooden bridge across a narrow part of the river. The jungle is incredibly thick here, so you can't imagine a village to be nearby. But the possibility is there. \n\n\nThe Lieutenant inspects the bridge. \"No more than a single man could walk across this. It might have been build by Viet Cong- there's no guarantee nearby villagers made it.\" \n\n\nYour men are disappointed by the news. Bronski interjects, saying, \"We should still explore the area. If we can find a village, then we can find help!\" \n\n\nThe Lieutenant shoots back. \"Stop with your prattling, Corporal Bronski. We are not going back into the thick of the jungle to get massacred by whatever's inside that mist. I spotted a large hill while we were walking a mile back. We should get on top and then look for villages or other landmarks. If we find nothing, we can still signal friendly aircraft with flares. I know we haven't heard a single helicopter around here for a while, but one surely one will see us at that height. \n\n\n\"Wait!\" You turn to see Lance Corporal Simmons, the scarred machine-gunner, speak out. \"If there is a village nearby, then we could wait by this river for someone from the village to come here. We'll just stay for a day, and then keep going if no one comes.\" \n\n\nIt's not a bad idea, but staying an extra day might be fatal considering that you're running out of food quickly. You were planning to find a defensible position for the night, which the bridge would not provide. However, if you can find a villager, then the extra risk could be worth it.\n\n ", "action_results": [{"action": "Stay by the Bridge", "result": "Diplomatically, you convince Bronski and the Lieutenant to stay by the bridge, meeting both of their plans halfway. Your men dig trenches a little farther away from the river, to avoid water getting inside. The platoon hunkers down for the night, anticipating a return of the mist. \n\n\nA red moon reflects off over the flowing river, casting everything in a bloody tint. In the dark, you watch with a \"starlight\" scope for anything threats or signs of danger. There's nothing yet. The jungle is quiet- no insects or birds seem to be around. \n\n\nYou hear a bubbling sound coming from the river. The river flows faster and faster, foaming over its banks. Before you can alert your men, water begins flooding out of it, pouring into your trenches. You are swamped by the wave as you fight to get out of your foxhole. Your clothes are soaked completely, extra weight that drags you down as you try to help other men out of the trenches. \n\n\nThe waves recede, replaced by a sound of something squirming from the river bank. You take out your flashlight and point towards the sound, revealing a black twitching wave converging on you. The wave is made up of leeches- thousands of leeches with glistening stingers. They squirm towards you quickly. You fire your rifle, but it jams after a few shots. An exploding grenade bows a hole into the wave, but it fails to even slow it down. Screams echo across your platoon as you try to run. The leeches sting you through your boots, your feet stiffening as their toxin enters your blood stream. You fall, englufed by the back wave. \n\n\nPain hits you as the leeches latches on to every part of your body. You roll over, crushing the leeches on your back. More replace them. You die a slow death, listening to the screams of your men who you've failed. After the leeches leave, all that's left of you is a sunken, hollowed corpse. You've been consumed by the jungle. \n\n\n \n\n ", "action_results": []}, {"action": "Explore the Area for a Village", "result": "\"Bronski's right,\" you say. \"Who knows what will happen to us if stay here or keep moving on. Our only chance to stay alive and find help is to search for a village.\" \n\n\nCorporal Bronski looks at you, nodding his head while the Lieutenant scowls, \"I'm in fucking charge here! We march to the hill, not pursue any fantasy in the forest.\" \n\n\n\"I'm with Johnny,\" Bronski says. \"Who else?\" Your men shout in assent.\n\n\n\"No, these are my orders. We go to the hill! I could court-martial you, Sergeant.\" \n\n\nLance Corporal Simmons walks up, his machine-gun in his arms. \"Lieutenant? I'd think you're hard-pressed to do that out here.\" \n\n\nYour men form a circle around the Lieutenant, who turns around, surprised at the change of events. His hands move to his pistol holster, but your men draw their rifles on him, forcing him to freeze. He is disarmed and handcuffed by your men, as he shouts a string of profanities out at you. You chuckle. \n\n\n\"That's behavior quite unbecoming of an officer.\"\n\n\n\"You'll lead us to death, Sergeant!\" \n\n\nYou divide the platoon into halves to search both sides of the river bank. You assign Bronski to lead one half so you can keep an eye on the Lieutenant, who you've forced to gag to prevent him from yelling. Your men fan out into the jungle, using machetes to slash through heavy vines and undergrowth. After hours of heavy exertion, you are soaked in sweat. You are almost ready to call it quits as the sun falls when one of your men points something out. \n\n\n\"Hey Sarge, there are some strange-looking trees over there.\" \n\n\nYou take out your binoculars and get a closer look. No, they aren't trees at all, but a section of a tall wooden palisade! A large wall made from sharpened tree trunks, whoever built it means business. You spread the word that a man-made structure, possibly a village, has been found. Your men cheer at the news despite being exhausted. You fire a flare into the sky to signal Bronski's squad to come over.\n\n\nHowever, the jungle falls suddenly silent. You hear soft footsteps all around you as the mist returns. \n\n\n\"Shit! We've got to get to the village!\" yells a private. Figures began appearing at the edge of the mist, but you know that Bronski's squad is still out there. Should you leave him behind to run to the village, or regroup and fight? ", "action_results": [{"action": "Run to the village", "result": "No, you've made it so far, and you won't give everything up to throw away your life. You might not have been honest with yourself, but all this time, your decisions have been about your personal survival. \n\n\n\"Run to the village! Get moving!\" you say, prodding your men forward. The mist thickens, and the shadows of the dead return. The mangled bodies of the Viet Cong you've killed approach you with rusty blades; their glowing orange eyes and blotted faces are identical to the Green Beret from last night.\n\n\nA private briefly stops to fire a burst into the nearest Viet Cong, but it soaks up the bullets and continues shambling. \n\n\n\"How can they do that?\" he gasps, his fear turned to despair. He halts in place, forcing you to drag him with you. \n\n\n Your slower men are overtaken by the dead Viet Cong, sliced to death by their knives. Their screams force the rest of your squad to push harder and faster until you finally arrive at the gate of the village.\n\n\n\"Open up! Please, we're going to die out here!\" your men yell, battering the sturdy wooden gate with their rifles. You can hear someone talking in Vietnamese inside the gate, but nothing happens. The dead Viet Cong finish off your slower men and now advance towards you. \n\n\n\"Use this!\" Simmons hands you a satchel charge, used to blow down doors and obstacles. Quickly, you set it up against the gate and run for cover. An explosion rocks the wooden palisade, the settled dust revealing a solid hole inside the gate. Your men rush inside to the sound of screaming Vietnamese girls, pushing past villagers scrambling to repair the hole. You take in your surroundings. \n\n\nThe village is made of mud-covered buildings that could hardly even qualify as shacks. However, a single sturdy concrete compound starkly stands out among the rest. You realize the significance of this and yell out. \n\n\n\"This is a fucking Viet Cong stronghold. There may still be some hiding around, search the area!\" \n\n\nSoon, you men have gathered the villagers, huddled in a tight group to comfort each other. One of your men signals to you. \n\n\n\"Sergeant, you have to see this,\" says Lance Corporal Simmons, his scarred face twisted in anger. \n\n\nYou are led into the concrete compound and see a full Western-style science laboratory inside. Two Marines restrain a wiry Vietnamese man in a lab coat, but your attention is drawn to the contents of the lab. Leeches with long stingers wriggle inside several beakers, a tube extracting a dripping black liquid from them. Photographs of the soldiers of the mist are tacked to the walls. A penciled sketch illustrates the progression of a familiar disease on the human body. A disease that darkens the veins and peels the skin. \n\n\nThe Vietnamese scientist speaks in frantic, but perfect English. \"No, this isn't what you think it is, I've been-\"\n\n\nA gunshot erupts, and his head snaps back. He collapses to the ground, a bullet hole in his forehead. You are surprised to see a pistol in your hand, trailing smoke. A part of your soul withers away as you look at his body, but you ignore the feeling. This village is responsible for the deaths of your men, and now you take your revenge. You look at your men, who have a pure, inarticulate fury in their eyes.  \n\n\nThe platoon's next actions happen spontaneously, without a need for words, for plans. They rampage through the village, killing everything, torching everything. You shut your ears to cries and pleas of the villagers. An elderly woman runs up to you, wearing a once bright blue dress that's faded and covered in dirt. She grabs your shirt, and screams, \"Tai Sao?Tai Sao?\" You smack her to the ground and shoot her as well. \n\n\nThe village lies in flame in front of you as the sun rises, dispelling the mist. Your men watch silently, a strange calm in the air. Suddenly, a terrible pain racks your body. You look at your arms as a black tinge starts to flow through your veins. Your screams join the rest of your men, as the disease quickly takes hold. After thrashing in pain for several minutes on the ground, your struggle ends. \n\n\nThat night, you rise as one of the creatures of the mist. ", "action_results": []}, {"action": "Regroup with Bronski", "result": "You can't abandon Bronski behind. He's your best and only friend, and you won't let him be butchered by the creatures of the mist. \n\n\n\"This way! We need to support our other half!\" you yell. \n\n\nYou receive a few confused looks until your men realize your plan. \n\n\n\"Shit, I'm not messing with that!\" yells one, who sprints towards the village anyway. He disappears into the mist, but his screams echo from within, dissuading the rest of your men from doing the same. \n\n\nFigures emerge from the mist. You see the mangled, shambling corpses of the dead Viet Cong you killed two days ago. They wield rusty blades, their orange eyes glowing in the dark. Some men freeze at the sight of them, but you drag them with you. You rally your men to the erupting sounds of combat near the bridge.\n\n\n\"Friendly, don't shoot!\" you yell, as you regroup with the rest of the squad. You see Bronski organizing his men until he looks at you with surprise.\n\n\n\"Looks like you've come back to have some fun, Johnny!\" he says, smiling. \n\n\n\"Could never miss it.\"\n\n\nYou and Bronski order your men to form a circle so that your fields of fire can cover all flanks. You wait for the mist creatures to arrive, and when the first of them shamble into your sights, your men open fire. Shell casing bounce off the ground as one by one, the dead Viet Cong are shot into pieces.\n\n\n\"I'm out of ammo!\" Bronski yells, followed by the rest of the platoon.\n\n\nYou see even more Viet Cong shamble towards you, getting too close. You say, \"No time to reload. Affix bayonets!\" \n\n\nYou platoon charges the Viet Cong, engaging in brutal hand to hand combat. Blood flows through the ground, as many of your men succumb to slashes. You are nearly overwhelmed until gunshots ring in the air. \n\n\nA group of Vietnamese civilians holds muskets and flintlocks, firing upon the dead Viet Cong. With their support, you manage to eliminate the rest of the mist creatures. The resulting battlefield is packed with the wounded and the dead. You slip on the blood and nearly collapse onto the ground, but Bronski holds you upright. \n\n\n\"This will be a battle we'll never forget, Johnny.\" ", "action_results": [{"action": "The Science Laboratory", "result": "The village gate opens for you, villagers carrying the wounded in stretchers. The village is made of small wooden buildings that could hardly even qualify as shacks. However, a single sturdy concrete compound starkly stands out among the rest. As you come inside, a wiry Vietnamese man in a lab coat approaches you, speaking perfect English. \n\n\n\"You must have many questions. Come with me to the lab.\" \n\n\nBronski and you are led into the concrete compound and see a full Western-style science laboratory inside. Leeches with long stingers wriggle inside several beakers, a tube extracting a dripping black liquid from them. Photographs of the soldiers of the mist are tacked to the walls. A penciled sketch illustrates the progression of a familiar disease on the human body. A disease that darkens the veins and peels the skin. \n\n\n\"What is this! Are you...\"\n\n\n\"No, it's complicated. I've called for evacuation for you on my radio, but let me explain what's going on.\" He takes out an old US Army uniform; it contains the insignia reserved for the most elite of forces- the Green Berets. \n\n\n\"I was deployed with the Green Berets five years ago to explore the... mysterious disappearance of soldiers in the area. We found that the local tributary of the Mekong River contained a unique species of leech, which had a stinger that could inject a toxin.\" He picks up the jar of leeches, its inhabitants trying to stab his hand with their stingers through the transparent glass.\n\n\n\"The toxin is responsible for a disease that you are very familiar with at this point.\" He points to the sketch of the symptoms, making you and Bronski shudder.\n\n\n\"I was a scientist sent to research this toxin, but the Green Berets messed up. All of them were killed by a Viet Cong patrol, except for one. He succumbed to the disease, joined the creatures of the mist. Meanwhile, I salvaged my equipment and ran for this village, where I continued my research until you arrived.\" \n\n\nYou glance at Bronski, and back to the scientist. \"Isn't this classified.\"\n\n\n\"It is, Sergeant. I assume the incoming Green Berets will have a lot of questions to ask you.\" \n\n\nYou join your men in the village square, some of whom talk and laugh with the villagers. With the mist gone, a beautiful dawn is revealed to you, gold and orange painting the sky. A scowling Lieutenant has been removed from his restraints, but he is so embarrassed that he doesn't even look at you in the face. The whirring rotors of a line of camouflaged helicopters fly towards you. \n\n\n\"We've survived, Johnny. I can hardly believe it.\" \n\n\nYou think above the sacrifices you and your platoon have made, of the men who've died and been left behind. \n\n\n\"Remember the cost.\" ", "action_results": []}]}]}, {"action": "Keep Traveling towards the Hill", "result": "This is no time for fantasizing. There's no village nearby, and searching for one will get you killed.\n\n\n\"Bronski, the Lieutenant is right. The hill is still our best chance of survival.\" \n\n\n\"Johnny, we need help as soon as we can get it. We'll have to travel for several days to get up that hill, and we'll be attacked on the way.\"\n\n\nThe Lieutenant interrupts, saying, \"Bronski, mind your own business. The Sergeant knows what he's talking about, not some Corporal who's been demoted for failing to control his drink.\" \n\n\nBronski looks at you, his eyes pleading, but you shake your head. He bows his head in defeat. \n\n\n\"Johnny, the war's changed you. I can hardly recognize you by your actions now.\" \n\n\nYou spend the next few days marching towards the hill. Every night, the mist returns. You fight the figures inside it, and are wounded several times. Morning brings the discovery that more of your men have been killed. Your platoon shrinks to half of former size. Still, no matter how hard you march you never seem to arrive at the hill. More days pass and you notice your men whispering to each other. Suspicious looks are on their brows. \n\n\nDuring a heavy march, a great pain erupts in your body. You look at your arms as a black tinge starts to flow through your veins. You fall down, your wounds seeping pus out of your bandages. \n\n\n\"Johnny! Johnny!\" Bronski, who was at the back of the column, runs up to you. He looks back at the platoon and tell everyone to halt. \n\n\nYou faintly moan out, \"Bronski, is that you? Are we still in boot camp? Shit, is the drill sergeant gonna bust my ass for not waking up?\" \n\n\n\"Johnny, you're delirious. The disease has hit you too. I have to help you.\"\n\n\n\"Bronski... I don't know what you're talking about. I feel pretty bad. Bronski, you ain't mad at me are you?\" \n\n\nBronski is now visibly crying. \"No Johnny, I'm not mad. Now, you stay with me. We've got some antibiotics, and we'll patch you up.\"\n\n\nThe Lieutenant walks over with a grim face. Your illness, however, distracts everyone from a small group of your men huddled next to a tree. They've been upset with their leadership, who's responsible for getting them lost in the jungle, abandoning their comrades, and driving them exhausted marching through the forest while been slaughtered at night. One takes out a grenade and pulls the pin. \n\n\nYou are deafened by a large explosion. Shrapnel punctures your stomach and lungs, forcing you to heave for breath. You see the Lieutenant blown into pieces, while Bronski collapses covered in blood. Your eyes meet as you lay dying on the jungle floor. \n\n\n\"Johnny, I'll see you on the other side.\" \n\n\nYou smile as darkness overtakes you. \n\n\n ", "action_results": []}]}]}]}]}]}]}, {"action": "“Open fire!”", "result": "\"Open fire!\" you yell, and your squad unloads heavy automatic fire on the possible enemy location. Leaves ripple through the air as the weapons kicks up a cloud of dust. After a minute of sustained fire, the squad run out of ammo. \n\n\nYou breathe deeply, with sweat on your brow. \"Did we do it?\" you think. \n\n\nA whizzing sound comes from the air. Instinctively, you jump to the ground and take cover as an explosion impacts the left flank. More whizzing, more explosions. \"They've got us pinned with mortars!\" you yell. A couple of your men scream, their legs blown off by the mortars. Doc Roe rushes over to them, but he's struck by a bullet and collapses on to the ground. \n\n\nFrom the brush, the Viet Cong strike back at you. Well camouflaged, they suffered minimal casualties from your opening barrage. Now, they counterattack at you with overwhelming force. Simmons fires his machine gun at them, cutting down a few before a grenade knocks him back and destroys the machine gun. He coughs out blood but gets up again, firing his pistol until he's riddled by a hailstorm of bullets. \n\n\nYou briefly lift your head only to have a bullet graze you, making you flinch. You see around two dozen VC charging your position with bayonet attached rifles, yelling in their foreign language. Heavily outnumbered, you cry for your men to fall back while you try to reload your rifle. Your order doesn't go through as a mortar shell directly impacts the ground above you, drowning out your voice. Uplifted dirt falls and buries you, while a sharp stabbing pain comes from your leg. Private Lering frantically looks for you before a bullet pierces his helmet. Entombed by the dirt, you fall unconscious, while the light footsteps of the Viet Cong run past you. ", "action_results": [{"action": "Alone with Bronski", "result": "A muffled voice calls out, \"Johnny, where are you? Shit, don't tell me they got you. Johnny!\" \n\n\nYou groan out in pain, and the voice gets closer. A moment passes as you feel you are dug out of the ground. Gasping for breath, you are happy to see Bronski's concerned face as he pulls you and dusts you off. You try to get to your feet, but immediately fall as your leg explodes in pain. You see a large piece of shrapnel stuck in your calf, which is oozing blood through your uniform. It must have been a fragment of the mortar shell which impacted so close to you. \n\n\n\"Shit!\" Bronski says. He brings out his first aid kit to treat your wound. Cutting away your blood-soaked pant leg, he takes a pair of tweezers and a piece of cloth. He whispers, \"I won't lie to you. This is gonna hurt, but you can't yell out. There's something in the jungle. Bite down on this.\" You do as he says, and he pulls the shrapnel out of your leg with the tweezers. Your cry of pain is muffled by the cloth. In no time, Bronski has disinfected and bandaged your wound.\n\n\n\"Can you stand?\" Bronski links his elbow around yours and helps you up. Throbbing pain emerges from your calf, but you ignore it and straighten yourself. You look around the area but are surprised that you don't see the bodies of your fallen men. Bronski guesses that they might have been dragged away by the Viet Cong as trophies of war, grisly as that sounds. Though he confirms that some managed to run away, he only survived by hiding in the foliage and shooting a Viet Cong that got too close with his pistol. \n\n\nIt's night. The dark jungle is full of chirping insects and birds, but you can barely see your hand in front of your face. If it weren't for Bronski's flashlight, you'd be completely blind. He says, \"We can't stay here. Though the Viet Cong left, I felt like something was still here, watching us. At any rate, the VC may return as well. We have to get out of here. I'm sorry, Johnny, but you're gonna have to walk.\" \n\n\n\"Don't worry Bronski, I'm sure it wouldn't be as bad as that time in boot camp when we had to hold hands and walk into the ocean,\" you say, trying to lighten the mood. Though Bronski has linked elbows with you, walking brings excruciating pain and you have to stop several times. You haven't made much progress out of the area when suddenly, a thick mist forms around you. Its presence is stifling, like a huge pillow covering you and slowing your step. \n\n\nBronski freezes. A tall figure stands a few yards from you. It stares directly at you, but you can't see its face, as if it were blotted out with ink. All you can see are its two fiery orange eyes that glean through the mist.  Its head is covered by a distinctive beret. \n\n\n\"Is, is that a Green Beret? US Army Special Forces?\" you ask Bronski.\n\n\n\"It may look like one, but that's not a person.\" Bronski raises his pistol and fires at the figure, but it disappears in the swirling mist. \n\n\nAs that happens, you hear a raspy voice call out from the mist. \"Sergeant! You killed us!\" \n\n\nYou look around, but don't see where it came from. Bronski tenses as he hears it, slowly circling with his pistol. The voice repeats, accompanied by another. Your eyes widen when you recognize the deep baritone of Lance Corporal Simmons. \n\n\n\"Sergeant, where were you when I was cut to pieces by bullets?\" More voices add to the fray, the voices of every dead man you've failed. Private Lering's, PFC Roe's, they all built up into a screeching cacophony. \n\n\n\"You let us die! You failed to protect us! You hid for safety as we were butchered! Now, we're going to make you feel our pain!\" You try to cover your ears, but the voices only get louder. You whimper for them to stop. \n\n\n\"Ignore them, Johnny! You have to snap out of it!\" says Bronski. He helps you hobble out of the mist, pushing you forward at an unrelenting pace. To your sides you see your deceased squadmates wander out of the mist, faces blotted and eyes orange like the Green Beret. They shamble towards you, screaming accusations at you. The ones blown to pieces by mortars appear as well, seemingly stitched together. They approach holding rusty blades, but Bronski blasts them back with his pistol. Soon, you get out of the mist and collapse on a tree trunk, exhausted. A deep sleep overtakes you, protecting you from the shame of your sins. ", "action_results": [{"action": "Morning with Bronski", "result": "The rising sun dispels the mist while bringing back the famous tenderizing heat of Vietnam. You and Bronski manage a few more miles through the jungle before succumbing to fatigue. Stopping for a drink, you guzzle down water until your canteen is bone dry. Shit, you're still thirsty though. You both sit under the shade of a tree, occupied by your thoughts. Eventually, you muster up the courage to ask, \"What was that last night?\" \n\n\nBronski stares out into the distance. \"Something...unnatural. It reminds me of an old bedtime story my grandma told me when I lived in the South - about Civil War soldiers.\"\n\n\nYou perk up, curious. Bronski has never talked about his childhood. \n\n\n\"What was the story about?\"\n\n\n\"Legend has it that there are patches of land in the South that saw vicious fighting- where men didn't shoot at each other in lines but fought and killed using hands, feet, and teeth. Sometimes, those places would be the graves of thousands of men. All that fighting and death would leave its mark, and the souls of the dead would stay there, fighting each other in an eternal battle. If you killed someone in a place like that, then the dead will rise and drag you into the ground with them, until you become one of them.\" \n\n\nYou laugh, \"That's a strange story to tell a child.\" \n\n\nBronski nods his head and smirks. \"I guess so. My grandma was a fine woman, but she was always a little off in the head.\"\n\n\nYou hope the same for yourself, that you're just crazy or delirious and imagined what you saw in the mist yesterday. But the accusations from your dead comrades, damning you to hell, still ring in your ears. You can still see their mangled bodies, their crooked gait as they reach for you. And their faces, orange eyes of utter hate staring into your soul. No, what you saw was real. Regret rolls over you, that your faulty order caused the death of your entire squad. You then realize something that makes you get up in shock, though pain shoots through your leg. \n\n\n\"Shit Bronski, what about the Lieutenant? Is his squad still alive? We have to find them!\" \n\n\nBronski calms you down and changes your bandages as your sudden movement caused your wound to bleed again. You need stitches, but Bronski's doesn't want your injury to be infected by shoddy needlework. \n\n\n\"You're right, we should look for him, but where? Johnny, our canteens are dry, and I'd hate to be stuck out in the jungle without water.\" \n\n\nYou'll return to the river you passed earlier, but that'll take time due to your bad leg. Should you risk searching for the Lieutenant's men, or play it safe and fill up on water? ", "action_results": [{"action": "Go to the river to fill up your canteen", "result": "No, you are in no condition to go on a goose hunt for the Lieutenant. You can only hope that his training at the Naval Academy will help him lead a group of frightened men- if they encountered the mist as well. Going to the river might also increase your chances of finding help. You're sure its the right choice. \n\n\nBronski fashions makeshift crutches for you before leaving. They're unwieldy and catch easily in the jungle underbrush, but at least Bronski won't have to babysit you on every step. Despite your situation, you're glad that at least you're here with Bronski. He's saved your life several times last night, so you hope you can repay the favor. \n\n\nSlowly but surely, you follow the squad's tracks from before and end up at the river. The flowing stream seems clean enough, but you pop some purification tablets into your canteen anyway. You and Bronski take a short nap near the river, before deciding on your next course of action. \n\n\n\"Johnny, maybe we should search along this river. We've lost our radioman, but we need to signal for help somehow.\" You look down at the long stretching river, which goes far into the distance. Certainly, if you travel along its banks long enough you'll find something or someone that could help you. However, you've lost an entire squad already. You try to push the fact away, but it haunts you at the back of your mind. You can't let that happen again, and with the Lieutenant in charge, who knows what could happen to the rest of your men? ", "action_results": [{"action": "Search for help along the river", "result": "\"Bronski, I don't want to leave him behind.\"\n\n\n\"I understand, Johnny, but you are in no condition to lead. Finding help is the best thing you could do for them now.\"\n\n\nAs you march along the riverbank, you enjoy the sound of the flowing water. It relaxes you and takes your mind off your worries and the impending dangers. As the sun sets, Bronski boils a stew to supplement your dwindling rations. As he takes a potful of water from the river, he stops, confused. \n\n\n\"What's the matter?\" you say. Bronski carefully reaches into the pot and takes out a wriggling black worm. It looks like a leech, but a closer examination reveals a small stinger coming out of its back. He tosses the leech back into the river. \n\n\nHe says, \"Well, I had several of these attached to me a few days ago as we waded through the river. I can only imagine what kind of nasty toxins it has inside that stinger.\" \n\n\nAfter dinner, you have the first watch. As the mist hasn't arrived yet, you start to doze off, until you realize something strange. The once flowing river is stagnant, and a quiet bubbling noise emanates from it. You point your flashlight at the river and see thousands of black leeches at the riverbank, slowly squirming out of the water towards you.\n\n\n\"Bronski, get up. We have to run!\"\n\n\nThe bubbling gets much louder as the river overflows its banks, sending the leeches towards you. \n\n\nBronski and you abandon your camp and try to get as deep into the jungle as you can, but the leeches are surprisingly fast, and you are slowed down by your leg injury and crutches. You feel a few stings as some of the leeches catch up with you. \n\n\n\"Leave me behind, Bronski!\" \n\n\nHe hesitates, not willing to let go of you, but you urge him away once more. The last thing you see before the black wave of leeches overtakes you is Bronski frantically running into the jungle. You hope he can find help and avoid your fate, as you are consumed by the jungle. ", "action_results": []}, {"action": "Return to the jungle to find the Lieutenant", "result": "\"No, Bronski, I can't abandon him. Too many have already died.\" \n\n\n\"Johnny, I know you feel guilty, but the best thing you could do for him is to find help!\" You shake your head, and Bronski sighs. \n\n\nYou search the general area, not finding much due to the nature of the jungle- footprints and broken twigs are quickly concealed by new growth. Yet, you notice a faint smell in one part of the jungle. A familiar smell, one recognized from prior experience traveling through devastated battlefields in the sweltering sun. It's the smell of death. \n\n\nBronski recognizes it as well, and you head in its direction. Eventually, you arrive at a clearing containing man-made defenses, like log walls, trenches, and sandbags. In the middle of the clearing stands a tree, where a pile of bodies is stacked against it. One of the bodies dangles from a rope around its neck. The flies covering the body fail to conceal the single gold bar on his lapel. It's the Lieutenant.\n\n\nBronski bends over and throws up. You control your gag reflex, as you've seen far worse than this. Other than the bodies, the clearing is abandoned. Looking around, you quickly deduce what occurred here.\n\n\nThe Lieutenant wasn't a popular man, given his insistence on following military regulation to the letter. Likely, he was killed by his men, once they grew dissatisfied with his leadership and especially since you and Bronski weren't there to stop them. Known as \"fragging\"(due to the use of grenades), you've never seen this happen in such a visceral way as hanging. Looking at the stacked up bodies, you realize why. \n\n\nA gruesome disease seems to have afflicted them. Their veins at the surface of the body are black, the skin slowly peeling off. Looking at the scratches on the tree and the dirt, you realize that those men had died thrashing around in pain. No wonder why the Lieutenant was killed by the platoon. They must have blamed the Lieutenant for the plight of the sick men. Afterward, without a proper leader they would scatter into the jungle, and who knows where they are now? \n\n\nBronski is still retching and sick, which surprises you. He's an experienced Marine and surely shouldn't be put off by a few bodies, though he may have been especially close to the dead men. Maybe there's something else bothering him. Suddenly, he runs into the jungle at full speed. You try to chase him, but you can't catch up by using your crutches. Your only friend has abandoned you in the jungle. ", "action_results": [{"action": "That night...", "result": "Your entire platoon is either dead or deserted, and even Bronski has abandoned you. You are extremely angry at your lack of control; it's as if the world is stamping you the ground, grinding you to dust. You haven't felt this way since... your wife left you and took everything you held dear- your home, your children, your status. And now this jungle will do the same for you. \n\n\nUnconsciously, you wander around the mass graveyard of your platoon. Ignoring the bodies and the smell, you gather all the weapons and ammunition you could find. You end up with around six rifles, three pistols, as well as a machinegun and a rocket launcher with ammo to spare. You decide to find a nice vantage point and wait for night to fall. \n\n\nTonight, a blood-red moon is in the sky, its glare illuminating your surroundings. The mist rolls in, with the return of the voices of your squadmates accusing you of their death. Added to the cacophony is the Lieutenant's voice. You lie in wait as the first of your dead comrades walks into your sights.\n\n\nFiring the machine-gun, you cut it down, but the mist creature soaks up far more shots than a regular human would. More and more of your dead platoon members return, but your accurate gunfire stops them. Though they get up and reform after falling them, you fire the rocket launcher at the horde, which scatters and destroys them. The mist is unrelenting though, and soon dead Viet Cong bodies and what you can only assume to be dead French soldiers attack as well. You pull out your pistol and bayonet and fight them in close quarters. Just as you've run out of ammo, the field around you is covered with the bodies of dead soldiers. \n\n\nJust one remains. The Green Beret, walking towards you has a rusty bayonet of his own. He moves with surprising speed, lunging at you with his bayonet, but you dash to the slide and slash at his abdomen. Unfazed, he stabs at you thrice in quick succession, but you dodge one and let the other bounce off your flak jacket. You feint with your knife but then pistol-whip him in the face. As he's dazed, you follow up by plowing him onto the ground and slitting his throat. Exhausted and wounded, you collapse onto the ground. \n\n\nOne more figure walks up to you. You struggle to get up, but the whole night of fighting renders you unable. The figure walks closer. You're horrified to see Bronski, transformed like the rest of the dead. He stares at you with orange eyes, cold and inhuman. \n\n\n\"You were sick, weren't you? That's why you ran away from me, into the jungle. You were still trying to save me.\" You wait for a response, but he's silent. You open yourself up for attack, but he doesn't move. \n\n\n\"No Johnny, I can't kill you. The jungle has proved to be your true home. You may not be dead, but you are still one of us.\" \n\n\nBronski walks away, disappearing with the mist along with the bodies of the dead soldiers. You are left in the field, weapons and shell casings scattered all over. Slowly, you find the strength to get up and patch up your injuries. As you search the equipment the soldiers the left behind, you find an old backpack radio. You briefly consider calling for evacuation but decide against it. Bronski was right- you belong here. You sling a rifle over your shoulder and walk into the jungle thick, searching for another fight. ", "action_results": []}]}]}, {"action": "Search for the Lieutenant's squad", "result": "Your duty as a sergeant weighs over you. You've failed miserably to protect the men under your command, but perhaps you could still save the rest of your platoon. Bronski is wary at your decision, given your current lack of water, but realizes that you truly feel responsible for the death of your men. He agrees to come with you, and fashions a makeshift pair of crutches to help you move better. \n\n\nThe crutches make you feel loud and clumsy, as they often snag on the jungle undergrowth, but at least Bronski doesn't have to help you with every step. You backtrack through the jungle, in hopes of finding the trail that the Lieutenant and his men left behind. Returning to the site of your squad's slaughter, you find something quite unnerving. \n\n\nThough none of your men's bodies are left, you find several Viet Cong soldiers dying on the ground. Their veins are black as night, their skin gray and peeling away. Thrashing in pain, when you approach them, they cry out to you in their foreign language. Though you don't understand what they are saying, it's clear what they want: end their suffering.\n\n\nYou raise your rifle, ready to oblige their final desire, but Bronski stops you. His face is pained, unlike his usually calm and optimistic demeanor. Your mouth gapes wide open as he pulls up his arm sleeve. His skin has turned gray as well, revealing black-blooded veins through his once dark skin. \n\n\n\"H-h-how?\" you stutter out. No, this can't be happening. You shut out a mental image of Bronski screaming in pain like the VC on the ground. \n\n\n\"Johnny, I didn't want to show you this. You were hurt yourself, and I didn't want to burden you with my problems.\" \n\n\n\"So why did you stop me from shoo-\"\n\n\n\"Because I didn't want this to happen to you too!\" Bronski sighs. \"As I said, when I was hiding after our squad broke, I shot a Viet Cong soldier who got too close. Suddenly, I felt a horrible pain through my body, but it faded immediately. Johnny, I've never killed before. Can you imagine that? After spending years in the bush, I've never shot a single Viet Cong. So at first, I just thought my mind was acting up. But the pain returned, and it got worse through the night...\" Bronski trails off. \n\n\nYou don't say it, but you are reminded of Bronski's story. He's killed someone, and now he will be dragged to the grave himself. It's strangely comical as if Bronski's just joking around with you like he always does.  A hollow laugh comes out of you, followed by tears. You can't accept it- that your only friend will die a painful death, leaving you stranded in the jungle. No, you won't accept it. You quickly wipe away your tears and look up at Bronski. \n\n\n\"Listen here,\" you say, \"I'm not going to let you die. Forget about the mission, the objective we had to capture. We're going to get out of this damn jungle, and we're going to get you help. Bronski, I promise you, I will do anything to make sure you return home safe to see your wife and kids.\"\n\n\n\"Johnny, you will do this... for me?\"\n\n\n\"Of course I will. If so, it would be the one good thing that has happened in this terrible goddamn war.\"\n\n\nNo time to waste, you begin to make plans. The Lieutenant is still out there somewhere, but he would have something that could help Bronski? No, you have to find something else, a high vantage point or a strong radio, which you can use to call for an evacuation. With your radioman dead, the latter would be much more difficult. Perhaps the Viet Cong had something of use? Maybe you should search for their base camp instead. ", "action_results": [{"action": "Find a high vantage point to signal for evacuation", "result": "Tangling around with the Viet Cong is a bad idea, and you have no info on the Lieutenant to justify searching for him either. You saw a tall hill a few days ago, which you guess would be around 40 miles away to the northeast. You'll get to the top and use signal flares to call for evacuation if you manage to find friendly air forces in the area. \n\n\nRefilling your canteens from the fallen Viet Cong, you abstain from mercy killing them, as you don't want to risk Bronski's illness being worsened as a result. You begin marching through the treacherous jungle, pushing yourself to go fast despite your crutches. \n\n\nFor the next few days, you travel. At night, the mist returns, but you only see the Green Beret this time, staring at you from a distance. Bronski gets worse and worse until you are faster than him with your crutches. You encourage him the best you can, telling stories from your war experiences and reminding him to keep pushing forward, so that he may eventually see his family again. Yet, the symptoms keep increasing in severity. \n\n\nDuring the fifth day of your march, Bronski's legs give way, and he collapses on the ground.\n\n\n\"Shit Bronski, no!\" You stumble over to him and try to lift him again, but he's too heavy. His condition is now similar to the Viet Cong soldiers you saw, spasming on the ground in pain. \n\n\n\"Johnny, Johnny.\" He groans out. \n\n\n\"Bronski, you have to keep going! The hill is only a few more hours away!\" \n\n\n\"Johnny, thank you for trying to help me. Can you do one last thing for me, please?\"\n\n\nYou stifle your tears. \"Don't you be saying stuff like that, Bronski. It's just a few more hours away, we'll get you home.\"\n\n\n\"Johnny, I don't want to be turned into one of those things in the mist. Can you do that for me?\"\n\n\n\"It won't come to that, but I will if it makes you feel better. Just, stay still, and I'll drag you to the hill.\" \n\n\nIt's difficult, but you can't leave him there. You tie Bronski's ankles to your feet, allowing you to drag him forward while still using your crutches. He's a large man, and every step is difficult. Your back starts aching like it's on fire, but you ignore it and keep moving. You keep your sight on the large hill up ahead, only a few more miles further. Keep going, keep going. Your feel your Achilles tendon tear, but you ignore it. Keep going, keep going. Now you're at the edge of the large hill, the incline making it even more difficult to climb up. Keep going, keep going. One of your crutches snaps in the effort, almost causing you to slide off the hill, but you stabilize with your remaining crutch. Keep going, and keep going. The other crutch snaps as well, forcing you to crawl forward on your hands while pulling Bronski behind you. The sharp pebbles of the mountain tear into your palms, leaving a blood trail every few feet you go. Keep going. You arrive at the top as the sun begins to set. \n\n\n\"Yes! Yes! We did it Bronski!\" You've never seen a more beautiful sunset in your life. You start fumbling out some flares from your pack, lighting them on top of the hill. However, the red light allows you to notice something. Bronski is gone. \n\n\nNo, no, no, that can't be. You close your eyes and open them again. You don't see him. You drag yourself all around the hilltop, calling his name. You don't see him. You look at the rope coil at your feet, which was once tied around his legs. Now, it's tied around a pistol. Bronski's pistol. A Colt Model 1911, powerful and reliable like it's owner. \n\n\nYou scream your lungs out, releasing a war's worth of hidden pain, anger, and torment. Screaming until your voice gets hoarse, you collapse on the ground and gasp for breath. A great calm comes upon you, and the sounds of the jungle fade away.  You untie Bronski's pistol, which is covered in blood. You fervently try to wipe it away, but its no use. Well, that doesn't matter. You check to see if the pistol is loaded and close your eyes, pointing its barrel at your temple.\n\n\nThe mist gathers around you again, but you don't pay it any attention. Your fingers tighten around the trigger, slowly pulling it. Halfway through, you hear a soft voice... \n\n\n\"When Johnny comes marching home again,\n\n\nHurrah! Hurrah!\n\n\nWe'll give him a hearty welcome then\n\n\nHurrah! Hurrah!\n\n\nThe men will cheer and the boys will shout\n\n\nThe ladies they will all turn out\n\n\nAnd we'll all feel gay when Johnny comes marching home\" \n\n\n\nIt's a familiar voice- Bronski's voice. Your index finger loosens around the trigger before you remove it entirely. You've made a promise with Bronski, and now you must keep it. You slowly stumble down the hill, while he keeps singing. \n\n\nThe old church bell will peal with joy\n\nHurrah! Hurrah!\n\nTo welcome home our darling boy,\n\nHurrah! Hurrah!\n\n\n\nYou are near the bottom, and you see a figure, with his back turned against you. Your hands shaking, you raise the pistol at it. It turns around, and despite it's blotted face and orange eyes, you can tell that it is him- Bronski. Your finger comes off the trigger, as you hesitate. It stares at you, its cold orange eyes showing no emotion, showing no humanity. \n\n\nWe'll give the hero three times three,\n\nHurrah! Hurrah!\n\nThe laurel wreath is ready now\n\nTo place upon his loyal brow\n\nAnd we'll all…\n\n\n\nNo, it may look like him, but it's not him. You fire the pistol at its head two times. The figure that looks like Bronski collapses, but all it does is laugh, a deep belly laugh- which you would hear when Bronski would tell an especially funny joke and then laugh at himself. You walk up to the figure and empty your magazine into it. The body disintegrates, but the laughing continues inside your head. In an impulse, you turn the pistol on yourself, but there's no more ammo. You fall to the ground and throw the pistol far into the jungle. \n\n\nAs you lie catatonic on the floor, the whirring rotors of a rescue helicopter sound above you, but you don't hear it. \n\n\n \n\n ", "action_results": []}, {"action": "Search for the Viet Cong base camp", "result": "The camp should be close by, but you're concerned about the possibility of meeting live Viet Cong. You wonder how your enemies are dealing with the threats of the jungle horrors. Nonetheless, you're desperate to find something that could help Bronski, and maybe natives to this country have a better idea about what you're dealing with here. \n\n\nYou tell Bronski to abstain from mercy-killing the guerillas on the ground, fearing that it might hasten the spreading of his illness. You leave one of them with a weapon, letting them do the gruesome job themselves. Gunshots go off as you begin searching for their trail. \n\n\nThe VC's were regulars and were very discreet when they approached and attacked your squad. But little escapes your senses, sharpened by years of war. A shoe print here, a broken twig there, and you steadily track the Viet Cong to where they came from. You also manage to avoid a few booby traps and mines; some were obvious, but others you almost tripped with your clumsy crutches if it weren't for Bronski's watchful eye. \n\n\nThe trail suddenly stops. You arrive at a seemingly insignificant area in the deep jungle thick, surrounded by large trees and bushes. However, the smell of death lingers in the air. Searching the area, you find a wide tunnel into ground carefully concealed by a covering of woven branches and vines. You carefully enter with a flashlight, while Bronski covers you with a rifle. The tunnel slopes down around twenty feet, before opening up into a large room, supported by wooden beams.\n\n\nIn this room lies the bodies of the rest of the Viet Cong. They died fighting, evidenced by the scattered shell casings, bullet holes in the walls, and crazed looks on their dead faces. Slash marks cover their bodies, and the dirt floor is completely painted in blood. You step around carefully, noting the crates of extra food and ammunition stacked in the corner of the room. This was indeed their base camp, but something came inside and killed the rest of them. You can guess what that may be. \n\n\nCuriously, on one side of the room is a sturdy steel door, something you've never seen in a Viet Cong hideout. Approaching the door, you see it been heavily battered by the Viet Cong, as they tried to break through it to escape from their deaths. A combination lock on the door kept that from happening. \n\n\n\"Where do you think this leads, Bronski?\"\n\n\nHe smiles a little and takes out a small canvas bag with a shoulder strap. A satchel charge, it enough C-4 to blow down any obstacle. You exit out the tunnel and close your ears. Bronski pulls the pin and a loud explosion sounds out. The steel door has been blown out of its frame, but you're lucky it hasn't collapsed the underground camp as well. \n\n\nThe environment inside the door here has completely changed. Inside the door is a long corridor with concrete floors and walls. Light fixtures dot the ceiling, but those have gone dark. Midway, the corridor is intersected by another hallway going to the right. At the end of a corridor is another steel door, but with a symbol marked on it. \n\n\n\"Let's check that out,\" you whisper to Bronski.\n\n\nYou creep towards the door, trying to keep your step silent despite your crutches. However, when you come up to the hallway a knife twirls through the air towards you. You dodge, but it strikes Bronski in the arm, who drops his rifle which clatters onto the concrete floor. Across the hallway stands the Green Beret, who carries a machete and is quickly advancing towards you! ", "action_results": [{"action": "Draw your pistol", "result": "You draw your pistol from its holster and fire down the hallway. The Green Beret jerks back with every shot, but it soaks up your entire magazine and still comes towards you. You manage to unsheathe your bayonet as he lunges on top of you, attempting to slash your throat. Grabbing his arm before the blade comes down, you try to push away the machete, but to no avail. The rusty but sharp blades inches towards you, its wielder staring at you with inhuman orange eyes. Suddenly, the Green Beret's head is knocked back. Bronski had recovered and slammed it with the butt of his rifle. You take the opportunity to jam your bayonet into the Green Beret's eyes. He lets out a piercing animalistic shriek, flailing his arms in a struggle to get free. Finally, he stops moving, and with that, the body disintegrates into mist. \n\n\nYou turn around to thank Bronski for saving your life once more, but you're startled by his condition. With the knife embed in his arm, his illness has drastically worsened. In the dim flashlight, you see him gritting in pain as the skin on his arms starts peeling. His eyes have started to display an orange tinge as well. \n\n\n\"Bronski, hold on, we're gonna get you out of here.\" He can barely move, so you drag him with one arm towards the door at the end of the corridor. You briefly stop as you notice something shiny left behind as the Green Beret's body disintegrated. A pair of dog tags. They are quickly scooped up into your hands before you proceed through the door, which is thankfully unlocked. \n\n\nYou enter what seems to be a mission control room. Files and papers of all sorts are haphazardly scattered around. In the center, a large map on a table depicts features you recognize as nearby terrain- the river, the Viet Cong hideout. Referencing your own map, you quickly realize that the Lieutenant had made a terrible mistake in navigation. You chuckle as you remember an old joke- the deadliest thing in the world is a Second Lieutenant with a map and compass. \n\n\nYour eyes set on the corner of the room, where a long-range radio sits. Jackpot. You lay Bronski down on a chair and tell him that everything is going to be okay. No idea how to operate a radio, you fiddle with the switches and dials and try broadcasting your voice on as many frequencies as you can. Suddenly, you receive a signal. \n\n\nA deep voice sounds out from the radio. \"How did you manage to get hold of this frequency?\"\n\n\nYou hesitate, not expecting to be so lucky. \n\n\n\"I'm Sergeant Smith of the Marines. I need evacuation, one of my squadmates is infected with a-\"\n\n\n\"Answer my question, Sergeant, and understand that you are speaking with the commander of the 1st Special Forces. You've breached a highly classified facility that we've lost contact with long ago.\" \n\n\nYou frantically explain the events of the last days, while the voice remains silent. \n\n\n\"Please, my friend is dying! We can't wait any longer.\" You glance at Bronski, who is starting to cough out blood. He seems delirious, unaware of what's going on. \n\n\n\"Evacuation will arrive shortly, Sergeant. But you must do one thing first.\"", "action_results": [{"action": "The final task", "result": "\"What could you possibly demand of me?\" you say. \n\n\n\"There's an armory located in the facility. It contains a large number of explosives, especially napalm. Destroy the facility and collapse the tunnel leading in.\" \n\n\nYou suspect that Special Forces are forcing you to do their dirty work and cover up the secrets here. Enraged that they place that objective above saving Bronski's life, you snatch a few files from the room before getting to work. After dragging Bronski out of the tunnel, you travel across the hallway to the armory. You dump the explosive in one area and create a trail of napalm leading from it to the tunnel entrance. You light the napalm, which travels down the line into the facility, igniting the explosives. The ground shudders as the tunnel collapses, sealing it off from the world.\n\n\n\"Johnny, what's going on? The sun's so bright, it's hurting my eyes.\" You and Bronski are sitting in the shade, but you see that his eyes are starting to turn orange. You push down your panic. \n\n\n\"Bronski, just relax, help's going to come soon. Just hold on.\" Nothing to do but wait, you look through the files that you've taken from the facility.\n\n\nThe first file describes the deployment of Green Berets in the area five years ago to investigate the disappearance several platoons of South Vietnamese soldiers.\n\n\nThe second file describes a discovery about the nearby river, a small tributary of the Mekong containing a unique species of leech, which had stingers that could inject a certain toxin.\n\n\nThe third file contains the approved orders for the construction of an underground science laboratory near the river.\n\n\nThe final file, however, is a handwritten note. \n\n\n\"It's getting dark, so dark. Richie and Hammond are dead, killed by the things from the mist. We thought that they were once soldiers, but they're inhuman- something different. The Vietnamese scientist escaped though, to the nearby village we identified earlier. However, the sickness courses through me. My veins are getting dark, skin peeling. I've locked myself in the science laboratory, but the radio won't work...all static. If anyone finds this, tell my parents I died for my country. \n\n\nStaff Sergeant Adam Hinks, 1st Special Forces\n\n\n\nThe name matches the pair of dog tags you've picked up. Everything starts to come together, as you realize what has happened. A secret science project supported by Special Forces. A supernatural toxin that turns killers into... monsters. The implications are horrible, and all this time your squad naively wandered into this valley of death. Suddenly, you hear the sounds of helicopter rotors. \n\n\nA group of large camouflaged helicopters arrive and hover above you. Soldiers, which you recognize as Green Berets, rappel down from them. They forcibly disarm you and place you into handcuffs, while Bronski is led away in a stretcher.\n\n\n\"What the hell are you doing!\" you yell, struggling against your restraints as you are separated from him. A bag is placed over your head and a needle stuck into your arm.\n\n\n\"You shouldn't have been reading these files, Sergeant. Oh well, the general wants to see you.\" \n\n\nDrowsiness overtakes you, and you fall unconscious as you are carried into a helicopter. You and Bronski's fate go into the hands of powers beyond your control. \n\n\n ", "action_results": []}]}, {"action": "Go for Bronski's rifle", "result": "You drop one of your crutches and lunge for Bronski's rifle on the ground. Once it's in your hands you turn around and fire a wild burst down the hallway at the Green Beret. However, you only manage to fire several shots before the M-16 jams, hitting the Green Beret a few times but not even managing to slow him down. You try drawing your sidearm but he with suprising speed, jumping on top of you and slashing your throat. \n\n\nYou choke on your own blood as you watch Bronski recover and try fighting back against the Green Beret. Bronski fires his pistol at it, but the Gren Beret grabs his arm and the shots go wild. He stabs Bronski in the chest and kicks him to the floor. The Green Beret moves over to you, staring at you with his emotionless orange eyes. \n\n\nYou die in a cold place, where no one will ever find you. ", "action_results": []}]}]}]}]}]}]}]}, {"action": "Go see the Lieutenant", "result": "Bronski sighs, and looks at the other Marines. \"Sorry, but duty calls,\" he says as pushes in his chair. \n\n\n\"Fucking killjoy!\" yells one of the privates, who doesn't hesitate to give you the finger. You ignore him and exit the barracks with Bronski. \n\n\n\"Interesting lot you've got, Bronski.\"\n\n\n\"Yeah Johnny, it's damn conscripts, you see. Bitching and moaning the moment they got here, and raising hell if I don't keep an eye on them 24/7. We almost had to court-martial a few for fighting before you got here.\"\n\n\nBronski follows along as you head towards the officer's quarters, the only air-conditioned space in the outpost. You exchange pleasantries on the way- he beams as he talks about the letters he's received from his wife and kids at home. You stay silent about your own family.\n\n\nBronski and you go way back, as you met him at boot camp. He's a fine soldier, though a bit of wild card. He was a Sergeant like you, but was busted down to Corporal for \"public drunkenness.\" Still, you're glad here's here with you. \n\n\nYou find the Lieutenant, a young man with a perfectly creased uniform and shined boots. He snaps off a crisp salute, which you return half-heartedly. Putting down his book of military regulations, he stands to adress you. \n\n\n\"I'm Lieutenant Stauffer and I'm pleased to meet you, Sergeant Smith. Thank you for reporting to me so promptly. I've reviewed your file before your arrival and I am honored to be working with such a decorated Marine,\" he says, though he glares at Corporal Bronski as he enters. \n\n\n\"A pleasure to meet you too, Lieutenant.\" You look at him, a little suspicious. \"Lieutenant, is this your first combat assignment?\"\n\n\n\"It is, but please don't be put off by that, Sir. I've received top marks at the Naval Academy and I'm eager to learn.\" He hands a sheet of paper to you. Orders.\n\n\n\"It's lucky you came on time, Sergeant. We have to prepare for a helicopter assault tomorrow at 0430. Get your men ready. I'll inspect their equipment in four hours.\" \n\n\nBronski and you return to the barracks, uneased at your Lieutenant's inexperience. You muster your half-drunk men and begin preparing equipment, but you are pissed when you find out many can't even disassemble an M-16 rifle. Luckily, your hope is restored when you walk past a Lance Corporal with a heavily scarred face. He sits in front of you with the various parts of his M-60 machine gun spread out and oiled in record time. \n\n\n\"Your name?\"\n\n\n\"Simmons, sir, but the boys around here call me Capone,\" he says, snorting. \n\n\n\"Well, you've got here a pretty display, but can you use it?\"\n\n\n\"The Lord trains my hands for war, Sergeant.\" \n\n\nWell, at least there's one part of your platoon that ain't totally FUBAR. After somehow managing to pass the Lieutenant's inspection, your men go to bed. They seem jumpy, as for many of them it would be their first taste of the jungle. You can only hope it won't be their last. ", "action_results": [null]}]}]}