{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=7374", "context": "", "first_story_block": "     It was a hot sunny day in the City of Freeport, N.Y. The sky was almost all blue,the summer still lasted for another month. Two kids stayed outside on a swing, talking to each other about the summer.\n \n    Another kid walked up to them. They remember him as their rude Neighbor Mikey. \"What is going on with you, you wannabes!\" Mikey screamed right into the taller kid Freddy's ear. The two kids got up and ran home. Many people panic at the site of him since his father was once a murderer.\n\n     The two kids were Freddy, a very tall, but frail 12 year old. There was also a another kid named Vin. He was the youngest. Both of there parents died. No one knows how. They live with their uncaring Grandfather.\n\n    The whole block had a bunch of bad kids. 7 Kids in a so called \"Gang\" Everyone listened to them. Vin's Grandfather gave them a huge gift for their Birthday's. Vin's birthday was the next week. He knew he was getting no gift's. Vin,and Freddy's room was in the attic. It was last until Vin's birthday.\n\n   There will be a Variable for Vin's Confidence, I will also be using the score variable.", "action_results": [{"action": "Vin's Birthday", "result": "      Vin woke up in the small attic bed he had been laying in.\n\n     \"Well....Vin,\" Said his brother Freddy. \"I Think you deserve something.\"\n\n     He showed Vin a $3 cake he had ordered with the little money he got for sweating like crazy doing chores around the house.\n\n     \"Thanks,\" Vin said while he smiled at Freddy.\n\n     Then when Vin grabbed the Cake, the door downstairs came bursting down. All they heard was screaming. They also heard \"Let's Get the boy.\"\n\n     Vin screamed, but before it could come out, Freddy grabbed a pillow and put it in Vin's face.\n\n    There was a gun near them, and Freddy told Vin to use it carefully.\n\n    \"Use this with great knowledge.\" Said Freddy to Vin. \"Only when your in grave danger use it.\" \"I will be departing brother, one day we will find out about our parents\" With that Freddy left the attic, and quickly slid out the hidden door.\n\n    Vin stupidly thought the same thing, and he did what Freddy did. But he didn't know where Freddy went. He had no idea about the hidden door Freddy made.\n\n    Vin began to panic, and he wasn't sure where to go, or what to do.", "action_results": [null]}]}