{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=25338", "context": "", "first_story_block": "A picturesque scene is displayed before your tiny eyes. A family of four, including your mother, father, younger brother and yourself, sit at a table sharing a meal. Tonight you're having pasta, one of your favorites. Your little brother, Joshy, has managed to make a huge mess yet again, smothering his face and the table around him in orange pasta sauce. You tug on your mother's sleeve impatiently as she delves into yet another heated discussion with your father. \n\n\n\"Muuum, Joshy's all messy!\" you complain loudly.\n\n\nYour mother sighs and turns away from your father. \n\n\n\"Rosie, your Daddy and I are having a very important discussion. Do you think you could be a big girl and clean up after Joshy by yourself?\"\n\n\n ", "action_results": [{"action": "No way.", "result": "You sigh quietly and go back to eating your pasta. Your mother turns back to talk with your father, barely noticing that you still sit at the table, unenthusiastically turning your fork over and over. Your parents are arguing heatedly over something, you're not quite sure what. You hate it when they do this, what if they don't love each other any more? What if they decide to get a divorce, and you end up like that weird kid who sits in front of you on the school bus in the mornings? What would happen to you? Who would you stay with? \n\n\nYou know you're probably being unreasonable, but your mind can't help but to jump to the worst possible scenario. You sit there for a good ten minutes, thinking about what would happen if your parents didn't love each other anymore, when you notice that your father is standing up and yelling loudly at your mother. \n\n\n\"HONESTLY SUE-ELLEN, EVERY TIME I TRY TO HAVE A REASONABLE DISCUSSION WITH YOU, YOU TURN IT INTO AN ARGUMENT! GOD, START CRYING WHY DON'T YOU! IT'S ALWAYS MY FAULT, ISN'T IT.\"\n\n\nYour mother is indeed crying silently, shoulders heaving as she tries to hold it in. \n\n\n\"Clary, I'm not saying it's your fault. In fact, it's probably mine. Don't worry about it, I'll just do it myself if you won't help.\" she sniffs, attempting to remain somewhat dignified. ", "action_results": [{"action": "Stand up for your mother", "result": "You stand up on your chair, desperate to be heard, to be recognized as a human being rather than a little girl who just does what her parents say. \n\n\n\"Stop it Daddy! Just leave her alone!\"\n\n\nYour father, in the middle of shouting something horrible at your mother, takes a second to realize that you spoke. He turns to you slowly and your blood runs cold. What have you done? How could you be so disrespectful? He begins speaking slowly, dangerously.\n\n\n\"Rosie, this is a discussion for adults. We can handle it by ourselves, thank you. Now, why don't you go off to your room now? I'm sure there are lots of toys you can play with.\"", "action_results": [{"action": "\"Yes Daddy.\"", "result": "You decide to flee before the situation gets any worse. You took a a step too far standing up for your mother like that, you're lucky you didn't get into too much trouble. You step down from the chair meekly and run off to your room. You bury yourself under a nest of blankets and cry yourself to sleep, worrying about your parents, scared for your mother. You wish you had a different father. No one could be worse than the one you're stuck with. ", "action_results": [{"action": "You wake up in the middle of the night", "result": "You blink rapidly in the thick darkness, stretching your heavy arms. What time is it? It must be pretty late, the house seems to be completely silent. As you lay quietly in the dark, your mind flicks back to the events of last night. Rage bubbles up inside you as you picture your father's menacing face looming down at you. Why did he have to screw everything up? He always found a way to start a fight, to make your mother cry, to rip the family apart. You rub your eyes, eventually adjusting to the the lack of light. A thought came to you suddenly. He was asleep, it would be so easy to sneak into his room with a knife, you could blame it on your mother, who would ever suspect a little girl? \n\n\n ", "action_results": [{"action": "Find a knife", "result": "Your father must be stopped. If you continue living under his terrible reign, you'll go insane. Or rather, considering what you're about to do, even more insane. You giggle slightly at this thought, only to stop abruptly, knowing you have to be absolutely silent. Your laugh echoes down the hall, the only disturbance in the peaceful household. You rummage under your mattress blindly, knowing you have found what you're looking for when a sharp pain stabs your hand. Ignoring the trickle of blood staining your bed sheets, you pull out a glinting knife and grip it tightly. You resist the urge to giggle again, somehow this whole situation just seems hilarious. \n\n\nPulling a straight face, you slip out of your room and tiptoe down the hallway, careful to be completely silent. You reach your parent's door successfully, and you twist the doorknob slowly. The door isn't locked and slides open with a gentle \"creeeak\". Freezing in your spot, you wait for your parents to wake up and notice you standing there. Fortunately, they seem to be deep sleepers and don't show any signs of waking.\n\n\nEven quieter than before, you sneak around to your father's side of the bed. Look at him, sleeping soundly. How can he sleep well at night knowing he makes his family's lives miserable? You raise the knife to his neck, whispering \"I love you daddy\". Then, with a sudden jerk, you slit his neck. You underestimated how deep the cut should be, and his eyes open, panic racing through his mind. He tries to speak, yell, but all that comes out is a warm gurgle. Blood pours out of his neck alarmingly, soaking the sheets completely. Hearing him thrashing, your mother wakes up with a start. She glances at your father, then at you, realizing what had happened. She stands up shakily and walks over to you, taking the knife from your hand gently. You stand still, shocked at what you have done, until a smile spreads slowly across your face. He's gone! No one will ever ruin your family again. \n\n\nYour mother turns to you, sadness in her eyes. \n\n\n\"Good girl, Rosie.\" she whispers as she slits your neck effortlessly. \n\n\n \n\nYou got the 'True' ending. ", "action_results": []}, {"action": "Grab a glass of water and calm down", "result": "You dismiss the thought instantly. You really must be tired, why else would you think of something so twisted? You sigh quietly and slip out of bed, heading for the kitchen. Perhaps a glass of water would help to calm you down. Your feet pad down the hall gently until you reach the living room. Your hand fumbles in the dark, searching for the light switch. You flip it quickly, and close your eyes against the blinding light. When you open your eyes again, you can't help but to scream. Sitting in his highchair is Joshy, but his petite body is missing a head. Blood is splattered all over the wall behind his body, chunks of flesh litter the floor around his chair. Bile rises in the back of your throat, but you force yourself not to vomit. You breathe in deeply, trying to calm yourself down. It works for about ten seconds, until the image of Joshy's pale body slumped in his chair flashes in your mind. Your father must have done this. You know you should get out of there, but what about your mother? What if he's gone after her?", "action_results": [{"action": "Call the police", "result": "\"Hello, 000 here. Please state your emergency.\"\n\n\n\"M-my little brother is dead. I think my Daddy did it.\"\n\n\n\"Alright, can you tell me where you live?\"\n\n\n\"Th-thirty nine Lorrie Avenue. In Freshwater.\"\n\n\n\"Okay honey. We have an ambulance and police on the way. Stay calm, move out of the house. Is there a neighbor's house that you can go to?\"\n\n\n\"N-no. We-we just moved in here. I don't know anyone.\"\n\n\n\"Okay then. Honey I'm gonna need you to get out of the house, alright? Is your Daddy still asleep?\"\n\n\n\"Yeah, I-I think so.\"\n\n\n\"Good. Alright now stay calm, are you out of the house yet?\"\n\n\n\"Mm-hmm.\"\n\n\n\"Alright. Do you have any brothers or sisters living in the house?\"\n\n\n\"Well, I-I had J-Joshy...\"\n\n\n*inaudible sobs*\n\n\n\"Okay sweetie, it's gonna be alright.\"\n\n\n\"WHAT THE FUCK ARE YOU DOING?\"\n\n\n*phone line goes dead*\n\n\n \n\nWhen the police arrive at your house, they find your body slumped over the kitchen table, your head blasted to pieces. Your mother was found lying in her bed, throat slit. \n\n\n \n\nYou got the 'Trigger Happy' ending. ", "action_results": [{"action": "Restart", "result": "A picturesque scene is displayed before your tiny eyes. A family of four, including your mother, father, younger brother and yourself, sit at a table sharing a meal. Tonight you're having pasta, one of your favorites. Your little brother, Joshy, has managed to make a huge mess yet again, smothering his face and the table around him in orange pasta sauce. You tug on your mother's sleeve impatiently as she delves into yet another heated discussion with your father. \n\n\n\"Muuum, Joshy's all messy!\" you complain loudly.\n\n\nYour mother sighs and turns away from your father. \n\n\n\"Rosie, your Daddy and I are having a very important discussion. Do you think you could be a big girl and clean up after Joshy by yourself?\"\n\n\n ", "action_results": [null, {"action": "Sure!", "result": "You nod your head rapidly, eager to prove yourself as a 'big girl'. You stand up from your place at the table and skip into the kitchen, grabbing a towel from the rack and wetting it under the tap. Holding the towel carefully so it doesn't drip on the floor, you walk over to your little bother, bouncing in his highchair. He giggles and squirms as you wipe his face gently, eventually removing most of the pasta sauce. You begin to clean the table with the cloth, when your father jumps up suddenly. \n\n\n\"ROSE! WHAT ARE YOU DOING?\" he yells at you, face beginning to turn red.\n\n\nYou stand there, shocked, dirty towel in hand. What had you done wrong? A sinking feeling began in the pit of your stomach.\n\n\n\"I ASKED YOU A QUESTION, ROSE! DON'T YOU DISOBEY ME!\"\n\n\nYour brown eyes widen and you manage to choke out an answer. \n\n\n\"I... I was just cleaning up Joshy... Mummy told me to-\"\n\n\n\"I DON'T BLOODY CARE WHAT 'MUMMY' TOLD YOU! DON'T YOU EVER THINK FOR YOURSELF? THOSE ARE THE GOOD TOWELS ROSE! LOOK, YOU'VE COMPLETELY RUINED THEM!\"\n\n\nYou stand there, still bewildered by your father's sudden anger. You don't like it when people shout, and you: ", "action_results": [{"action": "Cross your arms stubbornly.", "result": "\"It's just a towel Daddy, I think it will be okay. I was just trying to be helpful, anyway.\"\n\n\nYour father glowers at you and sighs loudly, apparently leaving it there for now. He stalks outside, swearing under his breath, and slams the door powerfully behind him. Your mother, who had been eating her food quietly, finally speaks up. \n\n\n\"Rosie, sweetie, I'll take it from here. It's alright darling, Daddy's just a bit stressed at the moment.\" \n\n\nYou stare at the floor, thoughts only of how mad you were at your father. Why did he get to be the boss? Why couldn't mummy do it? Daddy was never fair to you, he probably didn't even love you. Frustrated at how powerless you are, you stalk off to your bedroom and scream into your pillow. ", "action_results": [null, null]}, {"action": "Begin to cry.", "result": "Your bottom lip begins to tremble, your brown eyes grow wide. This seems to happen quite regularly, you're not very good with intense situations. Your Daddy is so much bigger than you, and so scary... He watches you impassively as the tears spill down your cheeks, apparently not caring that he's hurt your feelings. Slightly embarrassed, and mostly overwhelmed, you run off to your room as fast as you can. Your father, not done with chewing you out, follows you purposefully. As he approaches you, you take action and:", "action_results": [{"action": "Slam the door angrily", "result": "After several hours of tossing and turning, burning anger for your father consuming your thoughts, you have a sudden idea. He has to be stopped. You can't go on like this, living in constant fear. You don't know how far he will go, what measures he will take to get his own twisted way. You know that your mother will never stand up to him, she is blinded by an illogical love that you fear will never fade. You have to take matters into your own hands, and you have to take action now. The whole house is asleep, this might be your only chance to make sure he never causes anyone harm ever again. \n\n\n ", "action_results": [null]}, {"action": "Hide under the covers", "result": "You dive into your bed, pulling the covers over your trembling body. You've made a mistake a very big, very dangerous mistake. You tremble violently as you hear heavy footsteps approaching your door. The sound ceases abruptly, and you let yourself relax for a few seconds before the covers are ripped from your timid grasp. Your father's firm hand connects with your side, and you howl in pain. He beats you over and over as you lie there, a sniveling mess. When he eventually leaves, you sob into your pillow for several hours before coming to your senses. You're not hurt. You're mad. \n\n\n ", "action_results": [null]}]}]}]}]}, {"action": "Check on your mother", "result": "You manage to tear your wide eyes from your little brother's corpse. You have to check on your mother! She might be in danger! Sprinting down the hallway, you slam open the door to your parent's room and skid to a halt. Your mother's lifeless corpse hangs over the side of the bed, her skin turned pale and waxy. Your father, however, is still very much alive. His huge figure is positioned above your dead mother, eyes closed in ecstasy as he thrusts into her repeatedly. You squeeze your eyes closed  and back away from the door, trying to escape unnoticed. Just as you think you made it, your father's eyes snap open and his vision focuses on you. His mouth curls into a sinister grin and he is upon you in a flash. You scream as loudly as you can, desperate to get away from this madman. It's no use though, he is far stronger than you. He rips off your warm pajamas, moaning at the sight of your shivering naked body. \n\n\n\"You have no idea how long I've waited for this Rosie.\" he sneers at you. \n\n\nYou have no idea how long it goes on for, endless screams punctuated by surprised moans of pleasure. \n\n\n \n\nYou got the 'Necrophiliac' ending. ", "action_results": [null]}]}]}, {"action": "Somehow, you sleep through the night", "result": "As you grow older, your parents fight more and more often. Your father hates you, he gets mad at you for the smallest things. You grow up, trapped with the monster that is your father. You try to explain to your mother how you feel, but she dismisses it as the ramblings of a child. How could anyone be so blind? How could she stand to live with such a horrible man? \n\n\nYour father pushes you, hits you, your body is covered in bruises and cuts that are written off as the normal injuries of an adventurous child. All because you could never stand up to him. He is so much bigger, stronger, aggressive. You sneak around the house, trying not to trigger the switch, to make him explode. Whenever you can, you spend time away from the house, hanging out with friends and", "action_results": [{"action": "Talking about your feelings.", "result": "Somehow, you find yourself hanging out with the depressed kids. You know you can always confide in your friends, you can tell them anything. They know all about your living situation, but you don't talk about it much since they have their own problems. You talk with them, letting them tell you about all their issues, all the reasons they hate themselves. You try to be happy around them, try to lift their spirits, but it's different when you're alone, left with your demons.\n\n\nSometimes, it becomes too much. \n\n\nYour mother finds you in your room, hanging from the ceiling fan. The arms you kept covered with long sleeves exposed, revealing hundreds of deep cuts. A pool of crimson blood stains the carpet, leaking from the most recent gashes in your wrists. Written on a piece of paper under your swaying body, a message reads:\n\n\nThe demons were planning, they knew what was to come\n\n\nThey knew I was tired, then knew I was done.\n\n\nI know I was weak, crazy, insane.\n\n\nBut the darkness was calling, and it knew my name.\n\n\nI’m sorry I was stupid, and ugly and fat,\n\n\nI know you thought I was better than that.\n\n\nWhen I said good bye, you didn’t think twice\n\n\nI’m sorry for what has been\n\n\n               a waste\n\n\n                    of a life\n\n\n              I love you daddy. Sorry for the mess. \n\n\n \n\nYou got the 'It's my fault' ending", "action_results": [null]}, {"action": "Drinking away the pain.", "result": "Heavy eyeliner, piercings in unmentionable places, secret tattoos. Hating life has never been so fun. You spend your time with your older friends, getting drunk at parties and fucking cute boys (and girls).  Heavy metal becomes the key to your soul, it's so loud that it drowns out the voices in your head. Most of the time you're either high or drunk, living in a strange blur of color and sound. It's blissful, really, drowning out the world. You become a legend among your friends, known for being absolutely insane. 20 shots of vodka? Sure. Pills you bought from a stranger in the dark? Yep. Gang bang with some guys you met on the street? Absolutely. \n\n\nOne particular night, you drink a whole bottle of cherry vodka as part of a dare. You feel great, your alcohol tolerance is pretty high by now. After you finish having sex with a few lonely guys, you decide to head home for the night. Or rather, head to a friend's place to crash until you're mildly sober. Heading out the back of the party, you jump over a fence clumsily and stagger down an alleyway, high heels clicking on the cool pavement. Your mind struggles to understand what is happening as the silhouette of a strange man appears at the edge of your blurry vision. The man walks right up to you as you wobble unsteadily, and it isn't until he presses it to your neck that you notice his knife. He orders you to strip, and you spend the next 30 minutes making him moan with pleasure. Just as you finish up, on your knees before him, he cums violently. His arm jerks up, still holding the knife, and he slits your neck cleanly. \n\n\nYour body lies in the street for a few days, a stinking pile of blood and cum, before a street cleaner finds you. Your body is identified easily by your tattoos, but your parents never come to the police station. No one really cared that you died. \n\n\n \n\nYou got the 'Fuck You' ending", "action_results": [null]}]}]}, {"action": "\"I don't want to.\"", "result": "You shake your head slowly, shocking yourself with your own bravery. You are openly disobeying your father now, and you know that there will be consequences. First, however, you need to have your say. \n\n\n\"Just because you're stronger doesn't mean you get to be the boss, Daddy! Mummy and I can do whatever we want!\"\n\n\nYour father growls at you, spittle flying from his bared teeth. \n\n\n\"That's where you're wrong, Rosie. I am the boss. And I always will be.\"\n\n\nHe reaches over and grabs you by the collar, lifting you down from your chair roughly. \n\n\n\"Now, Rosie, off to bed now, before I get mad.\"\n\n\nYou shake your head stubbornly and stamp your foot on the ground. \n\n\n\"You're not the boss of me! Is he Mummy?\"\n\n\nYou look to your mother for reinforcement, but she stares almost absentmindedly out of a window and completely ignores the situation at hand. Your father's face is growing red, you are pushing harder than you ever have before. \n\n\n\"I'm going to count to three, Rosie. One...\"\n\n\nYou stamp your foot.\n\n\n\"Two...\"\n\n\nStanding your ground, you stare stonily at a patch on the wall and refuse to budge.\n\n\n\"Three.\"\n\n\nWith a sudden roar, your father lunges at you and you give a surprised 'squeak' as he grabs your forearm tightly. More due to the fact that you have committed to defying him than actual logic, you dig your feet into the ground and scream as loudly as you can.You will not go to your room. Your father ignores your display of defense completely and drags you across the ground. As you struggle to your feet, attempting to twist away, he slams you into a wall and continues to pull your tiny body down the hallway. Screaming and wriggling madly, now fearing for your life, you resist him with all of your strength. Your father continues walking as if he doesn't even notice you, as if you weigh nothing at all. When he reaches your room, he picks you up by the back of your shirt and dumps you on the floor. A good kick leaves you sobbing uncontrollably, a weeping and snotty mess. \n\n\n ", "action_results": [null]}]}, {"action": "Go to bed", "result": "You slink off from the table and collapse onto your bed. Why do mummy and daddy have to fight? Why can't they just be happy and love each other? You know that you have no place to judge, you're just a little girl. But as you lay in bed that night, you decide that when you're older, you are never going to marry someone unless you know you love them. No one should have to go through the same as you, uncertain about their future in a loving family. ", "action_results": [null]}]}]}