{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=53243", "context": "", "first_story_block": "You haven't even made it through the first day of first grade, and you already have serious decisions to make about your future.\n\nTo the left is the girl's bathroom. And to the right is the boy's bathroom.\n\nYou stand between the two entryways stuck on the fence of a colossal tipping point in your life. Stupidly, you pick your nose while lost in thought.\n\nThe obvious solution to this puzzle would be to just go into the boy's room. You are a boy after all. You've got a dinky and everything. But... isn't it kind of gay to go into the same bathroom as a bunch of other guys? Now, if you went into the girl's bathroom, that wouldn't be gay at all.", "action_results": [{"action": "Enter the boy's bathroom", "result": "You decide you should use the boy's bathroom since you have a dinky, and the boy's bathroom has special wall toilets specifically designed for people with a dinky.\n\nYou step inside and the overwhelming and unmistakable stink of fresh poop wafts through the air. From the confines of one of the stalls, you hear sobbing, blubbering, and sniffling. You've successfully identified the source of the stink.\n\nWith all the bravado and indecency of a small child, you waltz up to the stink stall and knock on the door.\n\n\"Hey, who's in there? You stink. Did you poop your pants? Can I see?\"\n\n\"B-Billy, is that you?\" says the stink boy. \"Can you ask the nurse to call my parents?\"\n\n\"Is that you Ed? Sorry buddy. I can't do that until I get some kind of compensation for my services.\"\n\n\"What's compensation?\" asks stink boy through a sniffle that triggers a fart and a splash.\n\n\"Something you give me in return for me doing something for you.\"\n\n\"Oh... uh, what do you want?\"", "action_results": [{"action": "Ask for all of stink boy's lunch money", "result": "\"I want all of your lunch money.\"\n\n\"But it's only Monday! I won't be able to eat lunch until next week!\" Stink boy farts again and another splash rings through the boy's bathroom. \"I'll give you two days worth. Deal?\"\n\n\"Ed, you're in no position to be making demands. In fact, I think I'm just going to go tell everyone that you pooped your pants. I'm sure that'll make a great first impression.\"\n\n\"Stop!\"\n\n\"Yeah, that's what I thought.\"\n\nAfter some squirming and more than a little sloshing, Ed slides his lunch money to you from under the stall door. It stinks of poop. But you wash it off and hide it in your sock before heading off to the nurse's office.\n\n\"Are you okay?\" the nurse asks. She's awfully pretty, a blonde bombshell straight out of one of your step-dad's gentleman's magazines. \"Where do you hurt?\"\n\nYou point to your chest. \"In my heart Miss because I'm afraid I'll never see another woman half as beautiful as you... Oh, and Ed Hunter pooped his pants. He's cowering in his own stink in the boy's bathroom. I think he wants his mom to bring him clean clothes.\"\n\nThe nurse flushes crimson before stammering about how she'll call right away. You shrug, smile, and head back to class.", "action_results": [{"action": "After school", "result": "The school day comes and goes, and you feel marginally less stupid than you did this morning. Although, you can't say for sure that it was because of anything your teacher did or said.\n\nBut as you lie in bed at night, trying to get some glorious sleep, the sound of a furiously creaking bed keeps you awake. It seems your step-dad has decided that tonight is another great night to pound your mother's vagina into oblivion. According to Grandma Coker, you shouldn't know about that sort of thing yet, but you kind of think everyone else is stupid for not knowing. Isn't knowledge supposed to be power?\n\nSometimes you swear that your step-dad tries to make as much noise as possible to purposely make sure you hear him giving it to your mother. Anyway, you know you're not going to be getting any sleep anytime soon, so you decide you may as well sneak out and entertain yourself.\n\nGetting out of the house proves boringly simple due to all the noise your step-dad is making. The only question left is, where to go?", "action_results": [{"action": "Play a prank", "result": "You head down the street and make your way toward your Sunday School teacher's house. She's a crabby old bitch and smells rotting cabbage. When you asked her how the Virgin Mary could have a baby if she didn't have a dinky stuck inside of her, she bent you over her knee and fanned your ass for being a \"naughty and insubordinate child with a filthy mouth.\"\n\nWell, tonight you're going to fix her cantankerous old bunions with a little home-brewed medicine.\n\nThe lights in her house are all off, even though it's not even 9:00 P.M. yet. Pulling this prank off is going to be even easier than you thought.", "action_results": [{"action": "Shit in her mailbox", "result": "You drop your drawers and force out a nice turd. Several kernels of corn stand out beautifully in the brown excrement. You feel more than a little proud at having dropped such a healthy look deuce.\n\nUnwilling to soil your hands with filth, you snatch a few leaves from nearby trees and use them to pick up the turd and stuff it inside the mailbox.\n\nYou have to pinch yourself to keep from laughing. When the deed is done, you head home, more than a little pleased with yourself. As your Sunday School teacher will no doubt soon find out, you should never bullshit a child with the malice of a pit bull and the shit of a mad bull.", "action_results": [{"action": "Two years later . . .", "result": "It's the Sunday before the first day of third grade, and your step-dad drops you off at church so he can go down to the pub and shoot some pool. He tells you to say a prayer for your mom, who's currently in the hospital, recovering from a ruptured sphincter, then takes off.\n\nWith nothing better to do, you decide to go to the Sunday School program. Jesus is just as an important part of the trinity as Aphrodite and Dionysus.", "action_results": [{"action": "Sunday School", "result": "Your Sunday School teacher gives a lecture about the virtues of honesty and how confessing your sins and accepting Jesus into your heart will earn you a place in heaven.\n\nThis makes sense to you. High moral fiber probably builds a sturdy character, just as a high fiber diet builds sturdy poops.\n\nPolitely, you raise your hand.\n\n\"Yes, Billy?\" The Sunday School teacher asks.\n\n\"I have a confession to make, Miss Beaver. I was the person who took a poop in your mailbox two years ago.\"\n\nThe class bursts into a cacophony of gasps and laughter.\n\nMiss Beaver tries to conceal her humiliation and fury, and for the most part, she does a great job. But she has a tell. When Miss Beaver gets angry, she gets really gassy. The smell is actually more pleasant than her typical aroma of rotting cabbage.\n\n\"I'm very proud of you, Billy. It's never hard telling the truth. But Jesus is very happy with you. Everyone else, we're done for the day. Head down to the cafeteria for some milk and cookies. Billy, can you wait a moment? I have something I want to give you.\"\n\nMiss Beaver gushes some more about how great you are for telling the truth. She says she has something stored away in the back of the church that only good little boys get to play with.\n\nOf course, you don't buy this bullshit at all, especially when she starts unlocking doors and leads you to an old storage room that doesn't look like it's been used in years... except there is definitely a trail of ruffled dust heading back toward an old confessional box.", "action_results": [{"action": "Snatch a letter opener off a nearby desk", "result": "You snatch a letter opener off a nearby desk and hide it in your pocket.\n\n\"It's just inside this box,\" says Miss Beaver, pointing to the confessional.\n\nYou pretend to have trouble opening the handle. \"I think it's stuck. Can you open it for me?\"\n\n\"Certainly, Billy.\"\n\nMiss Beaver opens the door, and you rush inside, stabbing and slashing wildly with the letter opener. The metallic scent of blood flows into the air. You have stabbed a naked deacon for critical damage!\n\nYou spin on your heels and leap at Miss Beaver in a wild frenzy. The old hag topples to the floor, and her hip shatters with a thunderous crack! Your letter opener glides into her eyes and carves out her throat, though the latter takes much more effort.\n\nThe naked deacon staggers from the confessional, bleeding from numerous puncture wounds and cradling his nearly completely severed dinky.\n\nYou stand over him as he collapses to the floor. Feeling accomplished and satisfied with your personal safety, you calm yourself using advanced meditation techniques you've practiced over the years to help you sleep while your step-dad has sex with your mom.\n\n\"I think you're going to hell, sir,\" you say ever-so-politely as the deacon withers and heaves his last dying breaths.\n\nYou report the incident to police afterwards, and in a matter of days, top government agents escort you away to a secret facility to run diagnostic tests on you, suspecting you have exceptionally advanced mental capacity for a child your age.\n\nUnfortunately for them, they awaken your true nature.", "action_results": []}, {"action": "Run away", "result": "You turn tail and book it out of the church. Good thing Miss Beaver didn't lock the doors behind you.\n\nYour heart is hammering in your chest by the time you get to the police station, and you start telling them everything that happened. They listen intently. Although one officer struggled to conceal a chuckle when you told the part about pooping in Miss Beaver's mailbox two years ago. But when you relay the latest part of your adventures, they grow gravely serious.\n\nOne of the officer's brings you a doll. \"Did anyone touch you anywhere? If they did, show me on the doll.\"\n\nYou lie and say Miss Beaver massaged and licked your dinky and marbles, figuring that one truth is probably equal in weight to one lie. While you don't know for sure what would have happened, you didn't smell rotting cabbage, so you know it was going to be something bad.\n\nThe police go and arrest Miss Beaver.\n\nThe local magistrate holds a speedy trial, and you have to testify. But you just repeat the same lie you told police every time they asked before and Miss Beaver goes to prison. Several church goers saw Miss Beaver leading you away, and the entire class testified how she had you wait for her after dismissing everyone else.\n\nMiss Beaver tried to blame the deacon, but no one believed her.\n\nAfter the trial, your step-dad pats you on the back and tells your mom not to cry. He treats you both to ice cream and smiles to himself as he talks about how the church is going to owe you so much money in the civil suit.\n\nYour step-dad stops being such a dick afterwards, pleased with the finer things in life. And the rest of your childhood devolves back into a humdrum of normality. But with lots of money.", "action_results": []}]}]}]}, {"action": "Fill her gas tank up with water from the hose", "result": "You uncoil the hose and stick it into the gas tank. Grinning like a mischievous little jackass, you turn the water on and fill the tank all the way up. You turn the water off and coil up the hose just as it had been when you arrived.\n\nFor a little added fun, you pee on the handle of the water spigot before stealing off into the night. With the task done, hopefully your step-dad will be done pounding your mother by the time you get home.", "action_results": [null]}]}, {"action": "Go to the cinema", "result": "You're able to get to the cinema before 9 o'clock, so you have a couple options to choose from out of the later showings. There's a monster flick, a comedy, and a war movie. You're not sure which looks best.\n\nAs you're trying to make up your mind on what to watch with Ed Hunter's lunch money, you overhear a couple of teenagers as they exit the theater.\n\n\"Yeah, my cousin is the bouncer at The Fox Trot,\" says a stereotypical looking greaser. \"He said he can get us in tonight. We just have to tip like anyone else, and we'll be good.\"\n\n\"Don't worry, Frank. We loaded up on singles. It's going to be a good time.\"\n\nYou watch them head down the street toward the strip club. You know what a strip club is because your step-dad used to make you sit in the entryway and wait for him on Tuesday afternoons. Kids aren't even supposed to be in the entryway, but your step-dad always knew how to grease a doorman.\n\nMaybe you could do that too. You peaked in on the inner workings a few times, but you never got a really good look before.", "action_results": [{"action": "Watch some stupid movie", "result": "You decide to just watch some stupid movie. When you enter the theater to take your seat, you hear the familiar sound of rutting coming from the top of the seats. Some blonde girl is riding some guy like a mild mustang.\n\n\"Hello,\" you say loudly, waving. You put on a big stupid grin. \"I'll forget what I saw for a price.\"\n\n\"Oh shit!\" The blonde hops off the guy and pulls her shirt back down over her breasts. \"I told you this was a stupid idea, Johnny!\"\n\n\"Please, you told me this one wasn't playing anything else tonight!\"\n\n\"Fuck you Johnny! Don't put this shit on me!\"\n\n\"Yes, that's why your going to pay me to keep my mouth shut,\" you say, politely interrupting their verbal dispute. \"I'm sure we can come to a mutually acceptable solution.\"\n\n\"How about I don't kick your ass? Good starting point?\" Johnny starts walking toward you.\n\nYou immediately strip your clothes and jog backwards towards the exit, speaking calmly. \"All I have to do is start screaming. How do you think this is going to look? Now, I know you don't want to go to prison for inappropriately touch a sweet young boy, so I know you're going to do the smart thing and leave your wallet and the Lady's underwear on that seat and leave without a fuss.\"\n\nJohnny stops right in his tracks. Something about your relaxed demeanor scares the ever living shit out of him. Either that or your honeyed words soothed his evil heart. You're not quite sure. Regardless, you enjoy the movie with a big strawberry shake and a popcorn thanks to Johnny's generous contributions. And of course, you have a nice pair of freshly worn lady's underwear to bring a beautiful aromatic sensation to the experience.", "action_results": [null]}, {"action": "Go to the Fox Trot", "result": "You follow the teenagers to the Fox Trot. After the bouncer lets them in. You walk up the door with a pleasant smile and a smooth swagger.\n\n\"What're you doing, kid?\" the bouncer asks. \"This isn't a place for you... wait, oh, you're Larry's step-kid. What're you doing out here?\"\n\n\"I'm going to patronize this establishment, sir.\"\n\nThe bouncer laughs. \"I don't think so kid. Go home.\"\n\n\"I must politely protest, good sir. You see, I am quite aware that you illegally allowed those teenagers to enter this establishment. The police station is only one block from here. It's a small town. Teenagers aren't very good at keeping secrets, especially when they think they're going to get in trouble. Do you think they'll be able to get far enough away before the police find them?\"\n\nThe bouncer stares at you for a good moment. Finally he says, \"How... how old are you again?\"\n\n\"Old enough to know how to grease a door.\" You hand the bouncer half of Ed Hunter's lunch money, and head inside the Fox Trot to donate the other half to the less reputable ladies of town.", "action_results": [null]}]}]}]}, {"action": "Ask for a wallet photo of stink boy's fifth grade sister", "result": "\"I want your wallet photo of your sister. The pretty fifth grader. Not the land whale in third grade.\"\n\n\"Don't talk about my sister like that!\" Stink boy jumps to his feet and you hear the sloshing of a river of poop in his pants, which causes him to sink back to the toilet seat. A small trickle of liquid brown spills out from under the stall door.\n\n\"Okay, I'll just talk to the whole class about how you just pooped your pants.\" You walk over to the sink and grab some paper towels. \"Here, I'll even clean up the evidence out here so you can hide until your mom comes, but it's the photo or no deal.\n\n\"Fine take it!\"\n\nStink boy sloshes a little more brown liquid out as he rummages through his wallet for the photo. He hands it to you underneath the stall door and you clean up his filth on the tiles.\n\nThe photo doesn't have any poop on it, but it sure smells like poop. You kiss it anyway, obsessed with the beauty of Muffy Hunter's thick black hair.\n\nOn your way to the nurse's office, you walk straight into the principal and fall on your butt. Maybe you shouldn't have been staring at Muffy's photo while walking down the hall.\n\n\"Are you okay?\" the principal asks.\n\n\"Yes, sir. Sorry, sir.\"\n\n\"Well, be more careful. What were you gawking at anyway?\"\n\n\"Sir, I have something to tell you! Ed Hunter pooped himself and he's hiding in the bathroom until someone calls his mom to bring clean clothes.\"\n\nThe principal shakes his head. \"Larry isn't going to be happy about this... thanks for telling me. I'll go call his mother and get the janitor down there.\"\n\nBack in your class, you see Larry the janitor scowling as he walks past the door heading toward the bathrooms.", "action_results": [null]}]}, {"action": "Enter the girl's bathroom", "result": "You decide that it's incredibly gay using the same bathroom as a bunch of other boys, so you head into the girl's bathroom instead.\n\nThe inside looks and smells just like any other bathroom, more or less, except the girl's bathroom doesn't have any wall toilets. But you already knew that.\n\nA toilet flushes and Hillary Blue steps out of one of the stalls. She stares at you. And you stare at her.\n\n\"Billy Dick Coker, what are you doing in this bathroom!\" Hillary Blue thrusts her hand on her hips and glares at you, even more intensely than before.\n\nYou shrug. \"I don't know really. I have to pee, but I don't want to be gay and use the same bathroom as a bunch of boys. But you don't have any wall toilets in here, and sitting to pee is for women and gays.\"\n\n\"Well, why don't you just stand in front of the normal toilets and pee?\"\n\n\"Nah.\"\n\nYou whip out your dinky and begin to pee into one of the sinks.\n\n\"Billy...\" says Hillary Blue, \"you're both the bravest and most disgusting boy I've ever met. Do you want to be my boyfriend?\"", "action_results": [{"action": "Absolutely", "result": "\"Absolutely.\"\n\nYou shake the pee droplets from your dinky and run over to Hillary Blue and kiss her on the lips without even bothering to put your dinky away. She kisses you back.\n\n\"That's what I like about you, Billy. You're wild and unpredictable.\"\n\nYou beam as you put your dinky back in your pants. \"If you liked that...\" You smack Hillary Blue on the butt with an open palm. She squeals. \"My step-dad does that to my mom all the time, especially when they think I'm not around. She really likes it. Did you like it?\"\n\nHillary Blue chews on her lip. \"I'm not sure. I think so. Do it again.\"\n\nYou oblige.\n\nHillary Blue shrugs. \"It's not the same when I know it's coming. Maybe we'll figure it out later.\"\n\nAnd with that, you and Hillary Blue head back to class, holding hands.", "action_results": [null]}, {"action": "Will you pay me?", "result": "\"Will you pay me?\"\n\nHillary Blue stares at you. Blankly at first, but you can see her brow beginning to furrow. \"To be your girlfriend?\"\n\n\"Yeah.\"\n\nHillary Blue pushes you to the tile floor and storms past. \"Humpth! I didn't want to be your girlfriend anyway Billy, you deplorable swine!\"\n\nYou sit on the floor for a few minutes, wondering what you did wrong. You really wish she hadn't pushed you when you had your dinky out because the pee droplets got on your shirt.\n\nOh well, you can always blame it on... cooties from touching a girl? Nah, that'd be implying that you're into boys, and that would be gay.\n\nYou head back to class, having made up your mind that if anyone says anything you'll just say that you're working on your aim. Now, you have more important questions to ponder.", "action_results": [null]}]}]}