{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=7965", "context": "", "first_story_block": "As a child, I was always told, Everygood story has a beginning, Well this is my beginning, alteast... I think so... It's so hard to tell now.\n\n \n \n \n*** Note in this story I encourage you to either play thru more then once or Press the Go back Button, Mainley because you will either die alot, Or miss out on some of the funnier/ more serious aspects.***\n\nThis is my first story, be kind in your ratings.", "action_results": [{"action": "The Story", "result": "Well, anyway here is how it happened, I was one day, Sitting around the the t.v. With my wife, when we saw this well... Leak in the uhm... Walls... Everyone thought we were insane! but to be honest I was a little to sure it was a real ghost ... Considering I am a ghost hunter for a profession it was kind of weird to never see one, and I thought this was gonna be my big moment. Well after a few weeks more things started to happen, My wife went to go live with her sister... I was sad about this but I knew it was for the best, the weak minded are always seeking to leave a situation they don't understand.", "action_results": [{"action": "Choices...Choices...", "result": "So I had to come up with a game plan, I mean Really... How could  a ghost hunter go into this and not think WOW!!! A REAL GHOST!! well My initial plan was to....", "action_results": [{"action": "Search the house.", "result": "I began A thourough search of the house, starting in the most obvious place... the Basement, Well as I made my way thru the tricky steps and the WEAVING catacombs of junk, I found what looked like a splatter of blood dripping from a pipe, that to be honest I never even seen before, and when we bought the house me and the wife hired a plumber to attempt to teach us how to fix the plumbing on our own as long as we called him in for monthly inspections... I came out of it more confused then ever, But I did spend enough time looking at all the damn pipes and nodding my head to know them all like the back of my hand. It was at that time that I decided to...", "action_results": [{"action": "Unscrew the Pipe", "result": "I began to unscrew the pipe... and well.. let me tell you something theres a reason Plumbers turn off the water before they start there work... Probally so they don't get a wrench stuck in there head... so uhm yeah... I forgot to turn the water off... Heaven isn't so bad though... Atleast I get all the drugs I want... Nothing to make you forget whats going on like a little acid.", "action_results": []}, {"action": "Leave it alone, Who knows what it is...", "result": "Unfortunantly for me, In horror movies they never just LEAVE IT ALONE the fact that I know have a length of pipe in my head is probally enough of a reason why they don't. Atleast I got a laugh when the cops tried to rule it suicide... It just sucks they never found the killer... alteast thats what I told everyone in heaven... People there still don't believe in ghosts.... Jeeze do you gotta have one slap a guy?", "action_results": []}, {"action": "Knock on it a bit.", "result": "I tapped the pipe a few times, and didn't quite get the reaction I wanted... Instead of nothing other then say a bit of blood on my hands... I heard a knock greet me back... Finishing my already started Rythm... (You know the one, The one you could even do in a crowded store and some one will STILL finish it.) I was honestly a bit freaked out but I decided to...", "action_results": [{"action": "Yell Hello", "result": "I screamed hello at the top of my lungs, and was met with SHUT UP!!!! I'M BUSY!!! I literally pissed myself.. I mean come on how often does your basement yell at you to shut up... Then, From the dark arose a small figure... about the size of a small dog on it's hind legs. he came walking out, he was covered in fur and had the snout of a pig... and the unmistakeable smell of my favorite wine... Coincidently the first thing I said to him was. HEY!!!! YOUR THE ASS THAT WAS STEALING MY WINE!!! Then before he could react I said...", "action_results": [{"action": "Uhm... Who the fuck are you?", "result": "It blinked a few times Like I just said something extremely rude and said..\" Well first off I'm a pig demon... and secondly I ain't no ass... Oh and my name is beezlebub...\" Ok... This was it... I was about to meet the devil... or In other words I was just about to  but before I got to tell him my name he farted in my general direction and walked off...", "action_results": [{"action": "I gave chase... I mean come on...", "result": "I started to run after him, Yelling HEY YOU ... BEEZLE BUB!! ARE YOU THE DEVIL!!!!... He stopped turned around and smiled, from his teeth leeked roaches and centipedes, and to be honest I could smell his breath from here. \" OH!!! SO YOU HEARD OF ME!!!\" He seemed overly happy and ran up to me smiling and jumping around like a child in a candy store... \" So uh... YEAH THATS ME!!! Uhm... whats up!! i mean uh Hi... How did you hear of me? Was it cool stuff was I like slaying children...\" I kind of droned out for the rest of his babble and he stopped... Looked at me for a bit and then smiled again. \"  I mean uh... yes It is I what is it you require mortal.\"", "action_results": [{"action": "Arn't I like supposed to make a deal with you for my soul?", "result": "He Smiles once again \"yes.. Mortal... the deal is you Let me take your soul, Or I kill you!\" It would have been nice of him to tell me they were the same thing... So now here I sit in hell Listening to him babble on about all the bad things he did to people and the time he met jesus...", "action_results": []}, {"action": "Tell me what the fuck your doing in here", "result": "He frowned this time.. somehow this was a little bit more jolly looking then his actual smile \"uhm.. Just passing thru Oh yeah... don't mind anything of the weird things happening in your house... This happens everytime I Pass thru someones basement..\" He snapped his fingers and smiled... His smile was the last thing I saw before I blacked out...\n\nI woke up a few hours later and my wife was hovering over me crying and looking obviously worried, Turns out She had tried to call me during the 12 hours I was out, Got worried and drove all the way back to check on me...  She didn't believe my story, and just assumed I was delusional, we all tried to pretend it never happened, but sometimes the wall... Still gets a little wet on hot summer days...", "action_results": []}]}]}, {"action": "BATTLE CRY!!!!!", "result": "I let loose a viscious battle cry of... well nothing else other then BATTLE CRY!!! And punched at his face... Before I could I soon found  a hoove inside of my head... and well... Let me tell you something, You don't go attacking random walking pigs in your basement because chances are you arn't going to heaven... So uhm... While in hell I have to tell this story to as many people as I can before Each night, and if I don't meet or beat my previous quota Satan comes and well... Does some rather nasty things with his leg and a bottle of vaseline... alteast I hope it's his leg....", "action_results": []}]}]}]}, {"action": "Examine the wall.", "result": "I decided the best thing to do would be hell.. Look at the wall a bit, I mean come on, if you have leaking walls then you look at the wall! Well I rubbed my hand across it, and felt cold, Like not oh wow this wall is cold but like... wow did it just get freezing in here? I mean come on man!!! GHOSTS!! At that point I was excited enough to shit a brick, I mean come on... Walls Leaking... Cold spots... damn... I decided the best thing to do now would be...", "action_results": [{"action": "Go to the bed room.", "result": "I made my way upstairs, and get this... before I could get all the way up the stairs the stairs closed up like a slide! I grabbed onto the railing and used them to climb up the rest of the way. That was kind of scary... I reserved my self to walking slowly the rest of the way to the bed room... I entered thru the door way and made a quick inventory of what to get...", "action_results": [{"action": "Get sheets, Pillow, Vcr, gotta keep watch on the wall.", "result": "I made my way to the Sheets and pillow began to take them off the bed, Then from behind me I heard a wisp of wind and what sounded like my wifes voice, I turned around to listen better, and then... From behind me Something grabbed me... I fell to the bed and felt the sheets began to slither into my mouth... Then... My throat... Then my stomach... and then... well.. Lets just say your stomach isn't supposed to be ripped out of you thru your mouth for a reason.. Heaven is nice though... Cept the fact everyone makes fun of me cuz my guts are on the floor half the time.", "action_results": []}, {"action": "razor, Pills, Water. gotta take my meds and get cleaned up, it's still early.", "result": "I went into the bathroom and began to tidy up, Took my meds... I used to see everything in bright blue and yellows when ever I took my meds, My doctor always told me it was a placebo effect becuase it always happens RIGHT when I take them... Now I see a red arrow with, GO HERE TO WIN On the mirror painted in what appears to be the blood of a thousand virgins... or Ketchup I never can tell... Before I got a good idea of what it looked like outside the bathroom everything began to fade as it always does and I only caught a faint glimpse of what I guessed was an arrow going down the stairs.", "action_results": [{"action": "Run downstairs to check the arrow before it goes away.", "result": "I started to run down stairs... then I forgot about the you know... Stair slide... I slammed face first into the door knob... Lost my teeth, Swollowed 2 of them... and well... Died I guess would be the best choice of words.. No one ever tells you not to put fake spikes on your door knob I mean come on IT LOOKED COOL 2 WEEKS AGO! Heaven is nice though... Lots of drugs to make yourself forget everything.", "action_results": []}, {"action": "take another pill.", "result": "I took another one... but the effect was alot less then last time... So I took one more... Then another... Then another... To be honest it's kind of ironic that I commited suicide on an Anti-Depressent where the main Side-effect was, Warning May lead to paralysis, This IS INFACT a saftey device to keep patients from taking more then one... Guess I had a little help from the house there huh?", "action_results": []}, {"action": "walk down the stairs.", "result": "I walked towards the stairs, then remembered I now had a buit in slip n' slide where my stairs SHOULD be so I slowly lowered my self down the stairs rail by rail. As I reached the bottom of the stairs I looked around... and saw nothing Best idea would be to.", "action_results": [{"action": "Take another pill.", "result": "I took another pill and saw an arrow pointing to the kitchen, I ran towards the kitchen and found another pointing towards the living room... From them I think I vaguely saw an arrow pointing down to the basement, but also saw a brighter red arrow pointing out to the yard.", "action_results": [{"action": "I went down to the basement.", "result": "I made my way down to the basement and well.. my head connected with a pipe that to my knowlege wasn't there before... I got a face full of blood as I hit the ground... I got up and looked at the pipe leaking blood onto my freshly unswept floor... Atleast it wasn't over above my piles of starwars memoribilia...I'd be pissed if it was chewy getting covered in blood instead of the floor and my wifes Liberachi Albums. Best idea was to... ", "action_results": [{"action": "tighten the Pipe... God knows how Close it's gonna get the Chewy...", "result": "As I tightened the pipe... I heard a quite whisper... It seemed to say thank you... I never knew what was going on that day... But atleast now I have a perfectly normal quite house... and I only had to spend 2 days explaining the gallons of blood on the floor to my wife...", "action_results": []}]}, {"action": "I went out to the yard.", "result": "You know that scene in the exorcist where she leaves the house and gets gang raped by a bunch of dead skeletons in that big \"swimming pool\" Well.. imagine that... but this time instead of skeletons imagine 500 angry hungry skeletons... that well.. Just want to eat your brains... Oh weeee just want to eat your brains were not unreasonable atleast no body wants to eat your eyes... needless to say... It was kind of hard for the coroners to judge the cause of death, they don't know if it was the fact that I was buried 60 feet below ground... or the fact that my brain was eaten out of my head...", "action_results": []}]}]}]}, {"action": "Check the balcony door.", "result": "I walked out to the balcony and got a breath of fresh air god knows i'll need it for whats about to come, Before I could turn around I heard the Door slam shut behind me, I tried to open it a few times... To no avail... then I heard a sliding almost like 2 pieces of granite having sex... I looked down to see the floor below me was slowly sliding away... Needless to say the coroners marked it as suicide, of course they were a litlte puzzled as to how I ended up UNDER the balcony instead of away from it when they found my body...", "action_results": []}]}, {"action": "Get my equipment", "result": "I decided I have to get this stuff on camera, So I walked into the hall closet and grabbed the camera, Voice recorder, and Emf reader... You know like the professionals... Haha At that point my best bet was to...", "action_results": [{"action": "Peel back the wall paper while recording.", "result": "I set up the camera, Got the Emf Reader going ballistic on it to man... was kind of funny... and then I got out the voice recording and started to narrate.\n\n \nWe Have hear a REAL spectral disturbance, Despite my Previous skepticism I am glad to see such a thing exists.\n\nClick went my recorder as I began to scratch away at the wall paper... Rolls and rolls of ancient parchment unfurled from the wall falling to the floor like so many sickeningly yellow cockroaches, There... Before me was a face...  A horrific face just smiling... Like it Knew something I didn't... Thats when I heard the click of the door lock... Before I could react my legs were already...", "action_results": [{"action": "Moving me towards the door.", "result": "I reached my hand towards the handle and josttled it a few times... nothing... nothing at all, from the living room I heard a quit cackle, Almost like a sheet of metal being urinated upon the yellow stream collecting at the bottom, collecting more and more deeping the twangs with each ounce. I looked about and...", "action_results": [{"action": "Ran to the basement.", "result": "A bit of a pack rat I prayed these steps wouldn't give out on me, Would be the worst I could imagine, Slamming into the countless piles of junk sitting in the basement and no doubt being crushed by them crushed by my own vice, how poetic. I made it down the steps safely and there before me was a pulsating, Throbbing pipe... Now I for one know pipes arn't supposed to throbe... Nor are they supposed to leak gallons of blood onto your floor So I decided to ...", "action_results": [{"action": "Tighten the Pipe... hell if i'm gonna let my house make a mess of itself...", "result": "I grabbed a wrench and began to attempt a shoddy tightening job... At first More blood poured from the pipe, but as I got a good rythm things began to taper off quickly... Soon the blood had stopped completely... as I threw the wrench to the floor I heard a hollow, empty voice that makes me cringe to think about it even now whisper, Thank You almost seemingly into my brain. Then I heard an almost un noticeble click of the door unlocking...\n\n \nNeedless to say.. .I moved out that weekend...\n\nEnd", "action_results": []}, {"action": "Bash the pipe, it looks like the life blood... If I can kill the fucker...", "result": "I lifed the nearby sledgehammer above my head, and brought it down upon the pipe, As It connected with the pipe gallons of blood began to shoot from the impact going straight up, at speeds I can only imagine, Ripping straight thru the ceiling and from what I could hear, Thru the entire house... then ... I slowly began to realize... the Blood spray was increasing.. and it was coming right at me...Before I could move out of the way... the sledgehammer I once held so proudly over my head shot back at me from the blood spray... and lodged itself very inconvieniently into my head...\n\n \nNow you see why it's so hard for me to remember... even in heaven you still have brain injuries... Damnit all.", "action_results": []}, {"action": "Kill myself..", "result": "This is to much for me... this is to much for any man really... I reached for the pistol I always kept loaded under a pile of rubbish (Don't ask I'm a strange man Ok!?) I brought the gun to my mouth and pulled the trigger... nothing but a hollow click... DAMNIT!! WHY!!! I suppressed the trigger again... Once again nothing... I threw the gun at the pipe and began to weep... Then ... like god answering my prayers, the pipe Sprayed a two inch stream of blood at me... To be honest I should have been weeping on my knees like I always do , but something just seemed special bout standing up... Now I have a 2 inch hole going thru my head... and I have a hard time remembering things... Because Even in heaven you still have brain damage... Damnit all.", "action_results": []}]}, {"action": "started to cry.", "result": "As I began to cry, The  door opened for me... Before I could get my hole body thru it... It slammed back shut.. It's not so bad being half a person it heaven... You never know what your second half is gonna say..", "action_results": []}, {"action": "Beat on the door.", "result": "I started to beat the door... nothing was happening... But I had to try harder... As I beat on it harder... and harder... I noticed my hands were some how going deeper and deeper into the door... It was then that I noticed the Door was slowly engulfing me from my feet up... Guess theres ways to go then smothered by a door.. atleast I get a few laughs out of the guys around the heavenly water cooler.", "action_results": []}]}, {"action": "Moving me towards the wall.", "result": "My hand reached out towards the wall with out my Previous consent... damn hand always trying to pull an Evil Dead... Well as my hand reached the wall... I felt something stir inside of me... and a voice...  A voice telling me to kill my neighbor... I Promise I'm not crazy... I promise I SWEAR!!! I DIDN'T DO IT!!!!!\n\n \n \nA burly Prison warden Walks up to you and grabs your shoulders.\n\n\"Come on kid, Best not to get him started... He might try to hit ya like the last guy... Make me a promise ok? Don't come here again... he ain't nuthin but a crack job, I promise.\"", "action_results": []}]}, {"action": "Kill myself.", "result": "I couldn't handle it... as I reached for the equipment each thing I brought out was busted and overly used... It reminded me of my childhood how we always try to use things to protect us from the things we are afraid of... Each of them was worn and battered... I didn't know if it could handle it...it... was getting to me... I walked to the bathroom to get my pills... Best to end it all before it ever began.", "action_results": []}]}]}, {"action": "Kill myself.", "result": "I began to think... Maybe... she didn't really love me you know? Maybe she's doing this on her own.. getting an excuse to leave me... Trying to leave me... You know I always noticed... When she would get undressed infront of me... She always tried to hide as much skin as possible... I always thought she was just being flirty... but now... well needless to say I went and unloaded as much jager meifter and Pain killers as I could into my system... and now... Here In hell.. I am forced the watch it over and over with out stop... Sometimes I even forget where things began and where they ended.", "action_results": []}]}]}]}