{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=23864", "context": "", "first_story_block": "It’s always dark where I am, but that’s okay. I like the dark, and I have the Mörker for company. He sits up in my head and watches. Sometimes he talks to me, tells me what to do. I do what he says, because otherwise he will punish me. I remember when I first met the Mörker. I was scared of him then, but now I am terrified. The Mörker tells me to do things that I’m not supposed to. You aren’t allowed to kill people, but he Mörker told me to, so I did. I killed lots of people. That’s why I’m here, in the darkness. To make me stop. But you can’t stop the Mörker. \n\n\nThe days pass, like they always do, sitting in the darkness with the him. We plan together, deciding what to do when we get out. I know we will, eventually. But in the meantime, the darkness is welcoming. It gives the Mörker and I time to think. Time to plan who will die first. The Mörker is very angry with the ones who put us here. But there is something deeper than just anger and resentment. There is pure hatred hiding within the Mörker, and I know he has a reason. I just need to know what it is. ", "action_results": [{"action": "You need to know", "result": "You chose disobedience. \n\n\nThe Mörker is stronger. He pulses inside of my head, his thoughts louder than mine. I think he does have a secret. I heard him thinking about it. I still don’t know what it is, but I push myself closer to it every day. Whatever he’s thinking about, it’s very important that I don’t know it. The Mörker doesn’t trust me enough.\n\n\nBut as he is getting stronger, I am getting weaker. He is taking control. Soon I will just be an empty shell inhabited fully by darkness. I don’t really mind if that happens. I’m always in the dark anyway. I just want to know what the secret is. \n\n\nI know that if I let him take control, I will be reduced to nothing. My soul will be pushed to the far corner of myself, and it will be locked away. All of my thoughts, memories, feelings, affections, grudges, gone. All traces of what I was before will be destroyed, lost forever. I'm forgetting most of that stuff anyway. Most of my remaining consciousness goes towards that secret. Towards what the Mörker is hiding from me. ", "action_results": [{"action": "Trick him", "result": "I know that there have to be limits to the power that the Mörker holds. While I still have control over some aspects of my mind, I know I can hide that burning desire for the truth. I weaken my barriers, invite him in. Pretend that I never heard anything of secrets or of the lies he is telling me. The Mörker seems pleased with me. He thinks I have given in completely. Thinks I am weak. \n\n\nI have succeeded! I have finally proved that I am not just a doll on a string, that I have a free will. I know the secret that he was hiding from me. I wish though, that I didn't know. The Mörker was trying to protect me, trying to sheild me from the real horrors of the world. He was trying to keep me from knowing how privileged I am compared to so many others, others that I have killed. They do not get the sweet bliss that comes with total acceptance of him. They will suffer eternally, while I only suffer for a short while. The Mörker has shown me that I must be grateful. I will give my body to him. It is of no use to me now. \n\n\n ", "action_results": [{"action": "Give in", "result": "There is nothing for me in this world. I am the Mörker. He is me. He is imbedded so deeply into my brain, he is more myself than I am. My consciousness flicks on and off, sometimes catching snatches of reality. But in all truth, what is reality? What if our perception of what is real and what isn’t is wrong? Who was it that said that all of the horror stories, all of the curses and demons, are just fragments of our imagination? What if they were real? Because I have seen past the boundaries of our world, been to a place where the line between dreams and reality is blurred. The Mörker is all-powerful, and all knowing. He can show me the way.\n\n\nYour last coherent thoughts were something about vengeance, but you don't know who you were talking to. ", "action_results": []}]}, {"action": "Break into his mind", "result": "I decide to do what naturally comes to me, what the Mörker has always taught me to do. To fight. But I am not stupid enough to attack right away. I bide my time, waiting for the best possible moment. Everything is dark, that is to be expected. The Mörker has not said anything to me for a while now. He seems to be sleeping, or possibly in deep thought. Either way, I know that my best hope is to attack while he is distracted. \n\n\nThe Mörker is shocked when he feels me throw my mind at him with all my strength. He retreats momentarily, confused. I have never shown any signs of resistance, so why now? I prepare myself for another attack and pierce his mind again and again, tearing holes in the slippery threads of his thoughts. My revolt seems to be working, I think his screams are fading. ", "action_results": [{"action": "Push harder", "result": "I know that the Mörker is devious. There is no way he would admit defeat this easily, so after catching my breath, I double my efforts against him. My heart pounds in my ears, my hands are shaking, my vision  is going white. I continue to batter the Mörker with endless assaults, slamming into him over and over again until his presence fades. As my head clears for the first time in decades, the darkness around me fades slightly. I can see, but barely. I glance down at my chest. Thick, oily black liquid oozes down my shirt, leaving behind a trail of tiny droplets caught on the fabric. I watch it, intrigued, and run my hand under the flow playfully. The liquid runs down my fingers, dripping softly onto the floor. Out and out it pours, soaking my feet and legs with slimy darkness. It spreads across the floor lazily, a never ending flow of pure nightmares. I tilt my head back and moan softly, as more of the liquid leaves my body, the less pain I feel. ", "action_results": [{"action": "The liquid reaches the door", "result": "The oily fluid starts flowing faster, and more and more of my clothes become sticky and dark. Ominous puddles of black are reaching far across the floor now, seeping into crevices where it will never be found. It does seem to have a mind of it's own, as it recoils from the light and cowers under the harsh metal bed frame. My head abruptly becomes dizzy, and I sit down gingerly, careful to keep the liquid from pooling in my lap. My eyes begin to droop, and my vision falters. I fall face-first off the bed onto the stone-hard floor, and black out.  ", "action_results": [{"action": "In the morning", "result": "\"Holy shit, what happened in here?\"\n\n\nGuards cluster around the door, unable to repress the sick fascination of gore that humans posses. One of the guards, apparently a leader, steps forward into the room, only to back out hurriedly, choking. \n\n\n\"Somebody call the fucking cops!\" he shouted at the unruly mob.\n\n\nAs the guards slowly dispersed, the interior of the room slowly became visible. Slumped over her metal cot was a young girl, perhaps around the age of 16 or 17. Her hair was dark, falling down her back in a cascade of tangles and knots. Her hand hung down from the bed, lightly skimming the floor. Her face wasn't visible, obscured by her thick hair. This would have been a relitively normal scene, bar the fact that the girl was dead. In the very center of her chest, she had torn into her flesh so deeply that the bones of her ribcage could be seen clearly. Her fingers were soaked in blood, and her fingernails were covered in the flesh she ripped apart. She had bled so profusely that the floor was now barely visible, and images of blood gushing from this poor girl's chest flashed through the unfortunate guard's mind. Here and there, chunks of skin and flesh poked up through the pool of blood, somehow scattered all the way to the other side of the room. \n\n\nAs police investigators arrived at the scene, it was immediately agreed upon that this had been a suicide.\n\n\n\"Such a shame.\" offered the deputy officer. \"We tried our hardest, but this one never seemed to even notice us. Wrapped up in her own little world, she was.\"\n\n\n\"Well I frankly don't give a shit why she died. I just need you to fill out the paperwork.\" a nearby policeman grunted.\n\n\n\"Oh, come on. You really think anyone will notice she was gone? Let's just get the team to clean up, dispose of the body, and be done with it. I gotta be home early tonight, I got no time for this shit.\"\n\n\nA general murmur of agreement was heard from the surrounding officers.\n\n\n\"Very well then.\" huffed the policeman. \"Nice to see you, Officer. You really need to swing round for coffee sometime, we haven't had a good chat in ages.\"\n\n\nAs the clean up team slowly began scrubbing at the floor, the deputy officer walked away slowly, his shadow growing darker with every step. Boy, his head hurt. Time for a holiday. He was getting too old for this shit. ", "action_results": []}]}, {"action": "The liquid stops", "result": "Gradually, the flow of the liquid slows to a trickle. The floor is almost completely covered by it, and I am soaked. My head spins crazily as I attempt to stand, and I collapse back on the bed heavily.\n\n\nWhen I wake up I can hear activity behind my door, which frightens me. I thought I was alone here, trapped with the Mörker. Come to think of it, where is he? I call out to him gently, but to no avail. I poke and prod the space in my head where he is supposed to be, but I feel nothing. I start panicking, without him, I am nothing! I start screaming frantically, thrashing wildly. Where is he, where is he? My chest is heaving, my eyes roll back in my head. What have I done? My hands go to my chest, where I forced the Mörker out. My breath comes in gasps and sobs, it's hard to see straight. My fingers curl around the edges of the gash that he came out of, and I consider just ripping myself in two. Am I strong enough? Would it work? Only one way to find out.\n\n\nJust as I prepare to tear open my skin, now slippery with blood, my door flies open. There is a person there, looking at me wildly. He rushes over and tries to take my hands. I snatch them away, screaming at him. What is going on? Who is this? As he moves closer to me, light from the door streams into the room and lands on my bloodstained fingers. I stop abruptly, staring at my hands. I had almost forgotten what light was. The man takes advantage of my stupor to grab my head in his hands, and he holds my chin up so that I am looking him in the eye. Maybe this person is the Mörker? Maybe he's come back for me? I look deeper into his pale blue eyes, and decide that the Mörker would never get inside this man. When I chose the Mörker, I chose darkness. Now, I am choosing light. \n\n\n ", "action_results": []}]}, {"action": "Back off", "result": "Exhausted, I pause my attack. Self-doubt rushes wildly into my mind, and suddenly I'm not sure why I was even attacking him in the first place. Don't I know how privileged I am? To be at one with the Mörker is a gift to great for my worthless self. I rush to the Mörker, frantically checking over him. He seems okay, but shaken up. I begin to weep. I truly am a waste of space. The one person who trusts me and talks to me, and I attack him. How could I be so ungrateful and evil as to revoke him after the kindness he has shown me? The real enemy is the people who put me in here. They are the ones that deserve to die, not the Mörker.\n\n\nThe Mörker begins hissing excitedly. He is pleased by what I am saying. I realize then, as he praises me, that this feeling of accomplishment and self worth are truly worth doing anything for. I reach out to the Mörker, asking him for help. He nods his head slowly, and I feel his power coursing through my veins. I can do anything I want. I am invincible as long as he is with me.\n\n\nI stand up, holding my head high. I stride confidently over to a heavy door at the front of my room. It's the only door, so it must lead out. I cock my head to the side, considering my options. Then, in a burst of anger, I bring my fists down on the steel casing. It crunches beneath my hands, and it is as I stand triumphant, free at last, that I realize all I had to do was be one with Mörker. ", "action_results": []}]}, {"action": "Lay low and listen quietly", "result": "I know that the Mörker is strong, and I do not doubt that he could crush me if ever I showed resistance. So I cower beneath him, stay the ever-faithful servant. It's the best that I can do to keep from being overwhelmed, he is smothering me, killing me slowly. I don't think I can last him out either, I am being worn down much faster than I imagined. \n\n\nDays pass, and soon I become unrecognizable. My mouth is foaming, my brown eyes turn to black. My hair grows longer, thicker, wilder. I loose weight, now my spine sticks out of my back. My skin is grey and dry, my nails long and my teeth sharp. I look like a monster. I am barely conscious, but I can hear growls and screams echoing around my room. I am the Mörker, and I love it. ", "action_results": []}]}, {"action": "No you don't", "result": "You chose submission. \n\n\nI know that I will never break down the walls that the Mörker has built around his secrets. He is far more powerful than I could ever imagine, and I know that if I anger him I will suffer. Nothing, no piece of knowledge in existence, is worth the Mörker's wrath. I decide not to worry about whatever fragment of enlightenment he is hiding from me. It would probably shatter my unstable mind anyway. \n\n\nAs days pass I forget about the secret altogether. In my last days of consciousness, my thoughts are focused on the changes around me. I observe from the sidelines, detached and unemotional. I have no connections to the creature being eaten by darkness. I can only watch, and be afraid of what is to come. ", "action_results": [{"action": "Observe from afar", "result": "You chose acceptance\n\n\nNow the Mörker’s thoughts are screamed inside my head. I no longer control what I do at all. I scream without knowing. My brain is in turmoil. My fists are bleeding from pounding on the walls. My fingernails are raw and broken and the door has long scratch marks embedded into the wood. My clothes are stained with blood and tears. I am a wreck. My face grows even paler against my bloodshot eyes. \n\n\nThe walls are covered with red diagrams and words. I think it may be written in blood. My blood? I don’t remember. I’m loosing me memory piece by piece. Now there are long gaps of blankness, times when I cannot remember where I was or what I was doing. It frightens me a bit, but I must embrace the Mörker. My mind cannot focus on who I am or where we are. I can hear things in the walls, scuttling and scraping. The room isn’t just dark; the blankness is thick, heavy, suffocating. Almost like I could reach out and touch it. I think I’m going mad.\n\n\n ", "action_results": [null, {"action": "A noise", "result": "And suddenly, I was back again. Back in my head. In control. For a moment, I was confused, disorientated by my own mind. It had changed, I could see that the darkness and the Mörker had left their mark. I was human again, but I wasn't sure why. What had been so powerful, so pure, that it had forced away the Mörker? My skin began to tremble lightly, goose bumps forming gently on my skin. I was cold, so cold. And for the first time in a while, I was scared. \n\n\n ", "action_results": [{"action": "There it is again", "result": "I can hear the noise more clearly now, it sounds like shuffling footsteps. A person! There is someone out there, behind my door. Someone so powerful that the Mörker is afraid of them. The sound of a key turning in a rusted lock puts my teeth on edge. Squealing hinges protest as the heavy door swings open. The person stands there, looking at me wildly. He rushes over and tries to take my hands. I snatch them away, staring at him with wide eyes. As he moves closer to me, light from the door streams into the room and lands on my bloodstained fingers. I stop abruptly, staring at my hands. I had almost forgotten what light was. The man takes advantage of my stupor to grab my head in his hands, and he holds my chin up so that I am looking him in the eye. I study his face, drinking in human features as if I was dying of thirst. His eyes are the most captivating, they are the lightest blue, so soft and fragile it would tear if my dirty fingers tainted it. I reach out my hand, and he clasps it tightly. I ned to stay with him. He can make the Mörker stop. ", "action_results": []}]}]}, {"action": "Fight back", "result": "You chose to show resistance.\n\n\nIt was getting worse. I no longer control what I do at all. I scream without knowing. My brain is in turmoil. My fists are bleeding from pounding on the walls. My fingernails are raw and broken and the door has long scratch marks embedded into the wood. My clothes are stained with blood and tears. I am a wreck. My face grows even paler against my bloodshot eyes. And I'm sick of it.\n\n\nMy life before had no point, until I found the Mörker. But its almost as if I've changed my mind, that I don't want to be a doll controlled by something so destructive and poisonous. I'm not sure, but maybe I want to be myself again. I want to be able to look back on my existence and not be ashamed. Almost subconsciously, I changed something inside my head. A tiny, tiny portion of my mind returned to me. And so it began. ", "action_results": []}]}]}