{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=45629", "context": "", "first_story_block": "You’re watching porn at home, in teenage bliss,\nWhen some fool starts texting—oh, it’s your Sis.\n“I can’t drive right now, come and get me,” she says\nSometimes, you really hate that fat stupid lez.\n\nChristmas party with friends, she’d be safe, she swore.\nBut her friends might as well be two dollar whores.\nAnd so you play the hero, when she gets lit.\nSucks, but now you gotta deal with this shit.\n\nResigned, you grab keys, slam the door of the car,\nCheck address and sigh; this place is pretty far.\nA manse in the woods, sounds like a bad movie.\nYet there you must go, to rescue that floozie.", "action_results": [{"action": "Shortly...", "result": "More texts arrive, as the road enters the trees,\n“Blake, things are getting kind of weird, hurry please.”\n“Most of my friends seem to be sick or in pain,”\n“But don’t call the cops, we’ve had lots of cocaine.”", "action_results": [{"action": "(Great.)", "result": "Well here you are! This old mansion is creepy.\nKatie better be real sorry and weepy.\nNo one cares to answer, when you ring the bell.\nSo you just let yourself in. Might as well.", "action_results": [{"action": "(Go in.)", "result": "This place, for a party, it’s oddly quiet?\nThough they sure trashed the place; looks like a riot.\nYet you see no one around, where’d they all go?\nThere’s two places to search, up high or down low.", "action_results": [{"action": "Search upstairs.", "result": "Ascending the stairs, they creak and they shiver.\nIf you break your neck, you’ll never forgive her.\nStench up here recalls wet dog, stains on the floor,\nJust past the landing, something bangs at a door.", "action_results": [{"action": "(Open?)", "result": "“Katie?” you ask, giving the brass knob a turn.\nJust a bit too hasty, a fact you soon learn.\nYour motives were good. Well, goodish, at least,\nBut the last thing seen are the teeth of a beast.", "action_results": [{"action": "{RIP}", "result": "", "action_results": [{"action": "Restart.", "result": "You’re watching porn at home, in teenage bliss,\nWhen some fool starts texting—oh, it’s your Sis.\n“I can’t drive right now, come and get me,” she says\nSometimes, you really hate that fat stupid lez.\n\nChristmas party with friends, she’d be safe, she swore.\nBut her friends might as well be two dollar whores.\nAnd so you play the hero, when she gets lit.\nSucks, but now you gotta deal with this shit.\n\nResigned, you grab keys, slam the door of the car,\nCheck address and sigh; this place is pretty far.\nA manse in the woods, sounds like a bad movie.\nYet there you must go, to rescue that floozie.", "action_results": [null]}]}]}, {"action": "(Wait.)", "result": "The door shakes, it rattles, but doesn't quite roll,\nA growl, and then, unearthly howls pierce your soul.\nSomething angry, heavy and large bangs against,\nTo back slowly away, seems good common sense.", "action_results": [{"action": "(Open?)", "result": "Wow. Just Wow. Stupid must be genetic.\nThe screams that follow are quite pathetic.\nMatted fur, red eyes, white fangs in dark muzzle,\nScatters your flesh like a jigsaw puzzle.", "action_results": [null]}, {"action": "(Nope!)", "result": "A wise choice, but it already has your scent,\nSmashing door to splinters, the beast’s red eyes glint.\nTwisted mockery of canine, teeth like knives.\nNothing to do now but run for your life.", "action_results": [{"action": "(Run down the hall.)", "result": "Sprinting away, like a little girl you shriek,\nMonster dashing behind in a furious streak,\nDead end up ahead. Oh no! Guess you’re fucked!\nBut wait, there’s a window, maybe you can jump!", "action_results": [{"action": "(Jump!)", "result": "The window is open, how lucky you are!\nYou roll off the roof, and then fall pretty far.\nThankfully the beast fears heights or something.\nYou stumble to your car, give the cops a ring.", "action_results": [{"action": "(Later.)", "result": "Of course, no one believes a word you say,\nAnd Katie is never seen past that day.\nHer friends, gone too--at first the cops blame you,\nThen change their tune, say there’s nothing they can do.\n\nThe government moves in, shuts down the whole site.\nThe suits pay a visit to your house, one night.\nHave you sign papers, “Everything is fine!”\n“It was all a delusion, just too much wine.”", "action_results": [null]}]}, {"action": "(Nah.)", "result": "Um. Okay. Not exactly sure of your plan,\nBut turn and face that monster, macho man.\nBefore you decide to fight or pray, you fall.\nBy doggy reduced to red slurry on wall.", "action_results": [null]}]}, {"action": "(Run into nearest room.)", "result": "Thinking fast, you pick a door and duck inside,\nBeast growls without, you didn’t exactly hide.\nBut there must be some way to give it the slip,\nOr your flesh and bones it surely will rip.", "action_results": [{"action": "(Dumbwaiter.)", "result": "You think you saw this in a movie once,\nSo you lower yourself down, instead of lunch.\nNow you’re on the first floor kitchen, but wait...\nA strange girl is here with a zombie-like gait.\n\nThe girl turns to face you, blood on her mouth.\nJust who the FUCK has she been eating out?\nThis girl is freaking you out, should you run?\nOr is it time for your smoothest moves, my son?", "action_results": [{"action": "(Smooth moves.)", "result": "“M’lady,” you start, but she seems unimpressed,\nIn your best fedora, if only you’d dressed.\nBut turns out she’s all over you anyway,\nAnd then you died. What more is there to say?", "action_results": [null]}, {"action": "(Run.)", "result": "You turn and dart down the hall, run past Kate...\nWait, what? Back up. Is this delusion or fate?\nSomething different about the way she walks,\nGlinting in her eyes, oddness when she talks.\n\nBe great to go home, but you're not sure of this.\n\"Katie? Is that you?\" You squint suspicious.\nShe giggles, “It’s me! And thanks for the ride.”\nBut you can’t help but have certain doubts inside...", "action_results": [{"action": "(Let's not question this!)", "result": "Well, “Don’t look a gift sister in the mouth.”\nAs a wise man once said. You think it was Proust?\nOr maybe it wasn’t. You don’t really care.\nYou’re taking “Kate” outside, into the night air.", "action_results": [{"action": "(To be fair...)", "result": "You know something is off. Her eyes are too bright.\nThe truth is, you were scared shitless that night.\nWander the evil house some more? Fuck that!\nNow technically, everything is wrapped up pat.\n\nAnd it’s all good, you like your new sister.\nJust ignore that sunlight makes her skin blister.\n‘Sides, this Kate doesn’t drink, not liquor at least.\nAnd you sleep fine, with cross blessed by a priest.", "action_results": [null]}]}, {"action": "(Begone, foul witch!)", "result": "“Just what the fuck is going on here?” you ask.\n“Blake, don’t be silly!” ‘Kate’ has a strange laugh.\n“Brother dear, let’s leave this place, forget this night.”\nNow you know something’s up, Kat’s NEVER this nice.\n\n“Tell me if you’re fake, I swear I won’t be mad.”\n‘Kate’ shrugs a bit, even looks a little sad.\n“I was trying to help,” she says with a purr,\n“Your sister’s downstairs, but you’ll never find her.”\n\nThen bright flash of light, and black cat runs away,\nProbably to shit somewhere, then sleep all day.\nBut hey, ‘downstairs’, good idea no doubt,\nStill hear snarling above, best to get out.", "action_results": [{"action": "(Search downstairs.)", "result": "Descending the stairs, they creak when you walk.\nIt’s dark down here, but you’re too manly to balk.\n“Anybody there? Your lights aren’t working.”\nYou helpfully call to anything lurking.\n\nLights flare to life, candles on skulls that glare,\nOoh, scary. You get it. You don’t fucking care.\nHere’s a spooky pentagram scratched on the floor,\nWhy not just put ‘Satanists’ on the front door?", "action_results": [{"action": "(Search.)", "result": "Shackles on a table and...is that blood real?\nThat’s incredibly unhygienic, you feel.\nWhatever, find Katie, get out of here quick.\nThese people are into some really weird shit.\n\nNext room, you find a book on a pedestal,\nYou touch it--the sensation regrettable.\nQuestionable leather stitched to the cover,\nRust-red runes, aura of wrong does hover.", "action_results": [{"action": "(Read it?)", "result": "You can’t quite make sense of the writing at first,\nTill the text resolves into blasphemous verse.\nStrange, writhing runes brand your flesh, start to glow.\nNot quite sure, but you THINK you just sold your soul.\n\nNow it ALL makes sense, you finally see clear,\nJust claw out your eyes, and stab out your ears.\nMan was not meant to witness abyssal planes,\nLet all that dark knowledge leak out with your brains.", "action_results": [null]}, {"action": "(Ignore.)", "result": "Yeah, this ain’t Skyrim, no mid-dungeon reading,\nJust locate your sister, and get to leaving.\nFinding Kate, easier said than done, of course.\nIt’s a maze down here, you yell till you’re hoarse.\n\nNo signal for texting to learn what the fuck,\nIt’s all down to you, your wits and your luck.\nOne hallway slopes downward, one ends at wall blank,\nFootprints and a draft, a hidden door, you think.", "action_results": [{"action": "(Look for door.)", "result": "So this entrance, it’s got to be here, let’s see...\nIf you were a secret door, where would you be?\nThen...aha! You’ve got it! A loose brick clicks.\nThis batshit house can’t fool you with its tricks.", "action_results": [{"action": "Enter", "result": "Come out on a balcony, take in the sights.\nBelow, a bizarre scene, it just ain’t right.\nDull red glow, eerie voices chanting.\nAround a portal, robed figures dancing.\n\nTo a tattooed man, they seem to give credit,\nNot a bad set up, if you can get it.\nPrisoners, forced to bow to the man in charge,\nSis easy to recognize, she is...quite large.\n\nWell! Time to free Kate, and be the big hero.\nBut, truth, you’ve never felt more like a zero.\nYou haven’t the slightest clue what to do.\nRegardless, right now, it’s all up to you!", "action_results": [{"action": "(Search for weapon.)", "result": "Searching the ledge for things stabby or shooty,\nYou stumble across unexpected booty.\nTwo strong, independent women, locked in cells,\nHow convenient, right there’s the key on a shelf.\n\n“I’m Layne,” says the raven-haired beaut with red lips,\n“I’ll kill that tattooed fuck and cut off his dick.”\n“Don’t believe a word she says!” the other cries.\nShe’s a blonde, mommish type, big tits and blue eyes.\n\nShe shows you a badge. “I’m Linda, detective.”\n“Layne is one of them, don’t trust her a second.”\nLayne rolls her eyes. “I’m a vampire,” she claims.\n“Ready to show these cultists a world of pain.”\n\nYou’re sure they both have backstories compelling,\nPathos to fill a novel best selling.\nBut to be distracted now, could death equal,\nSave chatting up NPCs for the sequel.\n\nSo, who to choose? It’s quite the dilemma.\nOfficer MILF or the foxy killa?\nWho can help the most, who can be trusted?\nMake up your mind, before the lock’s rusted.", "action_results": [{"action": "(Linda)", "result": "“Thanks! Now follow me, I know just what to do!”\nFew bad guys around, but this chick knows kung fu.\nShe leads you to a secret weapon stash.\nBoxes of ammo and shotguns that blast.\n\nTo mow cultists down you’re now fully equipped,\nYou take up positions, and let ‘er rip!\nThey seem surprised when you aim for their middles,\nRather upset, when with bullets they’re riddled.\n\nNow, wonder what Linda’s up to over there?\nBlows a hole in Tattoo’s chest, beyond repair.\nGrabs a book from his side, begins to intone,\nSome weird Latin shit, you don’t even know.\n\nShe steps toward the portal; it crackles with light.\n“I always wanted to be Queen of the Night!\nAnd Blake? By the way? You’re a gullible fuck.”\nA wave and a laugh and she’s gone. Just your luck.", "action_results": [{"action": "(So that happened.)", "result": "The ground rumbles, the walls tremble, the floor shakes.\n(And other phrases to describe earthquakes.)\n“Blake! What the hell! Hurry and undo this lock!”\nOh right. Katie, your sis. You almost forgot.", "action_results": [{"action": "(Hero time!)", "result": "The cell key unlocks her chains, imagine that!\nSomeone Up Above must want to end this path.\nThe building’s still shaking, it’s time to bail!\nThe stairs make Kat wheeze like a dying whale.\n\nBursting out the front door, you did it, you’re free!\nWell done! You win! A hero you’ll always be.\nMake haste for the car, peel out in the drive.\nMansion sinks to Hell behind you, what a dive.\n\nKat is sorry, she picked such a bad party,\nHer thanks are profuse, her gratitude hearty.\nBut ten minutes later, Katie is snoring.\nBitch forgets the whole thing, by the morning.", "action_results": [{"action": "(End)", "result": "Unbelievable! Blake didn’t die.\nHere, have a well-earned slice of pie.\n\n\n\n(By the way, this is the best ending you’ll get,\nDodged a dozen much worse, you’re good at this shit.)\n\n(Another aside, congrats, you unraveled,\nthe absolute longest pathway to travel.)", "action_results": [null]}]}]}]}, {"action": "(Layne)", "result": "“Good choice. Now wait outside a moment, please.”\nReasonable request. You feel quite at ease.\nThere comes to your ear a sound like bones snapping,\nLayne steps out, informs you Linda is napping.\n\n“I’ll kill the cultists, stay beside me, don’t slip.”\nSeems you’ve been downgraded to inept sidekick.\nBut vampire, sure. You let her do what she does,\nAnd a guard is soon missing most of his blood.\n\nWhen you reach the portal she really cuts loose,\nGoes after Tattoo with no quarter or truce.\nFight’s pretty cool, they’re all flipping and shit,\nYou avoid cultists, try not to get hit.\n\nThen...whoops! Layne gets skewered, though she’s not mortal,\nStrong enough still, drags his ass through the portal.\nThey both disappear in a flash of bright light,\nGround starts to rumble, better call it a night.", "action_results": [{"action": "(Moving on.)", "result": "Cultists are freaking out or whatever,\nYou go for Kat, try to keep it together.\n“Blake! Get me out of here, this party’s the worst!\n“No shit Sis, let’s go, ‘fore we leave in a hearse.”", "action_results": [null]}]}, {"action": "(Both?)", "result": "Vaguely you hope this will end in a threesome,\nBut the ladies alas, just won’t see reason.\n“Bloodsucker!” “Witch!” then both fall to fighting.\nThe ruckus draws in the guards like lightning.\n\nDashing out of a side door, bravely you run,\nSo much for help, now you’re back to square one.\nBut you suppose, while attention’s diverted,\nYou’ll free Kate, ‘fore cultists get perverted.", "action_results": [{"action": "(Stealth mode.)", "result": "Low to the ground, action theme blaring in head,\nAren’t you precious. Just try not to wind up dead.\nYou can’t shake the feeling you look like a dweeb,\nBut soon you spot the distraction you need.\n\n\nA pooch on a leash, like the pupper upstairs,\nLooks raring to go, find someone to tear.\nUnpredictable yeah, it’s taking a chance,\nBut he’d be just the thing to crash this dance.", "action_results": [{"action": "(Unleash?)", "result": "In a moment you’re showered in bloody rain,\nFuckin dog cleans house like a hurricane.\nYou free Katie and friends, tell them to run,\nThen oops, your foot slips, it looks like you’re done.", "action_results": [{"action": "(Ack.)", "result": "Hit the ground hard, get up in a hurry,\nPooch runnin’ towards you in a crimson flurry,\nYou dodge to the left, but should’ve gone right,\nKnocked into the portal, it erupts with light.\n\nWhere you wind up, no one ever can say.\nHouse up and vanishes, by dawn of day.\nKatie feels real bad, for what has been done,\nDecides to become a fat lesbian nun.", "action_results": [null]}]}, {"action": "(Never mind. Just...throw a rock or something?)", "result": "On second thought, it’s simpler to throw a rock.\nDon’t need some crazy mutt to bite off your cock.\nYou find one, pitch it, but the cultists act wrong.\nThey don’t all swarm over there in a throng.\n\nWorrisome how they now search for you.\nGames were wrong. Not a stealthy thing to do.\nThough now you wish you’d found a savepoint,\nAs these nutters grab you, your bones to disjoint.", "action_results": [null]}]}]}]}, null]}]}, {"action": "(Downward.)", "result": "Soft curtains of cobwebs, brush against hand,\nWater drips, wet fetid air, hard to stand.\nUneasy feeling in pit of your stomach,\nThen a sight ahead makes your heart plummet.\n\nMassive chamber, webbed bodies, dangle in air,\nSome rotting, some fresh, with fixed glassy stares.\nNow THIS, this is bullshit. You cannot deal.\nTurn back? Go on? You’ll piss yourself for real.", "action_results": [{"action": "(Go on.)", "result": "Wow, great idea! Keep digging in deeper,\nThis surely can’t lead to date with the Reaper.\nIn fact, Ol’ Grim, he’s beaten to the prize.\nBy chitinous mandibles, rows of green eyes.\n\nSkittering down the wall, on too many legs,\nWhat happens next involves breakfast, and eggs.\nReally I’d rather not go into detail,\nSpiders are scary, and sanity frail.", "action_results": [null]}, {"action": "(Turn back.)", "result": "Yes. Let's leave, never think of this place again.\nNow where's that secret door, how do you get in??\nThen...aha! You’ve got it! A loose brick clicks.\nThis batshit house can’t fool you with its tricks.", "action_results": [null]}]}]}]}]}]}]}]}, {"action": "(Search side rooms.)", "result": "Forgotten trinkets, cobwebbed shelves, layered dust,\nPlethora of knickknacks, abandoned to rust.\nIn the last room, door slams, locks with a snikt,\nA tall man stand there, he looks pretty ticked.", "action_results": [{"action": "(\"Hello?\")", "result": "“A trespasser, I see. This displeases me.”\nYou start to stammer questions about Katie,\nBut...this man, so hot, you forget what to say.\nSo sexy, so pale, and you’re not even gay!\n\nYou stare awhile and feel quite mesmerized,\nThere’s just a certain...something, in his eyes.\n“Go stand in the corner till I want a snack.\nNo mortal shall interrupt my fucking nap.”\n\nThis all seems quite reasonable, and while\nHe climbs in his coffin you can’t help but smile.\n(Seems Katie is not getting saved after all,\nMalleable Blakie is now some vampire’s thrall.)", "action_results": [null]}]}]}, {"action": "(Run back down the stairs.)", "result": "Fleeing down old, steep stairs is tough for a man,\nFour legs are better, so much for this plan.\nBefore halfway down, you’re savaged by hound,\nDead, quite dead, before you tumble to ground.", "action_results": [null]}]}]}]}, {"action": "Search downstairs.", "result": "Descending the stairs, they creak when you walk.\nIt’s dark down here, but you’re too manly to balk.\n“Anybody there? Your lights aren’t working.”\nYou helpfully call to anything lurking.\n\nLight flickers on, candles on skulls that glower.\nThese must be eco-freaks, saving their power.\nYou spy a pentagram scratched on the floor,\nChristmas now, so why the Halloween decor?", "action_results": [null]}]}]}]}]}