{"tree_id": "http://chooseyourstory.com/story/viewer/default.aspx?StoryId=7817", "context": "", "first_story_block": "You are far from home on a trip when the morning news reports mass hysteria and multiple murders. At first you think it's a hoax. Unbelievingly, you listen as the broadcasts confirm that the recently dead are rising and cannibalizing the living!\n\nYou control your shock and try to think. Your hotel will not be safe. You are unfamiliar with the area, but you do have some ideas. You consider your options...\n\nFort Gyver - this old military base isn't too far. You think you'll be safe if you can get inside and grab some weapons. You expect to see many people, and zombies, on your way there.\n\nMarven Mall - this shopping mall isn't too far. It will offer a good mix of equipment and provide reasonable shelter, but you can expect to encounter many looters and zeds on the way.\n\nStackling Towers - this large, residential tower is very close. It's also practically abandoned now. It should provide good shelter. Food wont be a problem, but other gear may be hard to find.\n\nthe Country - You want to escape the area immediately and head for someplace less populated. You'll worry about shelter and equipment as you go. Reaching a rural area may be difficult, but once you're there it should be very safe.\n\nYou head to:", "action_results": [{"action": "Marven Mall", "result": "You head into the street towards the mall. There are very few people outside, but you do see some folks franticly packing cars in front of a high-rise condo a few blocks away. The morning sun sits brightly over the horizon. Far off,  you see an elevated freeway jammed with traffic. The sound of sirens drifts softly through the moist air from all directions- one seems to be getting closer.\n\nYou come to an intersection where there was a violent car accident involving a station wagon and a police cruise. You see no one around. The siren you heard has past far off and is now fading. A pharmacy on the corner has it's door held open by a headless corpse.\n\nYou look in the wrecks..... both vehicles are empty of bodies. The police car is locked and empty. The wagon took the bulk of the damage; blood covers the steering wheel and driver's seat and door. You decide to search it for anything useful.\n\nThe station wagon has a plastic grocery sack with a loaf of bread poking out the top. It's in the back away from the blood. The bag is flimsy though, and kinda full. There is also a large, leather lady's handbag on the front passenger side floor, so you grab it and dump it out in the back and stuff the plastic bag with the food into it. You then pick through the dumped contents for anything useful and put them back in the purse. Finally, you pull the spare tire out of the way and take the tire iron.\n\nAs you stand up from the wagon's trunk, you hear, \"Don't move! Put your hands up and turn around.\"\n\nYou raise your hands to your shoulders and turn. A cop is pointing a pistol at your face. She's large for a women. Her name tag reads- \"Heigs\". She says, \"Say something.\"\n\n\"Something.\" you reply.\n\nShe lowers the pistol and looks around. A bright red pony tail pokes out from beneath her dark blue hat. \"Do you know what's happening?!?\", she asks, grabbing your shoulder with her free hand and looking into your eyes.\n\n\"Well....\", you begin, not quite sure what to say.\n\n\"Zombies!\" she declares, as though that explains everything. \"Just like the fuckin movies! I didn't believe it till a few minutes ago....\" She trails off, lost in a thought, but quickly comes back. \"We have to get to the mall. There are too many reasons to explain right now. You comin?\" She asks. She starts off toward the mall, glancing all around. You follow her. ", "action_results": [{"action": "continue...", "result": " \n[two weeks later...]\n\n..... getting to, and in to, the mall wasn't a problem. The tire iron was VERY useful.... Dealing with the mall security guards wasn't hard either- Officer Heigs showed a strong sense of authority... and her side arm. Arguments over who could stay were quickly shouted down with a combination of common sense and base morality. There was a flood of refuges the first day, and the infection did nearly spread in the mall, but it was contained. Survivors stopped coming the second day, and the current head count is now over thirty. Clearing the building was more of a challenge, and many folks fear the inside of the mall is still unsafe.\n\nNow, a frightened collection of strangers defend it against an ever growing crowd of undead. There have been plenty of arguments, but everyone has remained civil, and a basic plan has been forming- and while most of the details are already agreed on, some are not.\n\nEveryone agrees that leaving will be necessary soon. It's only a matter of time before the food runs out... or the zombies get in. The vehicles in the garage can carry everyone, but they must be reinforced first. (and that work has already begun.) The destination is Pandrice Island, a small, sparsely populated island. To reach it, you'll need to get to Bay Point Marina for a boat (or possibly a helicopter). You and Katherine agree that it's a good idea.\n\nThe disagreements on the plan are about what to bring, and what supplies should be gathered on the way to the harbor. The different opinions have been championed by the emerging leaders. Support is split equally between them into a few groups; with a few folks, Katherine included, still undecided.\n\nThe leaders and their positions are listed below.\n\nRon Culling is a mechanic. Extra fuel and special tools are his priorities.\n\"We may have to fuel or fix the transportation at the marina.\"\n\nBrian Crane is a teacher. Extra food and general equipment are his priorities.\n\"We will need a good supply of the basic necessities.\"\n\nJack Matson is a soldier. Extra ammo and better weapons are his priorities.\n\"We need to arm ourselves! It's dangerous out there!\"\n\nWho will you support?", "action_results": [{"action": "the Mechanic", "result": "It's obvious that reliable transportation, both to and from the marina are the most crucial components of the plan. You spend the next few days convincing Katherine and Doc that the mechanic Ron Culling has the right idea, and you quickly build a strong majority. Jack Matson is furious over the final decision, and you see little of him after the vote.\n\nYou and Ron spend much of your time together in the garage preparing the vehicles, and you get to know him well. You also get familiar with the vehicles. You take a break from welding and look at them now.\n\n\"The cars should be as safe as the van by the time we leave.\" Ron says, reading your thoughts. The three cars have been reinforced, but not as well as the van. They do handle better, though. The van has been heavily modified- there are iron bars and chicken wire on the windows, a ram plate on the front, a gunner's hatch cut into the roof, puncture-proof tires... the works. It's the safest vehicle available, but it's also the slowest and least mobile.\n\nThe other vehicles are a pick-up truck (an F-350), and five motorcycles (all KLR650s). They haven't been modified, but they are the most mobile. The cycles have spare fuelcans, and the truck has four-wheel drive and a dual fuel tank. The cycles are the best for getting around all the stalled traffic, but they offer no protection from the zombies; or the weather. The truck is safer then the cycles, but not as much as the cars.\n\nYou return to welding, working for as long as able before needing rest.\n\nYou lay down and fall asleep.\n\nFrom a deep dream, you are jolted awake. Katherine is eagerly shaking you and whispering, \"We have to get out of here- NOW.\" She looks around. Behind her, you see Ron and several others, armed and ready. \"Matson has gone crazy! He's already shot Crane and his wife and God knows who else!\" You knew he was nutty, but you never suspected this. \"We need to leave. They're coming now!\" she ends.\n\nYour small band runs for the garage. Kat slows down to watch your back, but you urge her on. You are almost there when one of Matson's guards steps right in your way! You blast him in the chest and hurdle his body, leaving the head intact; Jack can deal with him later. Once inside, you jump in a vehicle and start it up. You take. . .", "action_results": [{"action": "a cycle", "result": "You rev up the motorcycle. Doc throws the garage doors open, and then violently cracks the skull of the single zombie lingering by the exit. Your companions jump in the other vehicles, waiting for your signal. Doc throws one more bag of gear into the truck before hurling himself on top of it.\n\n\"I'm riding with you...\" Katherine says as she steps to your bike. \"...but don't get any big ideas.\" she jokes as she gracefully straddles the seat facing backwards securely. You rest your weapon on the handlebars. \"let's three-sixty.\" she concludes with a final quip, her sub-machine gun gripped and slung tight about her broad shoulders and ample chest. You feel her draw a serious posture, and you begin your journey.\n\nBay Point Marina is still a long way off when you encounter your first serious obstacle- a horde of the undead congest your way through a small town. You nod to the drivers behind you waving agreeingly- you'll split up if needed. You slow down to consider your options.... you can:", "action_results": [{"action": "go through the mob of zombies on the main road.", "result": "You over-estimate the vehicle's capabilities, and your own, and soon find yourself stuck. Zombies surround you. You shoot desperately while trying to get out of the situation, but you are trapped. Katherine slows her rate of fire when her ammo is low. Your hands tighten- you are bit. Blood gushes from the wound and you feel faint. Katherine snaps the last reload into her weapon, looking at you sadly.....\n\nYou have not survived the zombie apocalypse.", "action_results": []}, null, {"action": "go across the farm to reach to the main road.", "result": "You decide to cut across the farm, hoping to avoid the zombies; or getting stuck. At least you won't get lost going this way. You follow a path between two overgrown rows of crop and turn onto a dirt road. Several zombies wander the fields and shuffle toward you and groan as you pass.\n\nFar ahead, you see a gate across the dirt road where it meets the main road. There are more shamblers on the road past the gate. Katherine grabs the door handle, ready to leap out to open the gate. But you have a better idea- you see a flatbed trailer, unhitched, tilted with it's rear touching the ground. You gas your ride and aim to hit the ramp straight.\n\n\"You can't be serious!!\" cries Katherine, \"Slow down! I can. . .\"\n\nBut your speed is just too great and your determination cuts her off. You are committed to the jump. The vehicle bucks violently as you hit the trailer, flying over it. You float weightless through the air. Then you clear the gate and land with a powerful jolt, bowling into three zombies standing in the road. You turn and drive away, leaving the small overrun town behind you.\n\nYou drive a few hours before reaching Bay Point Marina.", "action_results": [{"action": "Continue...", "result": "The Eastern sky turns pink and the air damp.\n\nBay Point Marina is in a secluded spot. A long driveway stretches before you, disappearing into the trees. You begin to wonder if you've taken a wrong turn, when soon enough, it opens into a parking lot. You see the various buildings and docks that comprise the marina. The rising Sun shines on the water and the boats. There are dozens of yachts of all shapes and sizes, maybe a hundred or more docked along several floating piers. You can smell the water. Pandrice Island seems closer than ever.\n\nIt will be safer in the day, at least outside, you've learned over the past weeks.\nThe rotters hate the Sun.\n\nGratefully, you see some of the other vehicles from your caravan already parked near the main building- a combination lodge, restaurant, gift-shop, and office. Thick rope and old life-preservers decorate it's blue and white facade. Off to it's side, you see a stack of headless corpses. Then you see one of your mates waving from the door. You park facing the gate, leaving the key, and stretch your tired legs as you stand. You take another look around at the other buildings and the docks before stepping inside. Far away, you think you see a figure in the shadow of a doorway, but disregard it.\n\nDoc greets you inside, expressing his happiness with a giant grin for both you and Katherine. The hotel lobby is nice. You wave to the other survivors lounging on couches and chairs which ring a large coffee table, and they shout back happily. Maps (or charts, rather) and books on boating are spread across the table.\n\nStill near the main doors, Katherine steps to a familiar looking duffel bag resting on the reception counter and begins picking through it. There are also several bottles of water and a few bags of chips on the desk, plucked from the shelves of the adjoining shop, no doubt. You chug a whole bottle, then slowly drink another with some chips while Doc explains the situation.\n\n\"There are a number of buildings,\" he begins, leading you and Kat upstairs. \"The hotel here should be safe for a day, but that won't be enough time to search and gather everything. And of course, we have to assess the boats available, choose one, load it, and leave. Soon. That mob that split us up last night.... some will try to follow us, I think... And just our presence here...\" he stops, not wanting to speak it aloud. \"We'll split into teams today to get everything ready for tomorrow morning.\"", "action_results": [{"action": "continue upstairs...", "result": "At the top of the steps, the first room's door is propped open. Down the hall, a disturbing dark patch stains the floor and walls. Doc continues into the room and walks to a broad window, stepping into the bright morning light and pointing out over the marina.\n\nYou join him at the window. The Sun feels good.\nThe boats rock lazily in the twinkling waves.\n\n\n\n\"You can see the best transportation.\" he says, pointing out and squinting. A few giant trawlers dominate the fleet of small craft. The two largest sit at the end of the longest dock. \"Once they're secure, Ron will hot-wire one and prep it. He'll need help clearing that pier and watching his back while he works. Should be easy.\"\n\nDoc moves his hand, drawing your attention to a large wood building near the water, to the right of the docks. \"The ship chandler's shop,\" he continues, \"sells boating supplies.... or did, anyway.\" There are several vehicles parked end-to-end encircling the main doorway; the doors are gone. It looks dangerous. \"We'll need food and stuff from there. Normally, that's where you'd also get fuel, at that fuel dock there, BUT with the electricity and the pumps out....\"\n\nHis hand shifts to a different building, to the left, past the farthest pier- this one is a low, broad, plainly-painted tin shed; obviously some kind of machine shop. A tall derrick sits just beyond it. A narrow service road reaches it from a corner of the lot. It doesn't seem dangerous, but it is far from any safety or help. \"The fuel tanks over there should have hand-cranked pumps. Besides, Ron may have to scrounge in there later for tools or parts.\"\n\n\"Of course,\" Doc says, shifting his hand to the window sill, pointing down, \"we'll leave a guard here to watch the hotel while a few folks rest up to guard tonight. They'll also watch the parking lot, the vehicles, and the driveway- just in case.\" Doc drops his hand. \"We're hoping more will make it before we leave.\"\n\nHe turns away from the window to face you and Katherine, ending his speech.\n\"Frankly, I'm just glad you made it.\" he concludes.\n\nThe three of you return downstairs to the lobby and join the others.\nThe group spends a few moments sorting out the details of the day before beginning.\n\nYou decide to:", "action_results": [{"action": "help secure the pier.", "result": "The group breaks up into parties and sets out from the hotel. You and Ron head across the parking lot. He carries an H&K MP5 submachine, and wears a small but heavily loaded backpack. You here tools and cans and other metal bits clanking about inside it as you walk. Reading the concern on your face, he shrugs his shoulders and heaves the gun. \"Heck,\" he says, \"bring 'em on. I got my phaser set to 'fuck-it-up'.\" He wags his thumb by the weapon's selector switch, which is pointing to a little red 'F'.\n\nYou reach the head of the pier. He shoulders the butt of his gun and gets serious. \"I'll watch the front and sides. You watch the back. Double-check the boats as we pass.\" Following his lead, you begin down the floating dock. It moves gently beneath your feet. You give extra care to your footing. You watch intently, but see nothing. You reach the end without incident. All the boats (at least on this pier) are clear.\n\nThe two of you climb on to the large boat Doc had pointed out earlier and, searching carefully, find it safe. Ron begins tinkering about while you stand on the deck, watching the pier. He blurts Star Trek references while performing his work. Occasionally he jots notes in a small notebook. It is suprisingly clean for the condition of his hands. He shakes his head approvingly as he inspects the vessel, and you take it as a good sign. \n\nThe first time Ron starts the engines, for a second, you feel the irrational urge to just run. Right then and there. To just flee in the boat, as it is, leaving reason and caution and your companions behind. The impulse lasts only a moment, but it is a strong one. You begin to feel the exertions from the previous night catching up to you.\n\nThe day passes uneventfully. You are pretty sure Ron has checked everything at least four times, if not more, before finally asking him if he's ready. He admits he's being overly thorough, and motions to the hotel with his notebook.\n\nYou return to the security of the lodge. You wash, eat, and lay to rest. Exhausted from the toil of the previous night's flight and the day's vigil, you instantly drop to sleep.", "action_results": [{"action": "continue...", "result": "Dreams of life before the out-break swirl in your mind with images of your former shelter. Faces of family and friends mix in an overlay with the horrifying sights you've seen since the outbreak. Your memory betrays you. A dizzying collage of aquaintences and dead strangers warps into a frightful parade. Then, one face grabs your vision- it's features are a bizzare mix of Katherine and your mother, zombified. She scowls at you in sour disappointment, shaking a dead finger disapprovingly. You cringe, feeling guilty and ashamed and confused. Your body tries to squirm, but Hypnos' paralysis holds you.\n\nYou wake early. You are eager to get under way, as are all your companions.  Pandrice Island should be 24 hours away- if Doc, as Captain now, knows where he's going. And Ron Culling, as \"Chief Engineer\", can keep the engines running... by keeping the warp core stable and the plasma injectors clear, apparently.\n\nThe morning's preparations go smoothly and the boat is quickly stocked and boarded.  Your intrepid group leaves with the Sun still low.  Clouds gather on the horizon.\n\nThe marina fades behind as you set into open water. The waves grow alarmingly large away from the coast. The boat rolls in every direction, but mainly pitches up and down cutting through the foamy water. Many get sea-sick initially; Katherine and a few others never recover, remaining ill.\n\nDim, diffused light seeps from a thickening layer of white clouds through mid-day. Doc (now \"Cap\") and a fellow survivor, Brian, take turns navigating the trawler from the pilot house. You occasionally join them. Sea spray and rain confine everyone else to the living quarters. Discussions center on what you'll find, and the tactics of landing safely. Some hold the hope of finding other survivors already established there, but most think that unlikely. The night brings fierce weather and waves. The violence prevents proper rest.\n\nThe next morning brings better conditions, but when the expected time of arrival comes with no sign of Pandrice island, or any island, or any land of any kind, everyone grows concerned. A few panic and demand to turn back, but Katherine calms them, and Doc convinces them to wait, explaining the delay and reassuring them with a lamenated chart and a simple (but rugged) GPS device. The day passes with clearing weather. When it gets dark, Doc himself begins to secretly expresses some self-doubt and fear.\n\nThen, that evening, in a fragile nap you at long last hear a joyous cry from above. Brian is piloting from the top of the craft, pointing eagerly with a jabbing hand and offering cartoonishly large binoculars with the other. You climb to the flying bridge and scan the horizon with the heavy glasses. Everything is black. Then your eyes adjust, and you see it- a short, thin, [i]steady[/i], unbelievable steady, wonderfully steady line. It peeks meekly between the low waves from under the skirt of the sky. Doc joins you. He looks, then tilts his face to the sky and releases a sigh. You pat him on the back with a squeeze on the shoulder. He leaves to share the details of the news with the others.\n\nThe island grows enormous as you approach. Two hours pass before Brian finally kills the engine- the absence of it's droning is noticeable. The silhouette of land stretches wide before you. It is nearly midnight. Tomorrow, you will begin surveying the coast for a landing point.", "action_results": [{"action": "Pandrice Island", "result": "Your party landed safely on Pandrice Island.\n\nIn fact, you were welcomed- greeted by survivors already established there.\n\nAnd others came after you, in the months that followed. In those months, you occasionally returned to the mainland for supplies, and to search for more survivors. You found few alive, but there was always more undead. Every trip was a harrowing adventure. As time passed, the forrays were more to procure books (on every topic) and special items (like a short wave radio) and less on fuel and ammo. Eventually, you stopped going.\n\nNow, on the relative safety of the island, you attempt to build a new life and a new world. Hope has slowly returned. Your group has been in radio contact with a number of groups scattered around the world. They congratulate Katherine on her pregnency.\n\nYou have survived the zombi-pocalypse......... for now.", "action_results": []}]}]}, {"action": "help secure the chandler's shop.", "result": "The short walk to the shop is lead by Bonnie, a tough older women heavily armed with an M-16 in her hands, two bandoliers across her chest, two sidearms on her hips, and a two-way radio clipped to her belt. She moves forward slowly with the rifle firm to her shoulder, cheek to the butt, barrel straight. You follow close behind watching the right side, while Frank (her grandson) guards the left. The parking lot is wide open and obviously clear, but caution is the better part of prudence, you've all learned. The three of you move in a tight formation to the outer edge of the half-circle of cars surrounding the main door to the Chandler's shop. Bonnie aims over the hood of a sedan and calls through the open doorway with a loud \"Hello.\" There is no response.\n\nA second shout returns an inarticulate grunt- then a long, steady groan. Bonnie opens fire in bursts through the open doorway. [i]Pa-pa-pak! Pa-pa-pak! Pa-pa-pak![/i] When she stops to reload, Frank begins to fire over the car into the doors, also in bursts. When she readies her weapon again at the door, he finishes his magazine and reloads. Silence seeps from the shop.\n\nAfter a short discussion, Frank and you move to either corner of the structure and check around to find it clear. Bonnie is still focused on the door. The building is very wide with only the one doorway open on the lot-side. You and Frank move to either side of the open doorway; it is clear just inside, from what you can see. Bonnie hurdles the bumpers between two cars (gracefully for her age) and resumes her deadly focus on the door. With a final nod, you and Frank enter the shop with Bonnie right behind.\n\nThe tall shelves of boating supplies and accesories makes the inside a labyrinth. The three of you move as a team from isle to isle, blasting one zombie after another. Now, you lead, with Bonnie and Frank at your sides, leaving a bloody trail of headless corpses through the shop. You only feel threatened once, mildly, when something moves behind you, but Bonnie has you covered; by the time you turn to look, the suprise is already slumping to the slick, tiled floor.\n\nThe action lasts only a few minutes, and after a double-check to confirm it's safe, Bonnie radios the other parties elsewhere with an \"all-clear\". You drag most of the bodies out of the way, then spend the remainer of the day gathering supplies for the trip.\n \nWell before dark, you return to the lodge to rest.\nYou focus your mind off the day's grim work on to what is ahead. ", "action_results": [null]}, {"action": "help secure the machine shop.", "result": "You walk towards the mechanic's shed with two others. Bert is an older fellow. An electrician, and a bit of a gear-head, he has become Ron Culling's ad-hoc assistant mechanic. He carries a walkie-talkie clipped to his gunbelt. Stacy Watkins, your other teammate, is also something of a grease-monkey. Both will know there way around the shop. You tag along as an extra hand. The three of you discuss what you'll find inside. You look ahead down the short dirt drive to the end of the shed at the large, roll-up cargo door and relatively smaller people-door beside it, and wonder.\n\nYou walk the perimeter of the building. On the far side, the ground is paved, with a long (empty) boat slip cutting into it from the water's edge, looking very much like a swimming pool. The paving is hedged by engines and other discarded machinery. Towering among them are a large crane and a sausage-shaped tank. Beyond it all sit several boats propped on racks; they look uncomfortably out-of-place on land in the air with their hulls exposed.\n\nYou hear gunfire in the distance, from the far side of the marina. It persists for a few minutes in bursts, and you begin to consider turning back, when soon enough Bert's radio crackles with the \"all clear\".\n\nThe back wall of the shop is a row of cargo doors- one is partially raised off the concrete to knee-height. Standing several feet from it, you lower yourself to the ground with one hand, pistol in the other, and lay on your belly, aiming. Bert and Stacy follow your lead and step to either side of the door, looking nervously back-and-forth between you and their feet before stepping up and heaving it open. You stand, they step in scanning, then you enter.\n\nThere is nothing of concern, you find, and quickly go about the business of checking the fuel tank outside (which is nearly full, thankfully) and finding a hand pump. Through the day, you and the others hunt around the large shop, gathering what's needed and setting it by the yard-doors. Occasionally Ron (working on the boat) radios specific requests. The walls, shelves, and tables of the shop are cluttered with tools and parts; and cables, belts, hoses, rope, and chain; and boxes, crates, drums, buckets, and cans of... well, everything, it seems. It also appears to have been hastily searched. Sorting through everything becomes tedious. At one point you get a deep cut in your hand (through your gloves), greasy from the work, losing your grip on the (sharp) bracket of an electric motor. You bandage the wound before continuing.\n\nWell before dark, you return to the lodge, exhausted. You wash up and lay to sleep.", "action_results": [null]}, {"action": "rest now and guard tonight.", "result": "Already fatigued from the previous night's drive, you decide to rest today. The night watch will be broken in to shifts, with you and a young man named Phillip taking the first shift from 5pm to midnight.\n\nYou find a comfortable spot and stretch out. You feel very safe in spite of the unfamiliar surrounding. You sleep deeply and dreamlessly through the day.\n\nYou wake just before sundown. You find your firearms freshly cleaned, with extra ammo stacked neatly beside them. The arrangement includes two big flashlights- one is a long D-cell type and the other is a brick that looks like it's powered by a car battery, maybe. A backpack, conspiciously left on the floor, contains bottled water and soda, chips, jerky, and chocolates. '[i]Milk would be nice[/i]', you think. The pack has another flashlight secured in a short loop on it's outside. (Where ever -a- light is required, TWO or more are better, just in case, you've all learned through this disaster.) You give each torch a quick switch on and off, then triple-check the weapons. You are prepared for the night.\n\nPhil and you post up at different corners on the short end of the hotel, watching all around, and watching each other. You take turns every half-hour walking around the hotel, then around the lot up to the drive and back; in between you wait in silent vigil. You use a light on your rounds, waving it to draw any possible attention to yourself, armed and ready as you are, but the marina remains clear of threats all evening.\n\nOn your last circuit, as you walk the parking lot, you see a flicker of light from the woods. You peer deep into the darkness and see it again; and then again. A vehicle is coming up the drive. You flick your light in it's direction and get their attention as they pull into the lot. It's one of the cars from your splintered group. They speak excitedly in spite of their obvious fatigue. Each holds an expression of uncertain relief spoiled by stubborn fear. Phil takes a minute to calm them, then shows them into the hotel. You keep alert throughout.\n\nAt midnight, you and Phil are relieved from your watch and retire to the lodge. For a time you lay nervously, but eventually doze off.", "action_results": [null]}]}]}]}, {"action": "go across the farm and follow the railroad tracks.", "result": "You turn off the road, gently weaving between the trees on to a dirt road circling the farm. You have no problems cutting through the overgrown rows of crop when required. The moonlight reveals a fence far ahead, but you see your way- a small berm of dirt pokes from the horizon. You gun the ride hoping to hit it at just the right angle.\n\n\"You can't be serious!!\" cries Katherine, \"Slow down! Look for another. . .\"\n\nBut your speed is just too great and your determination cuts her off. You are committed to the jump. The vehicle bucks violently as you hit the tiny hill, flying over it. You float weightless in the air. Then you clear the fence and land with a powerful jolt, still rolling on rubber.\n\nYou slow down listening for any damage, bouncing your weight up and down; all seems well. You pull on to the train tracks and follow them as far as able before returning to the main road. There is little resistance as you avoid the small town.\n\nYou drive a few hours before reaching Bay Point Marina.", "action_results": [null]}]}, {"action": "the van", "result": "You rev the van, ramming the garage door and bursting out in to the night. Katherine pops up out of the hatch, blasting. You plow through any undead in your path, doubtful of the vans stability. Your companions follow behind in the other vehicles, letting you to lead.\n\nYou shove your way through stalled traffic and deserted quarantine checkpoints, lumbering persistently into the undead that cross your path. Katherine defends it from the hatch like a Valkyrie with p.m.s. while Ron shoots from the windows. The van is a rolling fort; a tank.\n\nBay Point Marina is still a long way off when you encounter your first serious obstacle- a horde of the undead congest your way through a small town. You nod to the drivers behind you waving agreeingly- you'll split up if needed. You slow down to consider your options.... you can:", "action_results": [{"action": "go through the mob of zombies on the main road.", "result": "You gas it, knowing the best way through this is the fastest and most direct. You dont want to risk getting lost. Confident with Katherine at your side, you ram the thin first line of undead blocking your path, slowing to remain in control. You smash into another batch of rotters, tightly gripping the wheel. Your speed decreases. You hit another bunch before you can regain any speed. Then another. And another.\n\nThe zombies are everywhere. Katherine opens fire, blasting them off the windows and hood. You push your way slowly but forcefully through the raging crowd. The vehicle rocks and sways and you feel uncertain, but you keep it going.\n\nIt doesn't take long to clear the worst of them, but it seems like a lifetime. Katherine slows her rate of fire to save ammo. You reach a short clearing and pick up some speed, ramming the last batch of zombies on the main road as you leave the small town.\n\nYou drive a few hours before reaching Bay Point Marina.", "action_results": [null]}, {"action": "go around the bulk of them on the side streets.", "result": "You don't want to drive right through the zombies, but you also don't want to risk getting stuck or lost either. You weave around the larger groups of zombies, only ramming them when necessary. Your path takes you around several corners and you grip the wheel tightly to keep your direction and your speed.\n\nZombies reach for you, groaning, but a combination of speed and skillful driving, and Katherine's shooting, keep most of them off. Surprisingly, some of them club at you with pipes and bricks and other debris. Some even throw them. Bottles smash against the chicken-wire. Katherine sees one wielding a police baton and drops him out of pity and anger.\n\nYou take another corner in the right direction and find the number of zombies this way to be thinning. You ram one to avoid swerving, it's head smacking open against the hood. The rain of rocks and bottles fades as you pull back onto the main road, leaving the small town.\n\nYou drive a few hours before reaching Bay Point Marina.", "action_results": [null]}, null, null]}, {"action": "the truck", "result": "Katherine throws open the garage. She blasts the few shamblers standing near the door and jumps into the truck, reloading the shotgun. Your companions in the other vehicles are ready as you pull forward in to the night.\n \nYou pick your way carefully through the stalled traffic. You pass deserted quarantine checkpoints, moving fast enough to shake any zombies when possible, and trusting Kat's deadly accuracy when not. You are confident of the truck's capabilities, and use the four-wheel drive to good effect.\n\nBay Point Marina is still a long way off when you encounter your first serious obstacle- a horde of the undead congest your way through a small town. You nod to the drivers behind you waving agreeingly- you'll split up if needed. You slow down momentarily to consider your options before gunning it.... you:", "action_results": [null, null, null, null]}]}, {"action": "the Teacher", "result": "You agree with Brian Crane. A good mix of equipment is needed, with basic necessities taking priority. Clean water and food are vital. The two of you discuss the best way to explain it, and after some brain-storming, spend the next day successfully convincing the others. Matson and his buddies aren't happy, but they do agree that you have a point. You are glad they are understanding, because you know how important cooperation is for the plan to work.\n\nThe last undecided details about the plan now concern the vehicles, and when to leave. Ron Culling, the mechanic, wants to spend time working on the truck. Brian wants to gather more supplies. And everyone wants to know who's sitting where, and trading seats, and then trading more as they shuffle. You think decisions need to be made soon- folks are talking more about Pandrice Island then they are about the barricades and zombies, and that's not good. There has already been an incident involving a small break-in due to a lax watchman, and that's worse.\n\nResting now, you consider the vehicles as you try to fall asleep.\n\n The three cars have been reinforced, but not as well as the van. They do handle better, though. The van has been heavily modified- there are iron bars and chicken wire on the windows, a ram plate on the front, a gunner's hatch cut into the roof, puncture-proof tires... the works. It's the safest vehicle available, but it's also the slowest and least mobile.\n\nThe other vehicles are a pick-up truck, and five motorcycles. They haven't been modified, but they are the most mobile. The cycles have spare fuelcans, and the truck has four-wheel drive and a dual fuel tank. The cycles are the best for getting around all the stalled traffic, but they offer no protection from the zombies; or the weather. The truck is safer then the cycles, but not as much as the cars.\n\nFurther details of the plan swarm in your mind as you doze off. Your dreams are filled with shimmering blue-green and foamy white; at first. Then they turn to a dripping, running red.\n\nYou wake to the sound of gunfire.\n\nBetween the bursts, you hear yelling and cursing; and screaming. Weapon in hand and moving fast, you find the worse case scenario unfolding around you- an unmanageable mob of zombies runs a muck! Katherine and the remaining survivors desperately fend them off.\n\nEscape is the only option. \"This way!\" you call, opening fire to cover the squad's withdraw. Jack Matson follows up the rear and prepares to support you to move when he is blind-sided by a shorter, surprisingly fast zed. It takes a savage bite from his ear before you can blast it.\n\n\"ArrahhhH!!!\" he cries as his fury surges. His M-16 chops across the room, snapping from target to target, each time belching an unerring flurry of lead. \"GO!\" he yells as he lowers the rifle to reload, not even turning.\n\nYour diminished band runs for the garage. Katherine slows down to drop some pursuers, but you urge her on. You are almost there when a zombie steps right in your way! You blast it without stopping and hurdle the body. Once inside, you jump in a vehicle and start it up. You take. . .", "action_results": [{"action": "a car", "result": "You climb into a fortified car and start it, checking the fuel gauge. Kat removes the last brace from the garage doors and jumps in the passenger seat. Your remaining companions wait for your signal in the other vehicles. You open the doors and pull forward, ramming the lone zombie lingering outside as you drive in to the night.\n\nThe car handles better then you expected, and you make your way quickly around the stalled traffic and abandoned quarantine checkpoints. Katherine casually blasts any zombies who try to cling on the barred windows when you must drive slowly. The car proves itself to be suprisingly nimble even when you are forced off the pavement.\n\nBay Point Marina is still a long way off when you encounter your first serious obstacle- a large horde of the undead congest your way through a small town. You nod to the drivers behind you and they waving agreeingly- you'll split up if needed. You slow down to consider your options.... you can:", "action_results": [null, null, null, null]}, null, null]}, {"action": "the Soldier", "result": "Weapons and ammunition are the key to survival, in your opinion. You think Jack Matson has some good ideas; they are better then the others, at least. You think your plan is better, of course, and some agree with you, but as much as you argue your case, most of the survivors side with Matson. You think the work, and decision making, would be going faster with a better leader- namely, you. And Jack knows this.\n\nDetermined to shake his support, you decide to bring up the plan details concerning the vehicles at the next meal. You have a clipboard from the garage next to your plate.\n\n\"I see you're driving the van, Matson.\" you begin dryly. The van is heavily modified- there are iron bars and chicken wire on the windows, a ram plate on the front, a gunner's hatch cut into the roof, puncture-proof tires... the works. It's the safest vehicle available, but it's also the slowest and least mobile.\n\n\"The cars should be as safe as the van by the time we leave. Everyone will be safe.\" he says, defensively. The three cars have been reinforced also, but not as well. They do handle better then the van, though.\n\nThe other vehicles are a pick-up truck, and five motorcycles. They haven't been modified, but they are the most mobile. The cycles have spare fuelcans, and the truck has four-wheel drive and a dual fuel tank. The cycles are the best for getting around all the stalled traffic, but they offer no protection from zombies; or the elements. The truck is safer then the cycles, at least for the driver, but not as much as the cars.\n\nYou continue to point out that Jack and his closest supporters have most of the best seats. The debate goes on for longer than you think should be necessary. You think most of the other survivors are just scared of Jack, so you give up, leaving to get some rest.\n\nYou quickly fall asleep.\n\nFrom a deep dream, you jump awake, weapon in hand. Katherine is gently shaking you awake and whispering, \"We have to get out of here- NOW.\" She looks around. Behind her you see some of your new friends, armed and ready. \"Matson has gone crazy. Ron says he's planning to kill you!\" You figured as much. And to be honest, you had considered the same. \"We need to leave. They're coming now!\" she says.\n\nYour small group runs for the garage. Kat slows down to watch your back, but you urge her on. You are almost there when one of Matson's guards steps right in your way! You blast him in the chest and hurdle his body, leaving the head intact; Jack can deal with him later. Once inside, you jump in a vehicle and start it up. You take. . .", "action_results": [null, null, null]}]}]}, {"action": "Fort Gyver", "result": "You head into the streets towards the military base. Sirens fill the morning air from all around. The Sun hovers over an elevated freeway, it's light glinting off the chrome and glass of the congested traffic. The streets are full of nuts driving like maniacs. Panicked refuges desperately pack their cars and fill the roadways.\n\nYou look to grab a weapon at the first opportunity, and it doesn't take long. A large army truck has crashed into a telephone pole and abandoned. A few guns have been left behind. You tuck two pistols into your waistband, pick up an assault rifle (or an smg, if you prefer), and a few bandoliers of extra magazines.\n\nYou adjust you new load and begin to move on when you hear a shot ring out from close by. Instinctively, you crouch at the corner of the truck. Looking around, you see a cop (about a block away) walk into the center of the road, their handgun trained on something laying in the street.\n\nWith a rush a figure, arms stretched out, appears behind the officer. Without hesitation you shoulder the butt of your gun and take a shot. Your target's head disappears into a red cloud as you hold the three-round burst on mark. The cop spins, looks, and begins to walk toward you. She's large for a women. Her name tag reads- \"Heigs\". She's pointing her gun at you. You still have your weapon at the ready. She stops in front of you and says, \"Say something.\"\n\n\"Something.\" you reply.\n\nShe lowers the pistol and looks around. A bright red pony tail pokes out from beneath her dark blue hat. \"Do you know what's happening?!?\" she asks, grabbing your shoulder with her free hand and looking into your eyes.\n\n\"Well....\", you begin, not quite sure what to say.\n\n\"Zombies!\" she declares, explaining everything with one word. \"Just like the fuckin movies! I didn't believe it till a few minutes ago....\" She trails off, lost in a thought.\n\n\"We have to get to Fort Gyver,\" you say, \"for too many reasons to explain right now. Let's go.\"\n\nYou blast your way to the base, killing everything in your path. ", "action_results": [{"action": "continue. . .", "result": "[two weeks later...]\n\nInside the fort, you and Officer Heigs, along with other survivors, now help a small contingent of soldiers fend off the unrelenting hordes of undead. Supplies are scarce. There have been plenty of arguments, even a shooting, but everyone has remained relatively civil since. A basic plan has been forming- and while most of the details are already agreed on, some are not.\n\nEveryone agrees that leaving will be necessary soon. The food is running out... and the zombies may get in at any time. There are vehicles available to can carry everyone, but they must be reinforced first. The destination is Pandrice Island, a small, sparsely populated island. To reach it, you'll need to get to Bay Point Marina for a boat (or possibly a helicopter). You and Katherine agree that it's a good idea.\n\nThe disagreements on the plan are about what to bring, and what supplies should be gathered on the way to the harbor. The different opinions have been championed by some emerging leaders. Support is split equally between them into three groups, with a few folks, Katherine included, still undecided.\n\nThe leaders and their positions are listed below.\n\n\"Doc\" Halloway is a medic. Extra medicine and medical equipment are his priorities.\n\"We need to keep everyone alive and in good health.\"\n\nRon Culling is a mechanic. Extra fuel and special tools are his priorities.\n\"We may have to fuel or fix the transportation at the marina.\"\n\nJack Matson is a soldier. Extra ammo and better weapons are his priorities.\n\"We need to arm ourselves! It's dangerous out there!\"\n\nWho will you support?", "action_results": [{"action": "the Medic", "result": "You think Doc Holloway, the medic, has the best plan. Over the next few days you convince Katherine and some of the others that more medical supplies will be needed most. You also spend a lot of time talking to Doc- mostly about the vehicles and supplies; but also about Pandrice Island. Now, the two of you chat over a late meal.....\n\n\"We'll move the rest of the supplies to the garage next week, the night before we leave. The last patrol found a lot of useful stuff at that location you suggested. Some of it's still in the van.\"  The van had been heavily modified- the windows reinforced with iron bars and chicken wire, a ram plate on the front, a gunner's hatch cut into the roof, puncture-proof tires... the works. It's the safest vehicle available, but it's also the slowest and least mobile.\n\n\"The cars should be as safe as the van by the time we leave.\" he adds, reading your thoughts. The three cars have also been reinforced, but not as well. They do handle better then the van, though.\n\nThe other vehicles are a pick-up truck, and five motorcycles. They haven't been modified, but they are the most mobile. The cycles have spare fuelcans, and the truck has four-wheel drive and a dual fuel tank. The cycles are the best for getting around all the stalled traffic, but they offer no protection from the zombies; or even the weather. The truck is safer then the cycles, but not as safe as the cars.\n\n\"Everyone is still arguing over the seating arrangements,\" he concludes, \"...but we'll leave that for tomorrow. For now, let's get some rest.\" You agree and say goodnight.\n\nYou lay down to sleep. The details of the plan, and the promise of real safety on the island, swarm in your mind as you doze off.\n\nYou wake to the sound of gunfire. Between the bursts, you hear yelling and cursing; and screaming. Weapon in hand and moving fast, you find the worse case scenario unfolding around you- an unmanageable mob of zombies runs a muck! Katherine and a few remaining survivors desperately fend them off. You join the fray, blasting one zombie after the other, but there is no end to them.\n\nDoc appears near your side, \"We have to get out of here!\" he yells, motioning in the direction of the garage.\n\nYour small group runs for the garage. Kat slows down to kill some pursuers, but you urge her on. You are almost there when a zombie steps right in your way! You dispatch it without stopping and hurdle the lifeless corpse. Once inside, you jump in a vehicle and start it up. You take. . .", "action_results": [null, null, null]}, null, null]}]}, {"action": "Stackling Towers", "result": "You can see the high rise building a few blocks away. Several cars are parked in front of it. Just as you step onto the side walk, someone demand, \"Freeze. Say something!\"\n\n\"Something.\" you reply, slowly raising your hands. \"What's this about?\" you ask, turning slowly to see a female police officer with a pistol leveled at you head. She's big. Her name tag says \"Heigs\".\n\nShe lowers the pistol and takes a quick look around and a bright red pony tail pokes out from beneath her blue hat. She grabs your shoulder with her free hand and looking into your eyes. \"Well....\" she begins awkwardly. Then her eyes go wide and her grip tightens. \"Zombies!!!\" she declares, explaining everything with a word. \"Just like the movies! I couldn't believe it till a minute ago....\" she trails off lost in a thought. Behind her, you see a police car- the passenger window is tinted opaque, with a tiny hole spreading a spider crack through the broken safety glass.\n\n\"We need to take shelter immediately.\" she says, eyeing the tower. Then you look at one another, nodding, and begin up the street.\n\nAs you get closer you can see several people frantically loading the parked cars while a few others look about wearily. One man on the sidewalk seems to be pleading with another intent on tying too much to his car roof. Their words grow louder.\n\n\"Jack, come on, look at the highway\" says the man on the side walk, pointing at an elevated freeway clogged with stalled traffic. \"Is this madness effecting you too now?!? You're taking a huge risk. We need you here, everyone else's already gone!\"\n\nThe man loading the station wagon stops only long enough to say, \"We're leaving, Brian.\"\n\nThey both turn as you approach. The man on the side walk (who's name is Brian, apparently) looks at the policewomen with you and points around the corner saying, \"Now look here, officer, that was clear case of self defense. There are plenty of witnesses to that. I don't know if you realize what's happening here, but...\"\n\nOfficer Heigs raises her hands and cuts him off, saying, \"Look, I'm only concerned with finding some place safe, and that's this building right here. Assuming there aren't a bunch of maniacs inside.\"\n\n\"We'd like all the help we can get!\" Brian declares happily. \"It's empty inside. Everyone's gone. Sam is already barricading the doors down in the garage.\"\n\nYou see a few strangers cautiously come down the street. A women by the doors walks out equally cautiously, to greet them.\n\nOver the next few days, you and the other survivors shore up the lower floors, and begin the methodical process of clearing and looting the many floors of Stackling Towers.", "action_results": [{"action": "Stackling Towers", "result": "Now, you and your fellow survivors defend the tower against an ever growing crowd of undead. There have been plenty of arguments, but everyone has remained civil, and a basic plan has been forming- and while most of the details are already agreed on, some are not.\n\nEveryone agrees that leaving will be necessary soon. It's only a matter of time before the food runs out... or the zombies get in. The vehicles in the garage can carry everyone, but they must be reinforced first. (and that work has already begun.) The destination is Pandrice Island, a small, sparsely populated island. To reach it, you'll need to get to Bay Point Marina for a boat (or possibly a helicopter). You and Katherine agree that it's a good idea.\n\nThe disagreements on the plan are about what kind of supplies should be gathered on the way to the harbor. The different opinions have been championed by the emerging leaders. Support is split equally between them into three groups, with a few folks, Katherine included, still undecided.\n\nThe leaders and their positions are listed below.\n\n\"Doc\" Halloway is a paramedic. Extra medicine and medical equipment are his priorities.\n\"We need to keep everyone alive and in good health.\"\n\nRon Culling is a auto mechanic. Extra fuel and special tools are his priorities.\n\"We may have to fix or fuel the transportation at the marina.\"\n\nBrian Crane is a college professor. Extra food and general equipment are his priorities.\n\"We will need a good supply of the basic necessities.\"\n\nWho will you support?", "action_results": [null, null, null]}]}, {"action": "the Country", "result": "You start walking towards a secondary highway. The main freeway is sure to be full of traffic. The morning air is still heavy with dew and carries the faint sound of sirens from all directions. You thought finding a vehicle would be easier, but you quickly realize your mistake. Determined, you press on.\n\nAs you approach the highway you find a car wrecked into the front window of a sporting goods store. You duck inside the store and grab a bat. One of the sirens you hear is getting closer. Further along you see another car, this one parked crazily across the curb with the driver's door open. You see it is empty and eagerly jump in, but it won't start. You repeatedly turn the key, pleading with the car and the fates, with the bat across your lap, when you are suddenly jerked from the car!\n\nA man, hangs over you, his teeth snatching at your face as you desperately hold him off. A large section of his scalp laps around like a loose toupee as you fight. His strength is overwhelming and you are sure his next push will will reward him will a mouthful of your nose, but instead of another lunge he goes slack. You push him off you and get up, looking around.\n\nYou see a female police officer standing next to a car with a pistol aimed at your face. She's big. Her name tag reads- \"Heigs\".\n\n\"Say something.\" she says.\n\n\"Something.\" you reply.\n\nShe lowers the pistol and looks around. A bright red pony tail pokes out from beneath her dark blue hat. \"Do you know what's happening?!?\", she asks, grabbing your shoulder with her free hand and looking into your eyes.\n\n\"Well....\", you begin, not quite sure what to say.\n\n\"Zombies!\" she exclaims. \"Just like the movies! I didn't believe it till a few minutes ago....\" She trails off, lost in a thought. Then she comes back, \"We have to get out of town!\" ", "action_results": [{"action": "continue. . .", "result": "The two of you got as far as possible, but without supplies or a plan your way was difficult and dangerous. Eventually you came across a group of other survivors, and you took refuge with them at a large farm, with their leader, Ben.\n\nNow, you and your fellow survivors struggle against the ever persistent trickle of undead that wander toward the farmhouse.\n\nThere have been plenty of arguments, but everyone has remained civil, and a basic plan has been forming about what to do. While most of the details are already agreed on, some are not.\n\nEveryone agrees that leaving will be necessary soon. The destination is Pandrice Island, a small, sparsely populated island. To reach it, you'll need to get to Bay Point Marina for a boat (or possibly a helicopter). You and Katherine agree that it's a good plan.\n\nThe disagreements on the plan are about kind of what supplies should be gathered for the trip to the harbor and to the island. The different opinions have been championed by various members. Support is split equally between them into three groups. A few folks, Katherine included, are still undecided.\n\nThe proponents and their positions are listed below.\n\n\"Doc\" Halloway is a medic. Extra medicine and medical equipment are his priorities.\n\"We need to keep everyone alive and in good health.\"\n\nBrian Crane is a teacher. Extra food and general equipment are his priorities.\n\"We will need a good supply of the basic necessities.\"\n\nJack Matson is a soldier. Extra ammo and better weapons are his priorities.\n\"We need to arm ourselves! It's dangerous out there!\"\n\nWho will you support?", "action_results": [null, null, null]}]}]}